; ModuleID = 'adler2.505ea615d7bd17fe-cgu.0'
source_filename = "adler2.505ea615d7bd17fe-cgu.0"
target datalayout = "e-m:e-p:32:32-p10:8:8-p20:8:8-i64:64-i128:128-n32:64-S128-ni:1:10:20"
target triple = "wasm32-unknown-wasi"

@alloc_a6e8913658d98d0dbd0444b57ddfd811 = private unnamed_addr constant [27 x i8] c"chunk size must be non-zero", align 1
@alloc_52400e043e1e9b1bf2be730ef0b31a1f = private unnamed_addr constant <{ ptr, [4 x i8] }> <{ ptr @alloc_a6e8913658d98d0dbd0444b57ddfd811, [4 x i8] c"\1B\00\00\00" }>, align 4
@alloc_57a8a8c930578b2e3ee501533f28ad28 = private unnamed_addr constant [113 x i8] c"/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/slice/iter.rs\00", align 1
@alloc_86ac038395504669b32d90cafd802417 = private unnamed_addr constant <{ ptr, [12 x i8] }> <{ ptr @alloc_57a8a8c930578b2e3ee501533f28ad28, [12 x i8] c"p\00\00\00K\07\00\00\13\00\00\00" }>, align 4
@alloc_32ea7ecd5472aadad13b1af66bc6f4d7 = private unnamed_addr constant <{ ptr, [12 x i8] }> <{ ptr @alloc_57a8a8c930578b2e3ee501533f28ad28, [12 x i8] c"p\00\00\00L\07\00\00\17\00\00\00" }>, align 4
@alloc_3ea62aae7b47b364d4b2ad2a9b4b6a6f = private unnamed_addr constant <{ ptr, [12 x i8] }> <{ ptr @alloc_57a8a8c930578b2e3ee501533f28ad28, [12 x i8] c"p\00\00\00N\07\00\00)\00\00\00" }>, align 4
@alloc_e534af126d4f0c0d6698aaa5e548da66 = private unnamed_addr constant [57 x i8] c"attempt to calculate the remainder with a divisor of zero", align 1

!0 = !{!"rustc version 1.92.0-nightly (6380899f3 2025-10-18)"}
!1 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !2, producer: "clang LLVM (rustc version 1.92.0-nightly (6380899f3 2025-10-18))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!2 = !DIFile(filename: "/Users/namse/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/adler2-2.0.1/src/lib.rs/@/adler2.505ea615d7bd17fe-cgu.0", directory: "/Users/namse/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/adler2-2.0.1")
!3 = !{i32 7, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = distinct !DISubprogram(name: "chunks_exact<u8>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$12chunks_exact17ha9938b64db1bfebaE", scope: !7, file: !6, line: 1238, type: !10, scopeLine: 1238, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !27, retainedNodes: !56)
!6 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/slice/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "63aedd801a9e6eae1eca1edc5c2217aa")
!7 = !DINamespace(name: "{impl#0}", scope: !8)
!8 = !DINamespace(name: "slice", scope: !9)
!9 = !DINamespace(name: "core", scope: null)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !17, !23, !29}
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "ChunksExact<u8>", scope: !14, file: !13, size: 160, align: 32, flags: DIFlagPublic, elements: !15, templateParams: !27, identifier: "a4106b262cfe1f6763d6b035828bf62f")
!13 = !DIFile(filename: "<unknown>", directory: "")
!14 = !DINamespace(name: "iter", scope: !8)
!15 = !{!16, !25, !26}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !12, file: !13, baseType: !17, size: 64, align: 32, flags: DIFlagPrivate)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !13, size: 64, align: 32, elements: !18, templateParams: !24, identifier: "31681e0c10b314f1f33e38b2779acbb4")
!18 = !{!19, !22}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !17, file: !13, baseType: !20, size: 32, align: 32)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 32, align: 32, dwarfAddressSpace: 0)
!21 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !17, file: !13, baseType: !23, size: 32, align: 32, offset: 32)
!23 = !DIBasicType(name: "usize", size: 32, encoding: DW_ATE_unsigned)
!24 = !{}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !12, file: !13, baseType: !17, size: 64, align: 32, offset: 64, flags: DIFlagPrivate)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !12, file: !13, baseType: !23, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!27 = !{!28}
!28 = !DITemplateTypeParameter(name: "T", type: !21)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !30, size: 32, align: 32, dwarfAddressSpace: 0)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !31, file: !13, size: 128, align: 32, flags: DIFlagPublic, elements: !33, templateParams: !24, identifier: "7c34cafe8ea1dcad4032b9360816105f")
!31 = !DINamespace(name: "location", scope: !32)
!32 = !DINamespace(name: "panic", scope: !9)
!33 = !{!34, !44, !46, !47}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !30, file: !13, baseType: !35, size: 64, align: 32, flags: DIFlagPrivate)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<str>", scope: !36, file: !13, size: 64, align: 32, flags: DIFlagPublic, elements: !38, templateParams: !27, identifier: "88212fc410c4399fd5095990cc8304ca")
!36 = !DINamespace(name: "non_null", scope: !37)
!37 = !DINamespace(name: "ptr", scope: !9)
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !35, file: !13, baseType: !40, size: 64, align: 32, flags: DIFlagPrivate)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const str", file: !13, size: 64, align: 32, elements: !41, templateParams: !24, identifier: "238a44609877474087c05adf26cd41fa")
!41 = !{!42, !43}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !40, file: !13, baseType: !20, size: 32, align: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !40, file: !13, baseType: !23, size: 32, align: 32, offset: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !30, file: !13, baseType: !45, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!45 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !30, file: !13, baseType: !45, size: 32, align: 32, offset: 96, flags: DIFlagPrivate)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_filename", scope: !30, file: !13, baseType: !48, align: 8, offset: 128, flags: DIFlagPrivate)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&str>", scope: !49, file: !13, align: 8, flags: DIFlagPublic, elements: !24, templateParams: !50, identifier: "4cfc3eea77dd95eabd59051b67bd7e66")
!49 = !DINamespace(name: "marker", scope: !9)
!50 = !{!51}
!51 = !DITemplateTypeParameter(name: "T", type: !52)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !13, size: 64, align: 32, elements: !53, templateParams: !24, identifier: "9277eecd40495f85161460476aacc992")
!53 = !{!54, !55}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !52, file: !13, baseType: !20, size: 32, align: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !52, file: !13, baseType: !23, size: 32, align: 32, offset: 32)
!56 = !{!57, !58}
!57 = !DILocalVariable(name: "self", arg: 1, scope: !5, file: !6, line: 1238, type: !17)
!58 = !DILocalVariable(name: "chunk_size", arg: 2, scope: !5, file: !6, line: 1238, type: !23)
!59 = !DILocation(line: 1238, column: 31, scope: !5)
!60 = !DILocation(line: 1238, column: 38, scope: !5)
!61 = !DILocation(line: 1239, column: 17, scope: !5)
!62 = !DILocation(line: 1239, column: 9, scope: !5)
!63 = !DILocation(line: 1240, column: 9, scope: !5)
!64 = !DILocation(line: 1241, column: 6, scope: !5)
!65 = distinct !DISubprogram(name: "new<u8>", linkageName: "_ZN4core5slice4iter20ChunksExact$LT$T$GT$3new17h63f4dc74490989ffE", scope: !12, file: !66, line: 1866, type: !67, scopeLine: 1866, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !27, declaration: !69, retainedNodes: !70)
!66 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/slice/iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "69db2748005f3986c6551b3886462616")
!67 = !DISubroutineType(types: !68)
!68 = !{!12, !17, !23}
!69 = !DISubprogram(name: "new<u8>", linkageName: "_ZN4core5slice4iter20ChunksExact$LT$T$GT$3new17h63f4dc74490989ffE", scope: !12, file: !66, line: 1866, type: !67, scopeLine: 1866, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !27)
!70 = !{!71, !72, !73, !75, !77, !79}
!71 = !DILocalVariable(name: "slice", arg: 1, scope: !65, file: !66, line: 1866, type: !17)
!72 = !DILocalVariable(name: "chunk_size", arg: 2, scope: !65, file: !66, line: 1866, type: !23)
!73 = !DILocalVariable(name: "rem", scope: !74, file: !66, line: 1867, type: !23, align: 32)
!74 = distinct !DILexicalBlock(scope: !65, file: !66, line: 1867, column: 9)
!75 = !DILocalVariable(name: "fst_len", scope: !76, file: !66, line: 1868, type: !23, align: 32)
!76 = distinct !DILexicalBlock(scope: !74, file: !66, line: 1868, column: 9)
!77 = !DILocalVariable(name: "fst", scope: !78, file: !66, line: 1870, type: !17, align: 32)
!78 = distinct !DILexicalBlock(scope: !76, file: !66, line: 1870, column: 9)
!79 = !DILocalVariable(name: "snd", scope: !78, file: !66, line: 1870, type: !17, align: 32)
!80 = !DILocation(line: 1866, column: 29, scope: !65)
!81 = !DILocation(line: 1866, column: 45, scope: !65)
!82 = !DILocation(line: 1867, column: 19, scope: !65)
!83 = !DILocation(line: 1867, column: 13, scope: !74)
!84 = !DILocation(line: 1868, column: 23, scope: !74)
!85 = !DILocation(line: 1868, column: 13, scope: !76)
!86 = !DILocation(line: 1870, column: 41, scope: !76)
!87 = !DILocation(line: 1870, column: 14, scope: !76)
!88 = !DILocation(line: 1870, column: 14, scope: !78)
!89 = !DILocation(line: 1870, column: 19, scope: !76)
!90 = !DILocation(line: 1870, column: 19, scope: !78)
!91 = !DILocation(line: 1871, column: 9, scope: !78)
!92 = !DILocation(line: 1872, column: 6, scope: !65)
!93 = distinct !DISubprogram(name: "remainder<u8>", linkageName: "_ZN4core5slice4iter20ChunksExact$LT$T$GT$9remainder17h72602d9d4c76d82aE", scope: !12, file: !66, line: 1893, type: !94, scopeLine: 1893, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !27, declaration: !97, retainedNodes: !98)
!94 = !DISubroutineType(types: !95)
!95 = !{!17, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::slice::iter::ChunksExact<u8>", baseType: !12, size: 32, align: 32, dwarfAddressSpace: 0)
!97 = !DISubprogram(name: "remainder<u8>", linkageName: "_ZN4core5slice4iter20ChunksExact$LT$T$GT$9remainder17h72602d9d4c76d82aE", scope: !12, file: !66, line: 1893, type: !94, scopeLine: 1893, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !27)
!98 = !{!99}
!99 = !DILocalVariable(name: "self", arg: 1, scope: !93, file: !66, line: 1893, type: !96)
!100 = !DILocation(line: 1893, column: 22, scope: !93)
!101 = !DILocation(line: 1894, column: 9, scope: !93)
!102 = !DILocation(line: 1895, column: 6, scope: !93)
!103 = distinct !DISubprogram(name: "panic_const_rem_by_zero", linkageName: "_ZN4core9panicking11panic_const23panic_const_rem_by_zero17h1ae5a15c993ea9f5E", scope: !105, file: !104, line: 173, type: !107, scopeLine: 173, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !24)
!104 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/panicking.rs", directory: "", checksumkind: CSK_MD5, checksum: "b120da646d1a09f31201b8a519374e57")
!105 = !DINamespace(name: "panic_const", scope: !106)
!106 = !DINamespace(name: "panicking", scope: !9)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !29}
!109 = !DILocation(line: 180, column: 27, scope: !103)
!110 = !DILocation(line: 180, column: 17, scope: !103)
!111 = distinct !DISubprogram(name: "panic_const_add_overflow", linkageName: "_ZN4core9panicking11panic_const24panic_const_add_overflow17hfc5f98782dfca12eE", scope: !105, file: !104, line: 173, type: !107, scopeLine: 173, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !24)
!112 = !DILocation(line: 180, column: 27, scope: !111)
!113 = !DILocation(line: 180, column: 17, scope: !111)
!114 = distinct !DISubprogram(name: "panic_const_mul_overflow", linkageName: "_ZN4core9panicking11panic_const24panic_const_mul_overflow17h862e539c427ebd19E", scope: !105, file: !104, line: 173, type: !107, scopeLine: 173, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !24)
!115 = !DILocation(line: 180, column: 27, scope: !114)
!116 = !DILocation(line: 180, column: 17, scope: !114)
!117 = distinct !DISubprogram(name: "panic_const_shl_overflow", linkageName: "_ZN4core9panicking11panic_const24panic_const_shl_overflow17h8161279f0660c9a1E", scope: !105, file: !104, line: 173, type: !107, scopeLine: 173, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !24)
!118 = !DILocation(line: 180, column: 27, scope: !117)
!119 = !DILocation(line: 180, column: 17, scope: !117)
!120 = distinct !DISubprogram(name: "panic_const_sub_overflow", linkageName: "_ZN4core9panicking11panic_const24panic_const_sub_overflow17h4c56070512c67e96E", scope: !105, file: !104, line: 173, type: !107, scopeLine: 173, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !24)
!121 = !DILocation(line: 180, column: 27, scope: !120)
!122 = !DILocation(line: 180, column: 17, scope: !120)
!123 = distinct !DISubprogram(name: "panic_bounds_check", linkageName: "_ZN4core9panicking18panic_bounds_check17h9528875d218e76bdE", scope: !106, file: !104, line: 271, type: !124, scopeLine: 271, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !24, retainedNodes: !126)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !23, !23, !29}
!126 = !{!127, !128, !129, !138}
!127 = !DILocalVariable(name: "index", arg: 1, scope: !123, file: !104, line: 271, type: !23)
!128 = !DILocalVariable(name: "len", arg: 2, scope: !123, file: !104, line: 271, type: !23)
!129 = !DILocalVariable(name: "args", scope: !130, file: !104, line: 276, type: !133, align: 32)
!130 = !DILexicalBlockFile(scope: !131, file: !104, discriminator: 0)
!131 = distinct !DILexicalBlock(scope: !123, file: !132, line: 62, column: 38)
!132 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/panic.rs", directory: "", checksumkind: CSK_MD5, checksum: "af6d9dd47250bbbd0daf63956ba674ac")
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "(&usize, &usize)", file: !13, size: 64, align: 32, elements: !134, templateParams: !24, identifier: "c7a49237229ff8f5cee7a39428e0a5c9")
!134 = !{!135, !137}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !133, file: !13, baseType: !136, size: 32, align: 32)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !23, size: 32, align: 32, dwarfAddressSpace: 0)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !133, file: !13, baseType: !136, size: 32, align: 32, offset: 32)
!138 = !DILocalVariable(name: "args", scope: !139, file: !104, line: 276, type: !141, align: 32)
!139 = !DILexicalBlockFile(scope: !140, file: !104, discriminator: 0)
!140 = distinct !DILexicalBlock(scope: !131, file: !132, line: 62, column: 38)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 128, align: 32, elements: !214)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !143, file: !13, size: 64, align: 32, flags: DIFlagPublic, elements: !145, templateParams: !24, identifier: "14dca3c1b1040cd8e8db0eaa112c8216")
!143 = !DINamespace(name: "rt", scope: !144)
!144 = !DINamespace(name: "fmt", scope: !9)
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !142, file: !13, baseType: !147, size: 64, align: 32, flags: DIFlagPrivate)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentType", scope: !143, file: !13, size: 64, align: 32, flags: DIFlagPrivate, elements: !148, templateParams: !24, identifier: "fb1492950c21086074bab206592842dc")
!148 = !{!149}
!149 = !DICompositeType(tag: DW_TAG_variant_part, scope: !147, file: !13, size: 64, align: 32, elements: !150, templateParams: !24, identifier: "478e018ae6e38e2110d0d424641ab18", discriminator: !213)
!150 = !{!151, !209}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Placeholder", scope: !149, file: !13, baseType: !152, size: 64, align: 32)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !147, file: !13, size: 64, align: 32, flags: DIFlagPrivate, elements: !153, templateParams: !24, identifier: "59bc7f5c5a99ab4be3c3f06b9190c327")
!153 = !{!154, !162, !204}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !152, file: !13, baseType: !155, size: 32, align: 32, flags: DIFlagPrivate)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !36, file: !13, size: 32, align: 32, flags: DIFlagPublic, elements: !156, templateParams: !160, identifier: "d9f2bcb64deb934daba9b509aea4a83e")
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !155, file: !13, baseType: !158, size: 32, align: 32, flags: DIFlagPrivate)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !159, size: 32, align: 32, dwarfAddressSpace: 0)
!159 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!160 = !{!161}
!161 = !DITemplateTypeParameter(name: "T", type: !159)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !152, file: !13, baseType: !163, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(core::ptr::non_null::NonNull<()>, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !164, size: 32, align: 32, dwarfAddressSpace: 0)
!164 = !DISubroutineType(types: !165)
!165 = !{!166, !155, !183}
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !167, file: !13, size: 8, align: 8, flags: DIFlagPublic, elements: !168, templateParams: !24, identifier: "613ace46ae0c395d39c31f05d3934750")
!167 = !DINamespace(name: "result", scope: !9)
!168 = !{!169}
!169 = !DICompositeType(tag: DW_TAG_variant_part, scope: !166, file: !13, size: 8, align: 8, elements: !170, templateParams: !24, identifier: "2bd67c77928327a5a86e1d970227dbc3", discriminator: !182)
!170 = !{!171, !178}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !169, file: !13, baseType: !172, size: 8, align: 8, extraData: i8 0)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !166, file: !13, size: 8, align: 8, flags: DIFlagPublic, elements: !173, templateParams: !175, identifier: "8e1fa5ea2cd8f77479a16f216aa53a42")
!173 = !{!174}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !172, file: !13, baseType: !159, align: 8, offset: 8, flags: DIFlagPublic)
!175 = !{!161, !176}
!176 = !DITemplateTypeParameter(name: "E", type: !177)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !144, file: !13, align: 8, flags: DIFlagPublic, elements: !24, identifier: "cac4d2a6635a122844ffbe3b52a15933")
!178 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !169, file: !13, baseType: !179, size: 8, align: 8, extraData: i8 1)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !166, file: !13, size: 8, align: 8, flags: DIFlagPublic, elements: !180, templateParams: !175, identifier: "bd8eb8fbb58ca24e2467a7f35c864471")
!180 = !{!181}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !179, file: !13, baseType: !177, align: 8, offset: 8, flags: DIFlagPublic)
!182 = !DIDerivedType(tag: DW_TAG_member, scope: !166, file: !13, baseType: !21, size: 8, align: 8, flags: DIFlagArtificial)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !184, size: 32, align: 32, dwarfAddressSpace: 0)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !144, file: !13, size: 128, align: 32, flags: DIFlagPublic, elements: !185, templateParams: !24, identifier: "9c19c8ef0b5ae3cad350e741e841742c")
!185 = !{!186, !193}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !184, file: !13, baseType: !187, size: 64, align: 32, offset: 64, flags: DIFlagPrivate)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormattingOptions", scope: !144, file: !13, size: 64, align: 32, flags: DIFlagPublic, elements: !188, templateParams: !24, identifier: "8e7d20540a73fe2190308d0618721e3e")
!188 = !{!189, !190, !192}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !187, file: !13, baseType: !45, size: 32, align: 32, flags: DIFlagPrivate)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !187, file: !13, baseType: !191, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!191 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !187, file: !13, baseType: !191, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !184, file: !13, baseType: !194, size: 64, align: 32, flags: DIFlagPrivate)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !13, size: 64, align: 32, elements: !195, templateParams: !24, identifier: "ed1fc41b72305de4afb5dbb44887680d")
!195 = !{!196, !199}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !194, file: !13, baseType: !197, size: 32, align: 32)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32, align: 32, dwarfAddressSpace: 0)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !13, align: 8, elements: !24, identifier: "3bd7022d6bc7a1bba9386a42dfa7db9d")
!199 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !194, file: !13, baseType: !200, size: 32, align: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 6]", baseType: !201, size: 32, align: 32, dwarfAddressSpace: 0)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 192, align: 32, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 6, lowerBound: 0)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_lifetime", scope: !152, file: !13, baseType: !205, align: 8, offset: 64, flags: DIFlagPrivate)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&()>", scope: !49, file: !13, align: 8, flags: DIFlagPublic, elements: !24, templateParams: !206, identifier: "e71ee38df7dbfccdae82d3411c10d5bc")
!206 = !{!207}
!207 = !DITemplateTypeParameter(name: "T", type: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !159, size: 32, align: 32, dwarfAddressSpace: 0)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !149, file: !13, baseType: !210, size: 64, align: 32, extraData: i32 0)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !147, file: !13, size: 64, align: 32, flags: DIFlagPrivate, elements: !211, templateParams: !24, identifier: "bcc61db69ea5777ac138ac099ea396b2")
!211 = !{!212}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !210, file: !13, baseType: !191, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!213 = !DIDerivedType(tag: DW_TAG_member, scope: !147, file: !13, baseType: !45, size: 32, align: 32, flags: DIFlagArtificial)
!214 = !{!215}
!215 = !DISubrange(count: 2, lowerBound: 0)
!216 = !DILocation(line: 271, column: 23, scope: !123)
!217 = !DILocation(line: 271, column: 37, scope: !123)
!218 = !DILocation(line: 273, column: 9, scope: !123)
!219 = distinct !DISubprogram(name: "panic_fmt", linkageName: "_ZN4core9panicking9panic_fmt17ha13749e2d8216788E", scope: !106, file: !104, line: 60, type: !220, scopeLine: 60, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !24, retainedNodes: !277)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !222, !29}
!222 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !144, file: !13, size: 192, align: 32, flags: DIFlagPublic, elements: !223, templateParams: !24, identifier: "d691e62b2ee4847c2af32873f04bd10")
!223 = !{!224, !230, !271}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !222, file: !13, baseType: !225, size: 64, align: 32, flags: DIFlagPrivate)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !13, size: 64, align: 32, elements: !226, templateParams: !24, identifier: "4e66b00a376d6af5b8765440fb2839f")
!226 = !{!227, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !225, file: !13, baseType: !228, size: 32, align: 32)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32, align: 32, dwarfAddressSpace: 0)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !225, file: !13, baseType: !23, size: 32, align: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !222, file: !13, baseType: !231, size: 64, align: 32, offset: 128, flags: DIFlagPrivate)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !232, file: !13, size: 64, align: 32, flags: DIFlagPublic, elements: !233, templateParams: !24, identifier: "a638667a460b22fe10961f9a2f3202aa")
!232 = !DINamespace(name: "option", scope: !9)
!233 = !{!234}
!234 = !DICompositeType(tag: DW_TAG_variant_part, scope: !231, file: !13, size: 64, align: 32, elements: !235, templateParams: !24, identifier: "29af53ccc7f21f4d5671e352d673889a", discriminator: !270)
!235 = !{!236, !266}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !234, file: !13, baseType: !237, size: 64, align: 32, extraData: i32 0)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !231, file: !13, size: 64, align: 32, flags: DIFlagPublic, elements: !24, templateParams: !238, identifier: "11ce4f4d10f67887bbe6bf59a521c479")
!238 = !{!239}
!239 = !DITemplateTypeParameter(name: "T", type: !240)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !13, size: 64, align: 32, elements: !241, templateParams: !24, identifier: "b0485535d7020130e949c24f3fc2aa00")
!241 = !{!242, !265}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !240, file: !13, baseType: !243, size: 32, align: 32)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32, align: 32, dwarfAddressSpace: 0)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !143, file: !13, size: 192, align: 32, flags: DIFlagPublic, elements: !245, templateParams: !24, identifier: "8cb06f9d78dc629c8f52fc3b5544996c")
!245 = !{!246, !247, !248, !264}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !244, file: !13, baseType: !23, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !244, file: !13, baseType: !45, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !244, file: !13, baseType: !249, size: 64, align: 32, flags: DIFlagPublic)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !143, file: !13, size: 64, align: 32, flags: DIFlagPublic, elements: !250, templateParams: !24, identifier: "2d7772037f5c744e87d41105441784d5")
!250 = !{!251}
!251 = !DICompositeType(tag: DW_TAG_variant_part, scope: !249, file: !13, size: 64, align: 32, elements: !252, templateParams: !24, identifier: "af14687975a61e1ae6bbcdaeb79a8a2", discriminator: !263)
!252 = !{!253, !257, !261}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !251, file: !13, baseType: !254, size: 64, align: 32, extraData: i16 0)
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !249, file: !13, size: 64, align: 32, flags: DIFlagPublic, elements: !255, templateParams: !24, identifier: "da16c9b5356522ffb015c0e99237342e")
!255 = !{!256}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !254, file: !13, baseType: !191, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !251, file: !13, baseType: !258, size: 64, align: 32, extraData: i16 1)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !249, file: !13, size: 64, align: 32, flags: DIFlagPublic, elements: !259, templateParams: !24, identifier: "8d84b26eccf0f48fe70ea50c79b83fc9")
!259 = !{!260}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !258, file: !13, baseType: !23, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !251, file: !13, baseType: !262, size: 64, align: 32, extraData: i16 2)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !249, file: !13, size: 64, align: 32, flags: DIFlagPublic, elements: !24, identifier: "e4d910bcc0c2da0048af65cce9b02bdf")
!263 = !DIDerivedType(tag: DW_TAG_member, scope: !249, file: !13, baseType: !191, size: 16, align: 16, flags: DIFlagArtificial)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !244, file: !13, baseType: !249, size: 64, align: 32, offset: 64, flags: DIFlagPublic)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !240, file: !13, baseType: !23, size: 32, align: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !234, file: !13, baseType: !267, size: 64, align: 32)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !231, file: !13, size: 64, align: 32, flags: DIFlagPublic, elements: !268, templateParams: !238, identifier: "b6f59188292a44db7736125146b92cb0")
!268 = !{!269}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !267, file: !13, baseType: !240, size: 64, align: 32, flags: DIFlagPublic)
!270 = !DIDerivedType(tag: DW_TAG_member, scope: !231, file: !13, baseType: !45, size: 32, align: 32, flags: DIFlagArtificial)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !222, file: !13, baseType: !272, size: 64, align: 32, offset: 64, flags: DIFlagPrivate)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !13, size: 64, align: 32, elements: !273, templateParams: !24, identifier: "14634098cacc86d372c43019bc81f26f")
!273 = !{!274, !276}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !272, file: !13, baseType: !275, size: 32, align: 32)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32, align: 32, dwarfAddressSpace: 0)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !272, file: !13, baseType: !23, size: 32, align: 32, offset: 32)
!277 = !{!278, !279}
!278 = !DILocalVariable(name: "fmt", arg: 1, scope: !219, file: !104, line: 60, type: !222)
!279 = !DILocalVariable(name: "pi", scope: !280, file: !104, line: 72, type: !281, align: 32)
!280 = distinct !DILexicalBlock(scope: !219, file: !104, line: 72, column: 5)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "PanicInfo", scope: !282, file: !13, size: 96, align: 32, flags: DIFlagPublic, elements: !283, templateParams: !24, identifier: "74943ad5cfeaa8d7c3439d6f603267a6")
!282 = !DINamespace(name: "panic_info", scope: !32)
!283 = !{!284, !286, !287, !289}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !281, file: !13, baseType: !285, size: 32, align: 32, flags: DIFlagPrivate)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Arguments", baseType: !222, size: 32, align: 32, dwarfAddressSpace: 0)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !281, file: !13, baseType: !29, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "can_unwind", scope: !281, file: !13, baseType: !288, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!288 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "force_no_backtrace", scope: !281, file: !13, baseType: !288, size: 8, align: 8, offset: 72, flags: DIFlagPrivate)
!290 = !DILocation(line: 60, column: 24, scope: !219)
!291 = !DILocation(line: 62, column: 9, scope: !219)
!292 = distinct !DISubprogram(name: "write", linkageName: "_ZN54_$LT$adler2..Adler32$u20$as$u20$core..hash..Hasher$GT$5write17h04533ef7e53664dbE", scope: !294, file: !293, line: 160, type: !296, scopeLine: 160, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1, templateParams: !24, retainedNodes: !303)
!293 = !DIFile(filename: "src/lib.rs", directory: "/Users/namse/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/adler2-2.0.1", checksumkind: CSK_MD5, checksum: "6b9835bbdaeafbb9db19455291f35348")
!294 = !DINamespace(name: "{impl#2}", scope: !295)
!295 = !DINamespace(name: "adler2", scope: null)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !298, !17}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut adler2::Adler32", baseType: !299, size: 32, align: 32, dwarfAddressSpace: 0)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "Adler32", scope: !295, file: !13, size: 32, align: 16, flags: DIFlagPublic, elements: !300, templateParams: !24, identifier: "46837ff781fc7d963a1cfbfde15b62c1")
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !299, file: !13, baseType: !191, size: 16, align: 16, flags: DIFlagPrivate)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !299, file: !13, baseType: !191, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!303 = !{!304, !305}
!304 = !DILocalVariable(name: "self", arg: 1, scope: !292, file: !293, line: 160, type: !298)
!305 = !DILocalVariable(name: "bytes", arg: 2, scope: !292, file: !293, line: 160, type: !17)
!306 = !DILocation(line: 160, column: 14, scope: !292)
!307 = !DILocation(line: 160, column: 25, scope: !292)
!308 = !DILocation(line: 161, column: 14, scope: !292)
!309 = !DILocation(line: 162, column: 6, scope: !292)
!310 = distinct !DISubprogram(name: "default", linkageName: "_ZN58_$LT$adler2..Adler32$u20$as$u20$core..default..Default$GT$7default17h8378b5624ae0cd73E", scope: !311, file: !293, line: 149, type: !312, scopeLine: 149, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !24)
!311 = !DINamespace(name: "{impl#1}", scope: !295)
!312 = !DISubroutineType(types: !313)
!313 = !{!299}
!314 = !DILocation(line: 151, column: 6, scope: !310)
!315 = distinct !DISubprogram(name: "into_iter<core::slice::iter::ChunksExact<u8>>", linkageName: "_ZN63_$LT$I$u20$as$u20$core..iter..traits..collect..IntoIterator$GT$9into_iter17h26341722cda0e390E", scope: !317, file: !316, line: 319, type: !321, scopeLine: 319, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !325, retainedNodes: !323)
!316 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/traits/collect.rs", directory: "", checksumkind: CSK_MD5, checksum: "06509ee86e4371045220ddb87ad17093")
!317 = !DINamespace(name: "{impl#0}", scope: !318)
!318 = !DINamespace(name: "collect", scope: !319)
!319 = !DINamespace(name: "traits", scope: !320)
!320 = !DINamespace(name: "iter", scope: !9)
!321 = !DISubroutineType(types: !322)
!322 = !{!12, !12}
!323 = !{!324}
!324 = !DILocalVariable(name: "self", arg: 1, scope: !315, file: !316, line: 319, type: !12)
!325 = !{!326}
!326 = !DITemplateTypeParameter(name: "I", type: !12)
!327 = !DILocation(line: 319, column: 18, scope: !315)
!328 = !DILocation(line: 320, column: 9, scope: !315)
!329 = !DILocation(line: 321, column: 6, scope: !315)
!330 = distinct !DISubprogram(name: "into_iter<core::slice::iter::Iter<u32>>", linkageName: "_ZN63_$LT$I$u20$as$u20$core..iter..traits..collect..IntoIterator$GT$9into_iter17h59d857837bf72df8E", scope: !317, file: !316, line: 319, type: !331, scopeLine: 319, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !350, retainedNodes: !348)
!331 = !DISubroutineType(types: !332)
!332 = !{!333, !333}
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u32>", scope: !14, file: !13, size: 64, align: 32, flags: DIFlagPublic, elements: !334, templateParams: !340, identifier: "751ecae5ab3d5d95f9e48cd65e023c20")
!334 = !{!335, !342, !343}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !333, file: !13, baseType: !336, size: 32, align: 32, flags: DIFlagPrivate)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u32>", scope: !36, file: !13, size: 32, align: 32, flags: DIFlagPublic, elements: !337, templateParams: !340, identifier: "e1b1ee01f96627017b31f56937b10543")
!337 = !{!338}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !336, file: !13, baseType: !339, size: 32, align: 32, flags: DIFlagPrivate)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u32", baseType: !45, size: 32, align: 32, dwarfAddressSpace: 0)
!340 = !{!341}
!341 = !DITemplateTypeParameter(name: "T", type: !45)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !333, file: !13, baseType: !339, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !333, file: !13, baseType: !344, align: 8, offset: 64, flags: DIFlagPrivate)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u32>", scope: !49, file: !13, align: 8, flags: DIFlagPublic, elements: !24, templateParams: !345, identifier: "916cf6e3a48587f1311c77c9824d9c50")
!345 = !{!346}
!346 = !DITemplateTypeParameter(name: "T", type: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !45, size: 32, align: 32, dwarfAddressSpace: 0)
!348 = !{!349}
!349 = !DILocalVariable(name: "self", arg: 1, scope: !330, file: !316, line: 319, type: !333)
!350 = !{!351}
!351 = !DITemplateTypeParameter(name: "I", type: !333)
!352 = !DILocation(line: 319, column: 18, scope: !330)
!353 = !DILocation(line: 321, column: 6, scope: !330)
!354 = distinct !DISubprogram(name: "into_iter<core::slice::iter::Iter<u8>>", linkageName: "_ZN63_$LT$I$u20$as$u20$core..iter..traits..collect..IntoIterator$GT$9into_iter17h6a657ab26019f314E", scope: !317, file: !316, line: 319, type: !355, scopeLine: 319, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !372, retainedNodes: !370)
!355 = !DISubroutineType(types: !356)
!356 = !{!357, !357}
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u8>", scope: !14, file: !13, size: 64, align: 32, flags: DIFlagPublic, elements: !358, templateParams: !27, identifier: "fddf2df4e8c08ec9e4dd47bfe6f746c6")
!358 = !{!359, !364, !365}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !357, file: !13, baseType: !360, size: 32, align: 32, flags: DIFlagPrivate)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !36, file: !13, size: 32, align: 32, flags: DIFlagPublic, elements: !361, templateParams: !27, identifier: "bfbed5a29c49721772982c8bebfc3819")
!361 = !{!362}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !360, file: !13, baseType: !363, size: 32, align: 32, flags: DIFlagPrivate)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !21, size: 32, align: 32, dwarfAddressSpace: 0)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !357, file: !13, baseType: !363, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !357, file: !13, baseType: !366, align: 8, offset: 64, flags: DIFlagPrivate)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u8>", scope: !49, file: !13, align: 8, flags: DIFlagPublic, elements: !24, templateParams: !367, identifier: "bfaa7d2d884b3deea70e5af93aa50e2b")
!367 = !{!368}
!368 = !DITemplateTypeParameter(name: "T", type: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !21, size: 32, align: 32, dwarfAddressSpace: 0)
!370 = !{!371}
!371 = !DILocalVariable(name: "self", arg: 1, scope: !354, file: !316, line: 319, type: !357)
!372 = !{!373}
!373 = !DITemplateTypeParameter(name: "I", type: !357)
!374 = !DILocation(line: 319, column: 18, scope: !354)
!375 = !DILocation(line: 321, column: 6, scope: !354)
!376 = distinct !DISubprogram(name: "add_assign", linkageName: "_ZN67_$LT$adler2..algo..U32X4$u20$as$u20$core..ops..arith..AddAssign$GT$10add_assign17hbb2371a7864970fcE", scope: !378, file: !377, line: 128, type: !380, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !24, retainedNodes: !389)
!377 = !DIFile(filename: "src/algo.rs", directory: "/Users/namse/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/adler2-2.0.1", checksumkind: CSK_MD5, checksum: "aec2e08bfd8a78e9713f8e90c01963e8")
!378 = !DINamespace(name: "{impl#2}", scope: !379)
!379 = !DINamespace(name: "algo", scope: !295)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !382, !383}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut adler2::algo::U32X4", baseType: !383, size: 32, align: 32, dwarfAddressSpace: 0)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "U32X4", scope: !379, file: !13, size: 128, align: 32, flags: DIFlagPrivate, elements: !384, templateParams: !24, identifier: "1a82ed7c6b375308efdd45be081b5faa")
!384 = !{!385}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !383, file: !13, baseType: !386, size: 128, align: 32, flags: DIFlagPrivate)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 128, align: 32, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 4, lowerBound: 0)
!389 = !{!390, !391}
!390 = !DILocalVariable(name: "self", arg: 1, scope: !376, file: !377, line: 128, type: !382)
!391 = !DILocalVariable(name: "other", arg: 2, scope: !376, file: !377, line: 128, type: !383)
!392 = !DILocation(line: 128, column: 19, scope: !376)
!393 = !DILocation(line: 128, column: 30, scope: !376)
!394 = !DILocation(line: 130, column: 22, scope: !376)
!395 = !DILocation(line: 130, column: 9, scope: !376)
!396 = !DILocation(line: 131, column: 22, scope: !376)
!397 = !DILocation(line: 131, column: 9, scope: !376)
!398 = !DILocation(line: 132, column: 22, scope: !376)
!399 = !DILocation(line: 132, column: 9, scope: !376)
!400 = !DILocation(line: 133, column: 22, scope: !376)
!401 = !DILocation(line: 133, column: 9, scope: !376)
!402 = !DILocation(line: 134, column: 6, scope: !376)
!403 = distinct !DISubprogram(name: "adler32_slice", linkageName: "_ZN6adler213adler32_slice17h5909d12a0dd7b1f2E", scope: !295, file: !293, line: 170, type: !404, scopeLine: 170, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1, templateParams: !24, retainedNodes: !406)
!404 = !DISubroutineType(types: !405)
!405 = !{!45, !17}
!406 = !{!407, !408}
!407 = !DILocalVariable(name: "data", arg: 1, scope: !403, file: !293, line: 170, type: !17)
!408 = !DILocalVariable(name: "h", scope: !409, file: !293, line: 171, type: !299, align: 16)
!409 = distinct !DILexicalBlock(scope: !403, file: !293, line: 171, column: 5)
!410 = !DILocation(line: 170, column: 22, scope: !403)
!411 = !DILocation(line: 171, column: 9, scope: !409)
!412 = !DILocation(line: 171, column: 17, scope: !403)
!413 = !DILocation(line: 172, column: 7, scope: !409)
!414 = !DILocation(line: 173, column: 7, scope: !409)
!415 = !DILocation(line: 174, column: 2, scope: !403)
