; ModuleID = 'alloc.ffb8e4d6f182d685-cgu.0'
source_filename = "alloc.ffb8e4d6f182d685-cgu.0"
target datalayout = "e-m:e-p:32:32-p10:8:8-p20:8:8-i64:64-i128:128-n32:64-S128-ni:1:10:20"
target triple = "wasm32-unknown-wasi"

%"core::fmt::rt::Argument<'_>" = type { %"core::fmt::rt::ArgumentType<'_>" }
%"core::fmt::rt::ArgumentType<'_>" = type { ptr, [1 x i32] }

@alloc_531b0048d6ed72a56ae658b8fe4d292a = private unnamed_addr constant [21 x i8] c"memory allocation of ", align 1
@alloc_e7770b048557af7ef3910860746912e2 = private unnamed_addr constant [13 x i8] c" bytes failed", align 1
@alloc_b0372332874b832f149657ebe0da4c28 = private unnamed_addr constant <{ ptr, [4 x i8], ptr, [4 x i8] }> <{ ptr @alloc_531b0048d6ed72a56ae658b8fe4d292a, [4 x i8] c"\15\00\00\00", ptr @alloc_e7770b048557af7ef3910860746912e2, [4 x i8] c"\0D\00\00\00" }>, align 4
@alloc_dc195465c2ba08ac4896fcd3aeb3f123 = private unnamed_addr constant [109 x i8] c"/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/alloc/src/alloc.rs\00", align 1
@alloc_0f85af4e4b50d49339da0095a5b54748 = private unnamed_addr constant <{ ptr, [12 x i8] }> <{ ptr @alloc_dc195465c2ba08ac4896fcd3aeb3f123, [12 x i8] c"l\00\00\00\B7\01\00\00\0D\00\00\00" }>, align 4
@alloc_7f0301cd9d20b34f44b6ad3fa9e5dd94 = private unnamed_addr constant <{ ptr, [12 x i8] }> <{ ptr @alloc_dc195465c2ba08ac4896fcd3aeb3f123, [12 x i8] c"l\00\00\00\B5\01\00\00\0D\00\00\00" }>, align 4

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&core::option::Option<u8> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::option::Option<u8> as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !21, identifier: "9f0df09829d729154b3434e1eeabff66")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 32, align: 32)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 32, align: 32, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!9 = !DIBasicType(name: "usize", size: 32, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<u8>", baseType: !13, size: 32, align: 32, dwarfAddressSpace: 0)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u8>", scope: !14, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !16, templateParams: !21, identifier: "774a7bc235a763e0d0602fde53630227")
!14 = !DINamespace(name: "option", scope: !15)
!15 = !DINamespace(name: "core", scope: null)
!16 = !{!17}
!17 = !DICompositeType(tag: DW_TAG_variant_part, scope: !13, file: !2, size: 16, align: 8, elements: !18, templateParams: !21, identifier: "d47ebcdec53ff1e1fc7d394cf5e1672d", discriminator: !29)
!18 = !{!19, !25}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !17, file: !2, baseType: !20, size: 16, align: 8, extraData: i8 0)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !13, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !21, templateParams: !22, identifier: "84a45d26f79ed4caa31bc5af2c53fbf4")
!21 = !{}
!22 = !{!23}
!23 = !DITemplateTypeParameter(name: "T", type: !24)
!24 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !17, file: !2, baseType: !26, size: 16, align: 8, extraData: i8 1)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !13, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !27, templateParams: !22, identifier: "9d7bb1b003ae84b64da48c86aa454b4")
!27 = !{!28}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !26, file: !2, baseType: !24, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, scope: !13, file: !2, baseType: !24, size: 8, align: 8, flags: DIFlagArtificial)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "<&core::alloc::layout::Layout as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !32, isLocal: true, isDefinition: true)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::alloc::layout::Layout as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !33, vtableHolder: !38, templateParams: !21, identifier: "c9d5aa850a0849e1f28871f15dc8d2f0")
!33 = !{!34, !35, !36, !37}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !32, file: !2, baseType: !6, size: 32, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !32, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !32, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !32, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::alloc::layout::Layout", baseType: !39, size: 32, align: 32, dwarfAddressSpace: 0)
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "Layout", scope: !40, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !42, templateParams: !21, identifier: "f923cc1896f078e51d4a893c36e2e533")
!40 = !DINamespace(name: "layout", scope: !41)
!41 = !DINamespace(name: "alloc", scope: !15)
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !39, file: !2, baseType: !9, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !39, file: !2, baseType: !45, size: 32, align: 32, flags: DIFlagPrivate)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Alignment", scope: !46, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !48, templateParams: !21, identifier: "b8055a5301a867de82116acd8d685318")
!46 = !DINamespace(name: "alignment", scope: !47)
!47 = !DINamespace(name: "ptr", scope: !15)
!48 = !{!49}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !45, file: !2, baseType: !50, size: 32, align: 32, flags: DIFlagPrivate)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !46, file: !2, baseType: !51, size: 32, align: 32, flags: DIFlagEnumClass, elements: !52)
!51 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84}
!53 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!55 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!56 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!57 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!58 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!59 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!60 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!61 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!62 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!63 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!64 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!65 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!66 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!67 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!68 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!69 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!70 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!71 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!72 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!73 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!74 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!75 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!76 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!77 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!78 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!79 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!80 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!81 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!82 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!83 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!84 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "<&usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !87, isLocal: true, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !88, vtableHolder: !93, templateParams: !21, identifier: "780b51af4c263e5a25cc8e22f3f934fe")
!88 = !{!89, !90, !91, !92}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !87, file: !2, baseType: !6, size: 32, align: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !87, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !87, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !87, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 32, align: 32, dwarfAddressSpace: 0)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "<&core::option::Option<usize> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !96, isLocal: true, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::option::Option<usize> as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !97, vtableHolder: !102, templateParams: !21, identifier: "ee2f5a55dac8625b18fb01ac4e683133")
!97 = !{!98, !99, !100, !101}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !96, file: !2, baseType: !6, size: 32, align: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !96, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !96, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !96, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<usize>", baseType: !103, size: 32, align: 32, dwarfAddressSpace: 0)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !14, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !104, templateParams: !21, identifier: "23b42ad4918f48bbb0d7df30a3e65f21")
!104 = !{!105}
!105 = !DICompositeType(tag: DW_TAG_variant_part, scope: !103, file: !2, size: 64, align: 32, elements: !106, templateParams: !21, identifier: "fff0cc91bd07d4e2a6f41aa96659bb8", discriminator: !115)
!106 = !{!107, !111}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !105, file: !2, baseType: !108, size: 64, align: 32, extraData: i32 0)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !103, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !21, templateParams: !109, identifier: "16f3611ef7370fd7f09fc668dc1c16f8")
!109 = !{!110}
!110 = !DITemplateTypeParameter(name: "T", type: !9)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !105, file: !2, baseType: !112, size: 64, align: 32, extraData: i32 1)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !103, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !113, templateParams: !109, identifier: "9bb7e929a7e81f45f834925bbfee816")
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !112, file: !2, baseType: !9, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!115 = !DIDerivedType(tag: DW_TAG_member, scope: !103, file: !2, baseType: !51, size: 32, align: 32, flags: DIFlagArtificial)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "<&str as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !118, isLocal: true, isDefinition: true)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&str as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !119, vtableHolder: !124, templateParams: !21, identifier: "4c72bea2c43ff6a7f7303943d2ccbafe")
!119 = !{!120, !121, !122, !123}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !118, file: !2, baseType: !6, size: 32, align: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !118, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !118, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !118, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 64, align: 32, elements: !125, templateParams: !21, identifier: "9277eecd40495f85161460476aacc992")
!125 = !{!126, !128}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !124, file: !2, baseType: !127, size: 32, align: 32)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 32, align: 32, dwarfAddressSpace: 0)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !124, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "STATIC_INNER_SLICE", linkageName: "_ZN5alloc4sync18STATIC_INNER_SLICE17h1413d7a909030fefE", scope: !131, file: !133, line: 3579, type: !134, isLocal: false, isDefinition: true, align: 128)
!131 = !DINamespace(name: "sync", scope: !132)
!132 = !DINamespace(name: "alloc", scope: null)
!133 = !DIFile(filename: "src/sync.rs", directory: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/alloc", checksumkind: CSK_MD5, checksum: "754ebdb7cfcdf26f53f7fd06952f3c03")
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "SliceArcInnerForStatic", scope: !131, file: !2, size: 128, align: 128, flags: DIFlagPrivate, elements: !135, templateParams: !21, identifier: "5a6e992f2e833e8ac7169ce8b008c0e2")
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !134, file: !2, baseType: !137, size: 96, align: 32, flags: DIFlagPrivate)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<[u8; 1]>", scope: !131, file: !2, size: 96, align: 32, flags: DIFlagPrivate, elements: !138, templateParams: !154, identifier: "981fa6caff1f80ef4f069993b5157a4b")
!138 = !{!139, !149, !150}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !137, file: !2, baseType: !140, size: 32, align: 32, flags: DIFlagPrivate)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !141, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !143, templateParams: !21, identifier: "210fde280431e7a7a2ebb6338b4a928")
!141 = !DINamespace(name: "atomic", scope: !142)
!142 = !DINamespace(name: "sync", scope: !15)
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !140, file: !2, baseType: !145, size: 32, align: 32, flags: DIFlagPrivate)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !146, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !147, templateParams: !109, identifier: "a03bd62ffdb893cb75c512d3055b1e6a")
!146 = !DINamespace(name: "cell", scope: !15)
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !145, file: !2, baseType: !9, size: 32, align: 32, flags: DIFlagPrivate)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !137, file: !2, baseType: !140, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !137, file: !2, baseType: !151, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8, align: 8, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 1, lowerBound: 0)
!154 = !{!155}
!155 = !DITemplateTypeParameter(name: "T", type: !151)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "<alloc::boxed::convert::{impl#19}::from::StringError as core::error::Error>::{vtable}", scope: null, file: !2, type: !158, isLocal: true, isDefinition: true)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::boxed::convert::{impl#19}::from::StringError as core::error::Error>::{vtable_type}", file: !2, size: 352, align: 32, flags: DIFlagArtificial, elements: !159, vtableHolder: !171, templateParams: !21, identifier: "e82fc57872fb252f86caf66774e9ef75")
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !158, file: !2, baseType: !6, size: 32, align: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !158, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !158, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !158, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !158, file: !2, baseType: !6, size: 32, align: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "__super_trait_ptr5", scope: !158, file: !2, baseType: !6, size: 32, align: 32, offset: 160)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "__method6", scope: !158, file: !2, baseType: !6, size: 32, align: 32, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__method7", scope: !158, file: !2, baseType: !6, size: 32, align: 32, offset: 224)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__method8", scope: !158, file: !2, baseType: !6, size: 32, align: 32, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__method9", scope: !158, file: !2, baseType: !6, size: 32, align: 32, offset: 288)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__method10", scope: !158, file: !2, baseType: !6, size: 32, align: 32, offset: 320)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "StringError", scope: !172, file: !2, size: 96, align: 32, flags: DIFlagProtected, elements: !176, templateParams: !21, identifier: "81e34cbfdf76d4004a86fdb96e59dd73")
!172 = !DINamespace(name: "from", scope: !173)
!173 = !DINamespace(name: "{impl#19}", scope: !174)
!174 = !DINamespace(name: "convert", scope: !175)
!175 = !DINamespace(name: "boxed", scope: !132)
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !171, file: !2, baseType: !178, size: 96, align: 32, flags: DIFlagProtected)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !179, file: !2, size: 96, align: 32, flags: DIFlagPublic, elements: !180, templateParams: !21, identifier: "d25855d4e39c2f43d5832c8c00c297b8")
!179 = !DINamespace(name: "string", scope: !132)
!180 = !{!181}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !178, file: !2, baseType: !182, size: 96, align: 32, flags: DIFlagPrivate)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !183, file: !2, size: 96, align: 32, flags: DIFlagPublic, elements: !184, templateParams: !217, identifier: "690acf9b7a33488c5bae8462c5730502")
!183 = !DINamespace(name: "vec", scope: !132)
!184 = !{!185, !218}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !182, file: !2, baseType: !186, size: 64, align: 32, flags: DIFlagPrivate)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !187, file: !2, size: 64, align: 32, flags: DIFlagProtected, elements: !188, templateParams: !217, identifier: "5236adca4c8bab765515aeb39bd1ce36")
!187 = !DINamespace(name: "raw_vec", scope: !132)
!188 = !{!189, !216}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !186, file: !2, baseType: !190, size: 64, align: 32, flags: DIFlagPrivate)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVecInner<alloc::alloc::Global>", scope: !187, file: !2, size: 64, align: 32, flags: DIFlagPrivate, elements: !191, templateParams: !214, identifier: "3c40c2e41e15f04db5cfeefb4800bcc4")
!191 = !{!192, !205, !211}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !190, file: !2, baseType: !193, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !194, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !195, templateParams: !22, identifier: "15d8b1b660840b97c8698c417bf66080")
!194 = !DINamespace(name: "unique", scope: !47)
!195 = !{!196, !202}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !193, file: !2, baseType: !197, size: 32, align: 32, flags: DIFlagPrivate)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !198, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !199, templateParams: !22, identifier: "bfbed5a29c49721772982c8bebfc3819")
!198 = !DINamespace(name: "non_null", scope: !47)
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !197, file: !2, baseType: !201, size: 32, align: 32, flags: DIFlagPrivate)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !24, size: 32, align: 32, dwarfAddressSpace: 0)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !193, file: !2, baseType: !203, align: 8, offset: 32, flags: DIFlagPrivate)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !204, file: !2, align: 8, flags: DIFlagPublic, elements: !21, templateParams: !22, identifier: "86f180f8272fce39fed40a1ecf2dfbe2")
!204 = !DINamespace(name: "marker", scope: !15)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !190, file: !2, baseType: !206, size: 32, align: 32, flags: DIFlagPrivate)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "UsizeNoHighBit", scope: !207, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !209, templateParams: !21, identifier: "f66b9037a7c573de372fce98f436079c")
!207 = !DINamespace(name: "niche_types", scope: !208)
!208 = !DINamespace(name: "num", scope: !15)
!209 = !{!210}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !206, file: !2, baseType: !9, size: 32, align: 32, flags: DIFlagPrivate)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !190, file: !2, baseType: !212, align: 8, offset: 64, flags: DIFlagPrivate)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !213, file: !2, align: 8, flags: DIFlagPublic, elements: !21, identifier: "8d3dc7eb6b91fe30566bfc073f6fd293")
!213 = !DINamespace(name: "alloc", scope: !132)
!214 = !{!215}
!215 = !DITemplateTypeParameter(name: "A", type: !212)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !186, file: !2, baseType: !203, align: 8, offset: 64, flags: DIFlagPrivate)
!217 = !{!23, !215}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !182, file: !2, baseType: !9, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "<usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !221, isLocal: true, isDefinition: true)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "<usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !222, vtableHolder: !9, templateParams: !21, identifier: "d039273444f7fc995c377e8d4c029a3")
!222 = !{!223, !224, !225, !226}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !221, file: !2, baseType: !6, size: 32, align: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !221, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !221, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !221, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "<&core::ptr::alignment::Alignment as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !229, isLocal: true, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::ptr::alignment::Alignment as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !230, vtableHolder: !235, templateParams: !21, identifier: "6b1d62126d18356bb460fcdcc638a95e")
!230 = !{!231, !232, !233, !234}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !229, file: !2, baseType: !6, size: 32, align: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !229, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !229, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !229, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::ptr::alignment::Alignment", baseType: !45, size: 32, align: 32, dwarfAddressSpace: 0)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "<&u8 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !238, isLocal: true, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u8 as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !239, vtableHolder: !244, templateParams: !21, identifier: "8ebe3e780ae6181d77c3deff7c4cc1e2")
!239 = !{!240, !241, !242, !243}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !238, file: !2, baseType: !6, size: 32, align: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !238, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !238, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !238, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !24, size: 32, align: 32, dwarfAddressSpace: 0)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "<core::str::error::Utf8Error as core::error::Error>::{vtable}", scope: null, file: !2, type: !247, isLocal: true, isDefinition: true)
!247 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::str::error::Utf8Error as core::error::Error>::{vtable_type}", file: !2, size: 352, align: 32, flags: DIFlagArtificial, elements: !248, vtableHolder: !260, templateParams: !21, identifier: "487e6a02c2a3ba68d07c46318debb3b6")
!248 = !{!249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !247, file: !2, baseType: !6, size: 32, align: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !247, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !247, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !247, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !247, file: !2, baseType: !6, size: 32, align: 32, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "__super_trait_ptr5", scope: !247, file: !2, baseType: !6, size: 32, align: 32, offset: 160)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "__method6", scope: !247, file: !2, baseType: !6, size: 32, align: 32, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "__method7", scope: !247, file: !2, baseType: !6, size: 32, align: 32, offset: 224)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "__method8", scope: !247, file: !2, baseType: !6, size: 32, align: 32, offset: 256)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "__method9", scope: !247, file: !2, baseType: !6, size: 32, align: 32, offset: 288)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "__method10", scope: !247, file: !2, baseType: !6, size: 32, align: 32, offset: 320)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "Utf8Error", scope: !261, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !263, templateParams: !21, identifier: "4b4a5f597602ec9f4778ad8670e72da9")
!261 = !DINamespace(name: "error", scope: !262)
!262 = !DINamespace(name: "str", scope: !15)
!263 = !{!264, !265}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "valid_up_to", scope: !260, file: !2, baseType: !9, size: 32, align: 32, flags: DIFlagProtected)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "error_len", scope: !260, file: !2, baseType: !13, size: 16, align: 8, offset: 32, flags: DIFlagProtected)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "<alloc::string::String as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !268, isLocal: true, isDefinition: true)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::string::String as core::fmt::Write>::{vtable_type}", file: !2, size: 192, align: 32, flags: DIFlagArtificial, elements: !269, vtableHolder: !178, templateParams: !21, identifier: "84bfa180edf17aad9748f510d90e2149")
!269 = !{!270, !271, !272, !273, !274, !275}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !268, file: !2, baseType: !6, size: 32, align: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !268, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !268, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !268, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !268, file: !2, baseType: !6, size: 32, align: 32, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !268, file: !2, baseType: !6, size: 32, align: 32, offset: 160)
!276 = !{!"rustc version 1.92.0-nightly (6380899f3 2025-10-18)"}
!277 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !278, producer: "clang LLVM (rustc version 1.92.0-nightly (6380899f3 2025-10-18))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !279, globals: !290, splitDebugInlining: false, nameTableKind: None)
!278 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/alloc/src/lib.rs/@/alloc.ffb8e4d6f182d685-cgu.0", directory: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/alloc")
!279 = !{!50, !280, !286}
!280 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !281, file: !2, baseType: !24, size: 8, align: 8, flags: DIFlagEnumClass, elements: !282)
!281 = !DINamespace(name: "panicking", scope: !15)
!282 = !{!283, !284, !285}
!283 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!284 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!285 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!286 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AllocInit", scope: !187, file: !2, baseType: !24, size: 8, align: 8, flags: DIFlagEnumClass, elements: !287)
!287 = !{!288, !289}
!288 = !DIEnumerator(name: "Uninitialized", value: 0, isUnsigned: true)
!289 = !DIEnumerator(name: "Zeroed", value: 1, isUnsigned: true)
!290 = !{!0, !30, !85, !94, !116, !129, !156, !219, !227, !236, !245, !266}
!291 = !{i32 7, !"Dwarf Version", i32 4}
!292 = !{i32 2, !"Debug Info Version", i32 3}
!293 = distinct !DISubprogram(name: "__rdl_alloc_error_handler", linkageName: "_RNvCsaKOfhLrNfTz_7___rustc25___rdl_alloc_error_handler", scope: !295, file: !294, line: 428, type: !296, scopeLine: 428, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !277, templateParams: !21, retainedNodes: !298)
!294 = !DIFile(filename: "src/alloc.rs", directory: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/alloc", checksumkind: CSK_MD5, checksum: "be3434980e1d4fd44eed88225c1bb8c1")
!295 = !DINamespace(name: "__alloc_error_handler", scope: !213)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !9, !9}
!298 = !{!299, !300, !301, !308, !382, !384}
!299 = !DILocalVariable(name: "size", arg: 1, scope: !293, file: !294, line: 428, type: !9)
!300 = !DILocalVariable(name: "_align", arg: 2, scope: !293, file: !294, line: 428, type: !9)
!301 = !DILocalVariable(name: "args", scope: !302, file: !294, line: 437, type: !305, align: 32)
!302 = !DILexicalBlockFile(scope: !303, file: !294, discriminator: 0)
!303 = distinct !DILexicalBlock(scope: !293, file: !304, line: 62, column: 38)
!304 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/panic.rs", directory: "", checksumkind: CSK_MD5, checksum: "af6d9dd47250bbbd0daf63956ba674ac")
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "(&usize)", file: !2, size: 32, align: 32, elements: !306, templateParams: !21, identifier: "7e0e9b9ca28e88103fb99d7cecf418bb")
!306 = !{!307}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !305, file: !2, baseType: !93, size: 32, align: 32)
!308 = !DILocalVariable(name: "args", scope: !309, file: !294, line: 437, type: !311, align: 32)
!309 = !DILexicalBlockFile(scope: !310, file: !294, discriminator: 0)
!310 = distinct !DILexicalBlock(scope: !303, file: !304, line: 62, column: 38)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 64, align: 32, elements: !152)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !313, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !315, templateParams: !21, identifier: "14dca3c1b1040cd8e8db0eaa112c8216")
!313 = !DINamespace(name: "rt", scope: !314)
!314 = !DINamespace(name: "fmt", scope: !15)
!315 = !{!316}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !312, file: !2, baseType: !317, size: 64, align: 32, flags: DIFlagPrivate)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentType", scope: !313, file: !2, size: 64, align: 32, flags: DIFlagPrivate, elements: !318, templateParams: !21, identifier: "fb1492950c21086074bab206592842dc")
!318 = !{!319}
!319 = !DICompositeType(tag: DW_TAG_variant_part, scope: !317, file: !2, size: 64, align: 32, elements: !320, templateParams: !21, identifier: "478e018ae6e38e2110d0d424641ab18", discriminator: !381)
!320 = !{!321, !377}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "Placeholder", scope: !319, file: !2, baseType: !322, size: 64, align: 32)
!322 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !317, file: !2, size: 64, align: 32, flags: DIFlagPrivate, elements: !323, templateParams: !21, identifier: "59bc7f5c5a99ab4be3c3f06b9190c327")
!323 = !{!324, !330, !372}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !322, file: !2, baseType: !325, size: 32, align: 32, flags: DIFlagPrivate)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !198, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !326, templateParams: !328, identifier: "d9f2bcb64deb934daba9b509aea4a83e")
!326 = !{!327}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !325, file: !2, baseType: !6, size: 32, align: 32, flags: DIFlagPrivate)
!328 = !{!329}
!329 = !DITemplateTypeParameter(name: "T", type: !7)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !322, file: !2, baseType: !331, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(core::ptr::non_null::NonNull<()>, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !332, size: 32, align: 32, dwarfAddressSpace: 0)
!332 = !DISubroutineType(types: !333)
!333 = !{!334, !325, !351}
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !335, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !336, templateParams: !21, identifier: "613ace46ae0c395d39c31f05d3934750")
!335 = !DINamespace(name: "result", scope: !15)
!336 = !{!337}
!337 = !DICompositeType(tag: DW_TAG_variant_part, scope: !334, file: !2, size: 8, align: 8, elements: !338, templateParams: !21, identifier: "2bd67c77928327a5a86e1d970227dbc3", discriminator: !350)
!338 = !{!339, !346}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !337, file: !2, baseType: !340, size: 8, align: 8, extraData: i8 0)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !334, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !341, templateParams: !343, identifier: "8e1fa5ea2cd8f77479a16f216aa53a42")
!341 = !{!342}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !340, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!343 = !{!329, !344}
!344 = !DITemplateTypeParameter(name: "E", type: !345)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !314, file: !2, align: 8, flags: DIFlagPublic, elements: !21, identifier: "cac4d2a6635a122844ffbe3b52a15933")
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !337, file: !2, baseType: !347, size: 8, align: 8, extraData: i8 1)
!347 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !334, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !348, templateParams: !343, identifier: "bd8eb8fbb58ca24e2467a7f35c864471")
!348 = !{!349}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !347, file: !2, baseType: !345, align: 8, offset: 8, flags: DIFlagPublic)
!350 = !DIDerivedType(tag: DW_TAG_member, scope: !334, file: !2, baseType: !24, size: 8, align: 8, flags: DIFlagArtificial)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !352, size: 32, align: 32, dwarfAddressSpace: 0)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !314, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !353, templateParams: !21, identifier: "9c19c8ef0b5ae3cad350e741e841742c")
!353 = !{!354, !361}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !352, file: !2, baseType: !355, size: 64, align: 32, offset: 64, flags: DIFlagPrivate)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormattingOptions", scope: !314, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !356, templateParams: !21, identifier: "8e7d20540a73fe2190308d0618721e3e")
!356 = !{!357, !358, !360}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !355, file: !2, baseType: !51, size: 32, align: 32, flags: DIFlagPrivate)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !355, file: !2, baseType: !359, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!359 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !355, file: !2, baseType: !359, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !352, file: !2, baseType: !362, size: 64, align: 32, flags: DIFlagPrivate)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 64, align: 32, elements: !363, templateParams: !21, identifier: "ed1fc41b72305de4afb5dbb44887680d")
!363 = !{!364, !367}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !362, file: !2, baseType: !365, size: 32, align: 32)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32, align: 32, dwarfAddressSpace: 0)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !21, identifier: "3bd7022d6bc7a1bba9386a42dfa7db9d")
!367 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !362, file: !2, baseType: !368, size: 32, align: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 6]", baseType: !369, size: 32, align: 32, dwarfAddressSpace: 0)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 32, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 6, lowerBound: 0)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_lifetime", scope: !322, file: !2, baseType: !373, align: 8, offset: 64, flags: DIFlagPrivate)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&()>", scope: !204, file: !2, align: 8, flags: DIFlagPublic, elements: !21, templateParams: !374, identifier: "e71ee38df7dbfccdae82d3411c10d5bc")
!374 = !{!375}
!375 = !DITemplateTypeParameter(name: "T", type: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !7, size: 32, align: 32, dwarfAddressSpace: 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !319, file: !2, baseType: !378, size: 64, align: 32, extraData: i32 0)
!378 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !317, file: !2, size: 64, align: 32, flags: DIFlagPrivate, elements: !379, templateParams: !21, identifier: "bcc61db69ea5777ac138ac099ea396b2")
!379 = !{!380}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !378, file: !2, baseType: !359, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!381 = !DIDerivedType(tag: DW_TAG_member, scope: !317, file: !2, baseType: !51, size: 32, align: 32, flags: DIFlagArtificial)
!382 = !DILocalVariable(name: "args", scope: !383, file: !294, line: 440, type: !305, align: 32)
!383 = distinct !DILexicalBlock(scope: !293, file: !294, line: 440, column: 17)
!384 = !DILocalVariable(name: "args", scope: !385, file: !294, line: 440, type: !311, align: 32)
!385 = distinct !DILexicalBlock(scope: !383, file: !294, line: 440, column: 17)
!386 = !DILocation(line: 428, column: 45, scope: !293)
!387 = !DILocation(line: 428, column: 58, scope: !293)
!388 = !DILocation(line: 437, column: 13, scope: !309)
!389 = !DILocation(line: 440, column: 17, scope: !385)
!390 = !DILocation(line: 436, column: 21, scope: !293)
!391 = !DILocation(line: 436, column: 12, scope: !293)
!392 = !DILocation(line: 440, column: 17, scope: !293)
!393 = !DILocation(line: 440, column: 17, scope: !383)
!394 = !DILocation(line: 439, column: 13, scope: !293)
!395 = !DILocation(line: 437, column: 13, scope: !293)
!396 = !DILocation(line: 437, column: 13, scope: !302)
!397 = distinct !DISubprogram(name: "from", linkageName: "_ZN100_$LT$alloc..ffi..c_str..CString$u20$as$u20$core..convert..From$LT$$RF$core..ffi..c_str..CStr$GT$$GT$4from17h4f0160485ae35353E", scope: !399, file: !398, line: 1087, type: !402, scopeLine: 1087, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !277, templateParams: !21, retainedNodes: !422)
!398 = !DIFile(filename: "src/ffi/c_str.rs", directory: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/alloc", checksumkind: CSK_MD5, checksum: "a17ec52eeeed3b3092b7006f08d3decc")
!399 = !DINamespace(name: "{impl#35}", scope: !400)
!400 = !DINamespace(name: "c_str", scope: !401)
!401 = !DINamespace(name: "ffi", scope: !132)
!402 = !DISubroutineType(types: !403)
!403 = !{!404, !411}
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "CString", scope: !400, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !405, templateParams: !21, identifier: "9b7450f8744affb31c228f474471e82b")
!405 = !{!406}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !404, file: !2, baseType: !407, size: 64, align: 32, flags: DIFlagPrivate)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<[u8], alloc::alloc::Global>", file: !2, size: 64, align: 32, elements: !408, templateParams: !21, identifier: "d9d0e853f42d86aa8110bb5e43b30a7c")
!408 = !{!409, !410}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !407, file: !2, baseType: !127, size: 32, align: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !407, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "&core::ffi::c_str::CStr", file: !2, size: 64, align: 32, elements: !412, templateParams: !21, identifier: "c03be6a46633f31421c60ac3a4bc5fd9")
!412 = !{!413, !421}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !411, file: !2, baseType: !414, size: 32, align: 32)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 32, align: 32, dwarfAddressSpace: 0)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "CStr", scope: !416, file: !2, align: 8, flags: DIFlagPublic, elements: !418, templateParams: !21, identifier: "c9957a8b471e83df39cbd61c617294c1")
!416 = !DINamespace(name: "c_str", scope: !417)
!417 = !DINamespace(name: "ffi", scope: !15)
!418 = !{!419}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !415, file: !2, baseType: !420, align: 8, flags: DIFlagPrivate)
!420 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !411, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!422 = !{!423}
!423 = !DILocalVariable(name: "s", arg: 1, scope: !397, file: !398, line: 1087, type: !411)
!424 = !DILocation(line: 1087, column: 13, scope: !397)
!425 = !DILocation(line: 1088, column: 11, scope: !397)
!426 = !DILocation(line: 1089, column: 6, scope: !397)
!427 = distinct !DISubprogram(name: "from_slice<u8>", linkageName: "_ZN101_$LT$alloc..boxed..Box$LT$$u5b$T$u5d$$GT$$u20$as$u20$alloc..boxed..convert..BoxFromSlice$LT$T$GT$$GT$10from_slice17h9febee8fa02ab093E", scope: !429, file: !428, line: 80, type: !430, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !277, templateParams: !22, retainedNodes: !436)
!428 = !DIFile(filename: "src/boxed/convert.rs", directory: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/alloc", checksumkind: CSK_MD5, checksum: "2d92e67bacce44677a11ed76ea675a76")
!429 = !DINamespace(name: "{impl#3}", scope: !174)
!430 = !DISubroutineType(types: !431)
!431 = !{!407, !432}
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !2, size: 64, align: 32, elements: !433, templateParams: !21, identifier: "31681e0c10b314f1f33e38b2779acbb4")
!433 = !{!434, !435}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !432, file: !2, baseType: !127, size: 32, align: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !432, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!436 = !{!437, !438, !440}
!437 = !DILocalVariable(name: "slice", arg: 1, scope: !427, file: !428, line: 80, type: !432)
!438 = !DILocalVariable(name: "len", scope: !439, file: !428, line: 81, type: !9, align: 32)
!439 = distinct !DILexicalBlock(scope: !427, file: !428, line: 81, column: 9)
!440 = !DILocalVariable(name: "buf", scope: !441, file: !428, line: 82, type: !186, align: 32)
!441 = distinct !DILexicalBlock(scope: !439, file: !428, line: 82, column: 9)
!442 = !DILocation(line: 80, column: 19, scope: !427)
!443 = !DILocation(line: 82, column: 13, scope: !441)
!444 = !DILocation(line: 81, column: 19, scope: !427)
!445 = !DILocation(line: 81, column: 13, scope: !439)
!446 = !DILocation(line: 82, column: 19, scope: !439)
!447 = !DILocalVariable(name: "self", arg: 1, scope: !448, file: !449, line: 724, type: !432)
!448 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$6as_ptr17he0c6527477e2ea09E", scope: !450, file: !449, line: 724, type: !452, scopeLine: 724, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !277, templateParams: !22, retainedNodes: !454)
!449 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/slice/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "63aedd801a9e6eae1eca1edc5c2217aa")
!450 = !DINamespace(name: "{impl#0}", scope: !451)
!451 = !DINamespace(name: "slice", scope: !15)
!452 = !DISubroutineType(types: !453)
!453 = !{!201, !432}
!454 = !{!447}
!455 = !DILocation(line: 724, column: 25, scope: !448, inlinedAt: !456)
!456 = distinct !DILocation(line: 84, column: 44, scope: !441)
!457 = !DILocation(line: 84, column: 58, scope: !441)
!458 = !DILocalVariable(name: "src", arg: 1, scope: !459, file: !460, line: 526, type: !201)
!459 = distinct !DISubprogram(name: "copy_nonoverlapping<u8>", linkageName: "_ZN4core3ptr19copy_nonoverlapping17hb7a890eb633e1d85E", scope: !47, file: !460, line: 526, type: !461, scopeLine: 526, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !277, templateParams: !22, retainedNodes: !464)
!460 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "8857c34524728cc5887872677b8e1917")
!461 = !DISubroutineType(types: !462)
!462 = !{null, !201, !463, !9}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !24, size: 32, align: 32, dwarfAddressSpace: 0)
!464 = !{!458, !465, !466}
!465 = !DILocalVariable(name: "dst", arg: 2, scope: !459, file: !460, line: 526, type: !463)
!466 = !DILocalVariable(name: "count", arg: 3, scope: !459, file: !460, line: 526, type: !9)
!467 = !DILocation(line: 526, column: 44, scope: !459, inlinedAt: !468)
!468 = distinct !DILocation(line: 84, column: 13, scope: !441)
!469 = !DILocation(line: 526, column: 59, scope: !459, inlinedAt: !468)
!470 = !DILocation(line: 526, column: 72, scope: !459, inlinedAt: !468)
!471 = !DILocation(line: 77, column: 35, scope: !472, inlinedAt: !468)
!472 = !DILexicalBlockFile(scope: !459, file: !473, discriminator: 0)
!473 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ub_checks.rs", directory: "", checksumkind: CSK_MD5, checksum: "41b3943b2b7dc8c218ee37ead81b317d")
!474 = !DILocation(line: 78, column: 17, scope: !472, inlinedAt: !468)
!475 = !DILocation(line: 547, column: 14, scope: !459, inlinedAt: !468)
!476 = !DILocation(line: 85, column: 13, scope: !441)
!477 = !DILocation(line: 85, column: 17, scope: !441)
!478 = !DILocation(line: 85, column: 39, scope: !441)
!479 = !DILocation(line: 87, column: 6, scope: !427)
!480 = distinct !DISubprogram(name: "fold<char, core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16be_lossy::{closure_env#0}, (), core::iter::traits::iterator::Iterator::for_each::call::{closure_env#0}<char, alloc::string::{impl#13}::extend::{closure_env#0}<core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16be_lossy::{closure_env#0}>>>>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold17h4241de272d72337eE", scope: !482, file: !481, line: 124, type: !486, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !277, templateParams: !572, retainedNodes: !568)
!481 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/adapters/map.rs", directory: "", checksumkind: CSK_MD5, checksum: "47fd4c3c8424e034238ec6bb5a169812")
!482 = !DINamespace(name: "{impl#2}", scope: !483)
!483 = !DINamespace(name: "map", scope: !484)
!484 = !DINamespace(name: "adapters", scope: !485)
!485 = !DINamespace(name: "iter", scope: !15)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !488, !7, !554}
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16be_lossy::{closure_env#0}>", scope: !483, file: !2, size: 96, align: 32, flags: DIFlagPublic, elements: !489, templateParams: !551, identifier: "4c78bf6fc8f32f20ce250eed9b8673b5")
!489 = !{!490, !547}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !488, file: !2, baseType: !491, size: 96, align: 32, flags: DIFlagProtected)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>>", scope: !492, file: !2, size: 96, align: 32, flags: DIFlagPublic, elements: !494, templateParams: !545, identifier: "7a05912347d35df6c4c61fe85787afe8")
!492 = !DINamespace(name: "decode", scope: !493)
!493 = !DINamespace(name: "char", scope: !15)
!494 = !{!495, !531}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !491, file: !2, baseType: !496, size: 64, align: 32, offset: 32, flags: DIFlagPrivate)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>", scope: !483, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !497, templateParams: !528, identifier: "6f274c949efeb3b14a6b6a0a723d15d9")
!497 = !{!498, !524}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !496, file: !2, baseType: !499, size: 64, align: 32, flags: DIFlagProtected)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "Copied<core::slice::iter::Iter<[u8; 2]>>", scope: !500, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !501, templateParams: !522, identifier: "d6381a0b815cf19f262f9a3559e28b6d")
!500 = !DINamespace(name: "copied", scope: !484)
!501 = !{!502}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !499, file: !2, baseType: !503, size: 64, align: 32, flags: DIFlagPrivate)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<[u8; 2]>", scope: !504, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !505, templateParams: !514, identifier: "b84ebd21ad2ae4b7c5c1503f1c180788")
!504 = !DINamespace(name: "iter", scope: !451)
!505 = !{!506, !516, !517}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !503, file: !2, baseType: !507, size: 32, align: 32, flags: DIFlagPrivate)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<[u8; 2]>", scope: !198, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !508, templateParams: !514, identifier: "58bff39aa01b89b1523857f77942a32c")
!508 = !{!509}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !507, file: !2, baseType: !510, size: 32, align: 32, flags: DIFlagPrivate)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const [u8; 2]", baseType: !511, size: 32, align: 32, dwarfAddressSpace: 0)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 16, align: 8, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 2, lowerBound: 0)
!514 = !{!515}
!515 = !DITemplateTypeParameter(name: "T", type: !511)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !503, file: !2, baseType: !510, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !503, file: !2, baseType: !518, align: 8, offset: 64, flags: DIFlagPrivate)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&[u8; 2]>", scope: !204, file: !2, align: 8, flags: DIFlagPublic, elements: !21, templateParams: !519, identifier: "20f35517008df7529bdacb4feedce94c")
!519 = !{!520}
!520 = !DITemplateTypeParameter(name: "T", type: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[u8; 2]", baseType: !511, size: 32, align: 32, dwarfAddressSpace: 0)
!522 = !{!523}
!523 = !DITemplateTypeParameter(name: "I", type: !503)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !496, file: !2, baseType: !525, align: 8, offset: 64, flags: DIFlagPrivate)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn([u8; 2]) -> u16", baseType: !526, align: 8, dwarfAddressSpace: 0)
!526 = !DISubroutineType(types: !527)
!527 = !{!359, !511}
!528 = !{!529, !530}
!529 = !DITemplateTypeParameter(name: "I", type: !499)
!530 = !DITemplateTypeParameter(name: "F", type: !525)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !491, file: !2, baseType: !532, size: 32, align: 16, flags: DIFlagPrivate)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u16>", scope: !14, file: !2, size: 32, align: 16, flags: DIFlagPublic, elements: !533, templateParams: !21, identifier: "788ac321be6b41eb164b1c33155d479d")
!533 = !{!534}
!534 = !DICompositeType(tag: DW_TAG_variant_part, scope: !532, file: !2, size: 32, align: 16, elements: !535, templateParams: !21, identifier: "c650dee40607e51a88eacd75507e7f25", discriminator: !544)
!535 = !{!536, !540}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !534, file: !2, baseType: !537, size: 32, align: 16, extraData: i16 0)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !532, file: !2, size: 32, align: 16, flags: DIFlagPublic, elements: !21, templateParams: !538, identifier: "f6e93980d093edf2aa141e5fb86db594")
!538 = !{!539}
!539 = !DITemplateTypeParameter(name: "T", type: !359)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !534, file: !2, baseType: !541, size: 32, align: 16, extraData: i16 1)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !532, file: !2, size: 32, align: 16, flags: DIFlagPublic, elements: !542, templateParams: !538, identifier: "f4b1ea597c301b34cb7b9e00a4bf776")
!542 = !{!543}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !541, file: !2, baseType: !359, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!544 = !DIDerivedType(tag: DW_TAG_member, scope: !532, file: !2, baseType: !359, size: 16, align: 16, flags: DIFlagArtificial)
!545 = !{!546}
!546 = !DITemplateTypeParameter(name: "I", type: !496)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !488, file: !2, baseType: !548, align: 8, offset: 96, flags: DIFlagPrivate)
!548 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !549, file: !2, align: 8, elements: !21, identifier: "139bb1d0c8924dbd456c240187148337")
!549 = !DINamespace(name: "from_utf16be_lossy", scope: !550)
!550 = !DINamespace(name: "{impl#0}", scope: !179)
!551 = !{!552, !553}
!552 = !DITemplateTypeParameter(name: "I", type: !491)
!553 = !DITemplateTypeParameter(name: "F", type: !548)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<char, alloc::string::{impl#13}::extend::{closure_env#0}<core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16be_lossy::{closure_env#0}>>>", scope: !555, file: !2, size: 32, align: 32, elements: !560, templateParams: !21, identifier: "32474b69b09444ada841c3c92cca0174")
!555 = !DINamespace(name: "call", scope: !556)
!556 = !DINamespace(name: "for_each", scope: !557)
!557 = !DINamespace(name: "Iterator", scope: !558)
!558 = !DINamespace(name: "iterator", scope: !559)
!559 = !DINamespace(name: "traits", scope: !485)
!560 = !{!561}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !554, file: !2, baseType: !562, size: 32, align: 32)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16be_lossy::{closure_env#0}>>", scope: !563, file: !2, size: 32, align: 32, elements: !565, templateParams: !21, identifier: "82364d90b9a84a6fc26f1c402a5b9f1d")
!563 = !DINamespace(name: "extend", scope: !564)
!564 = !DINamespace(name: "{impl#13}", scope: !179)
!565 = !{!566}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !562, file: !2, baseType: !567, size: 32, align: 32)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut alloc::string::String", baseType: !178, size: 32, align: 32, dwarfAddressSpace: 0)
!568 = !{!569, !570, !571}
!569 = !DILocalVariable(name: "self", arg: 1, scope: !480, file: !481, line: 124, type: !488)
!570 = !DILocalVariable(name: "init", arg: 2, scope: !480, file: !481, line: 124, type: !7)
!571 = !DILocalVariable(name: "g", arg: 3, scope: !480, file: !481, line: 124, type: !554)
!572 = !{!573, !552, !553, !575, !576}
!573 = !DITemplateTypeParameter(name: "B", type: !574)
!574 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!575 = !DITemplateTypeParameter(name: "Acc", type: !7)
!576 = !DITemplateTypeParameter(name: "G", type: !554)
!577 = !DILocation(line: 124, column: 21, scope: !480)
!578 = !DILocation(line: 124, column: 27, scope: !480)
!579 = !DILocation(line: 124, column: 38, scope: !480)
!580 = !DILocation(line: 128, column: 9, scope: !480)
!581 = !DILocation(line: 128, column: 30, scope: !480)
!582 = !DILocation(line: 128, column: 19, scope: !480)
!583 = !DILocation(line: 129, column: 6, scope: !480)
!584 = distinct !DISubprogram(name: "fold<usize, core::slice::iter::Iter<&str>, core::fmt::{impl#4}::estimated_capacity::{closure_env#0}, usize, core::iter::traits::accum::{impl#48}::sum::{closure_env#0}<core::iter::adapters::map::Map<core::slice::iter::Iter<&str>, core::fmt::{impl#4}::estimated_capacity::{closure_env#0}>>>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold17h45d345b8de3281a9E", scope: !482, file: !481, line: 124, type: !585, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !277, templateParams: !620, retainedNodes: !616)
!585 = !DISubroutineType(types: !586)
!586 = !{!9, !587, !9, !612}
!587 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::slice::iter::Iter<&str>, core::fmt::{impl#4}::estimated_capacity::{closure_env#0}>", scope: !483, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !588, templateParams: !609, identifier: "18d06d169b8baef048303647f1cd855c")
!588 = !{!589, !605}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !587, file: !2, baseType: !590, size: 64, align: 32, flags: DIFlagProtected)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<&str>", scope: !504, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !591, templateParams: !597, identifier: "5968ceac63dffa00195164e3d06dd4ca")
!591 = !{!592, !599, !600}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !590, file: !2, baseType: !593, size: 32, align: 32, flags: DIFlagPrivate)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<&str>", scope: !198, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !594, templateParams: !597, identifier: "6967004d016cd3f2103a65d4acc4cc28")
!594 = !{!595}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !593, file: !2, baseType: !596, size: 32, align: 32, flags: DIFlagPrivate)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const &str", baseType: !124, size: 32, align: 32, dwarfAddressSpace: 0)
!597 = !{!598}
!598 = !DITemplateTypeParameter(name: "T", type: !124)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !590, file: !2, baseType: !596, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !590, file: !2, baseType: !601, align: 8, offset: 64, flags: DIFlagPrivate)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&&str>", scope: !204, file: !2, align: 8, flags: DIFlagPublic, elements: !21, templateParams: !602, identifier: "c30ab11e4de521a5b950ec3d9d9216ed")
!602 = !{!603}
!603 = !DITemplateTypeParameter(name: "T", type: !604)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !124, size: 32, align: 32, dwarfAddressSpace: 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !587, file: !2, baseType: !606, align: 8, offset: 64, flags: DIFlagPrivate)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !607, file: !2, align: 8, elements: !21, identifier: "8be5c7d5f52339ca9565b2b80002ae45")
!607 = !DINamespace(name: "estimated_capacity", scope: !608)
!608 = !DINamespace(name: "{impl#4}", scope: !314)
!609 = !{!610, !611}
!610 = !DITemplateTypeParameter(name: "I", type: !590)
!611 = !DITemplateTypeParameter(name: "F", type: !606)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<core::iter::adapters::map::Map<core::slice::iter::Iter<&str>, core::fmt::{impl#4}::estimated_capacity::{closure_env#0}>>", scope: !613, file: !2, align: 8, elements: !21, identifier: "c802dc16cadbcb1bde577b07c8ac913")
!613 = !DINamespace(name: "sum", scope: !614)
!614 = !DINamespace(name: "{impl#48}", scope: !615)
!615 = !DINamespace(name: "accum", scope: !559)
!616 = !{!617, !618, !619}
!617 = !DILocalVariable(name: "self", arg: 1, scope: !584, file: !481, line: 124, type: !587)
!618 = !DILocalVariable(name: "init", arg: 2, scope: !584, file: !481, line: 124, type: !9)
!619 = !DILocalVariable(name: "g", arg: 3, scope: !584, file: !481, line: 124, type: !612)
!620 = !{!621, !610, !611, !622, !623}
!621 = !DITemplateTypeParameter(name: "B", type: !9)
!622 = !DITemplateTypeParameter(name: "Acc", type: !9)
!623 = !DITemplateTypeParameter(name: "G", type: !612)
!624 = !DILocation(line: 124, column: 21, scope: !584)
!625 = !DILocation(line: 124, column: 27, scope: !584)
!626 = !DILocation(line: 124, column: 38, scope: !584)
!627 = !DILocation(line: 128, column: 30, scope: !584)
!628 = !DILocation(line: 128, column: 19, scope: !584)
!629 = !DILocation(line: 129, column: 6, scope: !584)
!630 = distinct !DISubprogram(name: "fold<u8, core::slice::iter::Iter<bool>, alloc::str::convert_while_ascii::{closure_env#0}, u8, core::iter::traits::accum::{impl#28}::sum::{closure_env#0}<core::iter::adapters::map::Map<core::slice::iter::Iter<bool>, alloc::str::convert_while_ascii::{closure_env#0}>>>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold17h7f4571960d69e0faE", scope: !482, file: !481, line: 124, type: !631, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !277, templateParams: !666, retainedNodes: !662)
!631 = !DISubroutineType(types: !632)
!632 = !{!24, !633, !24, !659}
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::slice::iter::Iter<bool>, alloc::str::convert_while_ascii::{closure_env#0}>", scope: !483, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !634, templateParams: !656, identifier: "581650ec2a9efbf71a33bdad4fe63815")
!634 = !{!635, !652}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !633, file: !2, baseType: !636, size: 64, align: 32, flags: DIFlagProtected)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<bool>", scope: !504, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !637, templateParams: !644, identifier: "67f2556cddc427b4bb9357a668bf19b")
!637 = !{!638, !646, !647}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !636, file: !2, baseType: !639, size: 32, align: 32, flags: DIFlagPrivate)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<bool>", scope: !198, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !640, templateParams: !644, identifier: "1bab9aba231e27c281c57f6f4dbfb4a9")
!640 = !{!641}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !639, file: !2, baseType: !642, size: 32, align: 32, flags: DIFlagPrivate)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const bool", baseType: !643, size: 32, align: 32, dwarfAddressSpace: 0)
!643 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!644 = !{!645}
!645 = !DITemplateTypeParameter(name: "T", type: !643)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !636, file: !2, baseType: !642, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !636, file: !2, baseType: !648, align: 8, offset: 64, flags: DIFlagPrivate)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&bool>", scope: !204, file: !2, align: 8, flags: DIFlagPublic, elements: !21, templateParams: !649, identifier: "1a1a3e844cfaf1bdf5b3b4947dc8f1e6")
!649 = !{!650}
!650 = !DITemplateTypeParameter(name: "T", type: !651)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !643, size: 32, align: 32, dwarfAddressSpace: 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !633, file: !2, baseType: !653, align: 8, offset: 64, flags: DIFlagPrivate)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !654, file: !2, align: 8, elements: !21, identifier: "70ff25bbdb0e60ccef51ce99143352e4")
!654 = !DINamespace(name: "convert_while_ascii", scope: !655)
!655 = !DINamespace(name: "str", scope: !132)
!656 = !{!657, !658}
!657 = !DITemplateTypeParameter(name: "I", type: !636)
!658 = !DITemplateTypeParameter(name: "F", type: !653)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<core::iter::adapters::map::Map<core::slice::iter::Iter<bool>, alloc::str::convert_while_ascii::{closure_env#0}>>", scope: !660, file: !2, align: 8, elements: !21, identifier: "a283d546dea1db07bc032eae2e960508")
!660 = !DINamespace(name: "sum", scope: !661)
!661 = !DINamespace(name: "{impl#28}", scope: !615)
!662 = !{!663, !664, !665}
!663 = !DILocalVariable(name: "self", arg: 1, scope: !630, file: !481, line: 124, type: !633)
!664 = !DILocalVariable(name: "init", arg: 2, scope: !630, file: !481, line: 124, type: !24)
!665 = !DILocalVariable(name: "g", arg: 3, scope: !630, file: !481, line: 124, type: !659)
!666 = !{!667, !657, !658, !668, !669}
!667 = !DITemplateTypeParameter(name: "B", type: !24)
!668 = !DITemplateTypeParameter(name: "Acc", type: !24)
!669 = !DITemplateTypeParameter(name: "G", type: !659)
!670 = !DILocation(line: 124, column: 21, scope: !630)
!671 = !DILocation(line: 124, column: 27, scope: !630)
!672 = !DILocation(line: 124, column: 38, scope: !630)
!673 = !DILocation(line: 128, column: 30, scope: !630)
!674 = !DILocation(line: 128, column: 19, scope: !630)
!675 = !DILocation(line: 129, column: 6, scope: !630)
!676 = distinct !DISubprogram(name: "fold<char, core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16le_lossy::{closure_env#0}, (), core::iter::traits::iterator::Iterator::for_each::call::{closure_env#0}<char, alloc::string::{impl#13}::extend::{closure_env#0}<core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16le_lossy::{closure_env#0}>>>>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold17h9b95bb9acbc2b2d8E", scope: !482, file: !481, line: 124, type: !677, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !277, templateParams: !708, retainedNodes: !704)
!677 = !DISubroutineType(types: !678)
!678 = !{null, !679, !7, !698}
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16le_lossy::{closure_env#0}>", scope: !483, file: !2, size: 96, align: 32, flags: DIFlagPublic, elements: !680, templateParams: !695, identifier: "d34388f742a2e2c5395dd0eb1b75f5a8")
!680 = !{!681, !692}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !679, file: !2, baseType: !682, size: 96, align: 32, flags: DIFlagProtected)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>>", scope: !492, file: !2, size: 96, align: 32, flags: DIFlagPublic, elements: !683, templateParams: !690, identifier: "33f8b74ee8e1845c49dea92279aad228")
!683 = !{!684, !689}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !682, file: !2, baseType: !685, size: 64, align: 32, offset: 32, flags: DIFlagPrivate)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>", scope: !483, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !686, templateParams: !528, identifier: "e45b04c798a8e1e854e6218f0ef6f5af")
!686 = !{!687, !688}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !685, file: !2, baseType: !499, size: 64, align: 32, flags: DIFlagProtected)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !685, file: !2, baseType: !525, align: 8, offset: 64, flags: DIFlagPrivate)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !682, file: !2, baseType: !532, size: 32, align: 16, flags: DIFlagPrivate)
!690 = !{!691}
!691 = !DITemplateTypeParameter(name: "I", type: !685)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !679, file: !2, baseType: !693, align: 8, offset: 96, flags: DIFlagPrivate)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !694, file: !2, align: 8, elements: !21, identifier: "d9a377dfc477106fd00c1a8d959806d3")
!694 = !DINamespace(name: "from_utf16le_lossy", scope: !550)
!695 = !{!696, !697}
!696 = !DITemplateTypeParameter(name: "I", type: !682)
!697 = !DITemplateTypeParameter(name: "F", type: !693)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<char, alloc::string::{impl#13}::extend::{closure_env#0}<core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16le_lossy::{closure_env#0}>>>", scope: !555, file: !2, size: 32, align: 32, elements: !699, templateParams: !21, identifier: "2f469ae18836041d6661f74d1a6ee063")
!699 = !{!700}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !698, file: !2, baseType: !701, size: 32, align: 32)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16le_lossy::{closure_env#0}>>", scope: !563, file: !2, size: 32, align: 32, elements: !702, templateParams: !21, identifier: "ed50481129f3100ebca0ff30b4833b36")
!702 = !{!703}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !701, file: !2, baseType: !567, size: 32, align: 32)
!704 = !{!705, !706, !707}
!705 = !DILocalVariable(name: "self", arg: 1, scope: !676, file: !481, line: 124, type: !679)
!706 = !DILocalVariable(name: "init", arg: 2, scope: !676, file: !481, line: 124, type: !7)
!707 = !DILocalVariable(name: "g", arg: 3, scope: !676, file: !481, line: 124, type: !698)
!708 = !{!573, !696, !697, !575, !709}
!709 = !DITemplateTypeParameter(name: "G", type: !698)
!710 = !DILocation(line: 124, column: 21, scope: !676)
!711 = !DILocation(line: 124, column: 27, scope: !676)
!712 = !DILocation(line: 124, column: 38, scope: !676)
!713 = !DILocation(line: 128, column: 9, scope: !676)
!714 = !DILocation(line: 128, column: 30, scope: !676)
!715 = !DILocation(line: 128, column: 19, scope: !676)
!716 = !DILocation(line: 129, column: 6, scope: !676)
!717 = distinct !DISubprogram(name: "fold<char, core::char::decode::DecodeUtf16<core::iter::adapters::cloned::Cloned<core::slice::iter::Iter<u16>>>, alloc::string::{impl#0}::from_utf16_lossy::{closure_env#0}, (), core::iter::traits::iterator::Iterator::for_each::call::{closure_env#0}<char, alloc::string::{impl#13}::extend::{closure_env#0}<core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::cloned::Cloned<core::slice::iter::Iter<u16>>>, alloc::string::{impl#0}::from_utf16_lossy::{closure_env#0}>>>>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold17h9cd58454b5701ea2E", scope: !482, file: !481, line: 124, type: !718, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !277, templateParams: !764, retainedNodes: !760)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !720, !7, !754}
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::char::decode::DecodeUtf16<core::iter::adapters::cloned::Cloned<core::slice::iter::Iter<u16>>>, alloc::string::{impl#0}::from_utf16_lossy::{closure_env#0}>", scope: !483, file: !2, size: 96, align: 32, flags: DIFlagPublic, elements: !721, templateParams: !751, identifier: "d6d97b0bed94a69b881d96f16352ea05")
!721 = !{!722, !748}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !720, file: !2, baseType: !723, size: 96, align: 32, flags: DIFlagProtected)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeUtf16<core::iter::adapters::cloned::Cloned<core::slice::iter::Iter<u16>>>", scope: !492, file: !2, size: 96, align: 32, flags: DIFlagPublic, elements: !724, templateParams: !746, identifier: "9ae4124a39f2598ec6c59118e91934c8")
!724 = !{!725, !745}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !723, file: !2, baseType: !726, size: 64, align: 32, offset: 32, flags: DIFlagPrivate)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cloned<core::slice::iter::Iter<u16>>", scope: !727, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !728, templateParams: !743, identifier: "82132c9987f36f336b3e264b7e4812d0")
!727 = !DINamespace(name: "cloned", scope: !484)
!728 = !{!729}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !726, file: !2, baseType: !730, size: 64, align: 32, flags: DIFlagPrivate)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u16>", scope: !504, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !731, templateParams: !538, identifier: "2a3d3c946425c23b918e712ef529b62d")
!731 = !{!732, !737, !738}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !730, file: !2, baseType: !733, size: 32, align: 32, flags: DIFlagPrivate)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u16>", scope: !198, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !734, templateParams: !538, identifier: "74706ff21a163d5b1876036a150af747")
!734 = !{!735}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !733, file: !2, baseType: !736, size: 32, align: 32, flags: DIFlagPrivate)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u16", baseType: !359, size: 32, align: 32, dwarfAddressSpace: 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !730, file: !2, baseType: !736, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !730, file: !2, baseType: !739, align: 8, offset: 64, flags: DIFlagPrivate)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u16>", scope: !204, file: !2, align: 8, flags: DIFlagPublic, elements: !21, templateParams: !740, identifier: "b9cff2cfc2d8a22e1813a29b8ae29804")
!740 = !{!741}
!741 = !DITemplateTypeParameter(name: "T", type: !742)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u16", baseType: !359, size: 32, align: 32, dwarfAddressSpace: 0)
!743 = !{!744}
!744 = !DITemplateTypeParameter(name: "I", type: !730)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !723, file: !2, baseType: !532, size: 32, align: 16, flags: DIFlagPrivate)
!746 = !{!747}
!747 = !DITemplateTypeParameter(name: "I", type: !726)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !720, file: !2, baseType: !749, align: 8, offset: 96, flags: DIFlagPrivate)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !750, file: !2, align: 8, elements: !21, identifier: "13670d7db0ebe6c75dd5a1aa65919403")
!750 = !DINamespace(name: "from_utf16_lossy", scope: !550)
!751 = !{!752, !753}
!752 = !DITemplateTypeParameter(name: "I", type: !723)
!753 = !DITemplateTypeParameter(name: "F", type: !749)
!754 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<char, alloc::string::{impl#13}::extend::{closure_env#0}<core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::cloned::Cloned<core::slice::iter::Iter<u16>>>, alloc::string::{impl#0}::from_utf16_lossy::{closure_env#0}>>>", scope: !555, file: !2, size: 32, align: 32, elements: !755, templateParams: !21, identifier: "463a3df32ffd5154de1cc8d916f37231")
!755 = !{!756}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !754, file: !2, baseType: !757, size: 32, align: 32)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::cloned::Cloned<core::slice::iter::Iter<u16>>>, alloc::string::{impl#0}::from_utf16_lossy::{closure_env#0}>>", scope: !563, file: !2, size: 32, align: 32, elements: !758, templateParams: !21, identifier: "dbad5dcb44e040349cd497dd08e48b0a")
!758 = !{!759}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !757, file: !2, baseType: !567, size: 32, align: 32)
!760 = !{!761, !762, !763}
!761 = !DILocalVariable(name: "self", arg: 1, scope: !717, file: !481, line: 124, type: !720)
!762 = !DILocalVariable(name: "init", arg: 2, scope: !717, file: !481, line: 124, type: !7)
!763 = !DILocalVariable(name: "g", arg: 3, scope: !717, file: !481, line: 124, type: !754)
!764 = !{!573, !752, !753, !575, !765}
!765 = !DITemplateTypeParameter(name: "G", type: !754)
!766 = !DILocation(line: 124, column: 21, scope: !717)
!767 = !DILocation(line: 124, column: 27, scope: !717)
!768 = !DILocation(line: 124, column: 38, scope: !717)
!769 = !DILocation(line: 128, column: 9, scope: !717)
!770 = !DILocation(line: 128, column: 30, scope: !717)
!771 = !DILocation(line: 128, column: 19, scope: !717)
!772 = !DILocation(line: 129, column: 6, scope: !717)
!773 = distinct !DISubprogram(name: "next<u16, core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h4efad3714318d8aeE", scope: !482, file: !481, line: 106, type: !774, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !277, templateParams: !779, retainedNodes: !777)
!774 = !DISubroutineType(types: !775)
!775 = !{!532, !776}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>", baseType: !496, size: 32, align: 32, dwarfAddressSpace: 0)
!777 = !{!778}
!778 = !DILocalVariable(name: "self", arg: 1, scope: !773, file: !481, line: 106, type: !776)
!779 = !{!780, !529, !530}
!780 = !DITemplateTypeParameter(name: "B", type: !359)
!781 = !DILocation(line: 106, column: 13, scope: !773)
!782 = !DILocation(line: 107, column: 19, scope: !773)
!783 = !DILocation(line: 107, column: 30, scope: !773)
!784 = !DILocation(line: 107, column: 9, scope: !773)
!785 = !DILocation(line: 107, column: 26, scope: !773)
!786 = !DILocation(line: 108, column: 6, scope: !773)
!787 = distinct !DISubprogram(name: "next<u16, core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17hf2081ae1bb7222a7E", scope: !482, file: !481, line: 106, type: !788, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !277, templateParams: !779, retainedNodes: !791)
!788 = !DISubroutineType(types: !789)
!789 = !{!532, !790}
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>", baseType: !685, size: 32, align: 32, dwarfAddressSpace: 0)
!791 = !{!792}
!792 = !DILocalVariable(name: "self", arg: 1, scope: !787, file: !481, line: 106, type: !790)
!793 = !DILocation(line: 106, column: 13, scope: !787)
!794 = !DILocation(line: 107, column: 19, scope: !787)
!795 = !DILocation(line: 107, column: 30, scope: !787)
!796 = !DILocation(line: 107, column: 9, scope: !787)
!797 = !DILocation(line: 107, column: 26, scope: !787)
!798 = !DILocation(line: 108, column: 6, scope: !787)
!799 = distinct !DISubprogram(name: "size_hint<u16, core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17h382fcde1af476226E", scope: !482, file: !481, line: 111, type: !800, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !277, templateParams: !779, retainedNodes: !807)
!800 = !DISubroutineType(types: !801)
!801 = !{!802, !806}
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, core::option::Option<usize>)", file: !2, size: 96, align: 32, elements: !803, templateParams: !21, identifier: "7ece7fed19dbe5ef878c4a231d971688")
!803 = !{!804, !805}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !802, file: !2, baseType: !9, size: 32, align: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !802, file: !2, baseType: !103, size: 64, align: 32, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>", baseType: !685, size: 32, align: 32, dwarfAddressSpace: 0)
!807 = !{!808}
!808 = !DILocalVariable(name: "self", arg: 1, scope: !799, file: !481, line: 111, type: !806)
!809 = !DILocation(line: 111, column: 18, scope: !799)
!810 = !DILocation(line: 112, column: 19, scope: !799)
!811 = !DILocation(line: 113, column: 6, scope: !799)
!812 = distinct !DISubprogram(name: "size_hint<char, core::char::decode::DecodeUtf16<core::iter::adapters::cloned::Cloned<core::slice::iter::Iter<u16>>>, alloc::string::{impl#0}::from_utf16_lossy::{closure_env#0}>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17h49cdf9f6e3eb2dc6E", scope: !482, file: !481, line: 111, type: !813, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !277, templateParams: !818, retainedNodes: !816)
!813 = !DISubroutineType(types: !814)
!814 = !{!802, !815}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::cloned::Cloned<core::slice::iter::Iter<u16>>>, alloc::string::{impl#0}::from_utf16_lossy::{closure_env#0}>", baseType: !720, size: 32, align: 32, dwarfAddressSpace: 0)
!816 = !{!817}
!817 = !DILocalVariable(name: "self", arg: 1, scope: !812, file: !481, line: 111, type: !815)
!818 = !{!573, !752, !753}
!819 = !DILocation(line: 111, column: 18, scope: !812)
!820 = !DILocation(line: 112, column: 19, scope: !812)
!821 = !DILocation(line: 113, column: 6, scope: !812)
!822 = distinct !DISubprogram(name: "size_hint<char, core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16be_lossy::{closure_env#0}>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17h53a6dc5bd5e417f1E", scope: !482, file: !481, line: 111, type: !823, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !277, templateParams: !828, retainedNodes: !826)
!823 = !DISubroutineType(types: !824)
!824 = !{!802, !825}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16be_lossy::{closure_env#0}>", baseType: !488, size: 32, align: 32, dwarfAddressSpace: 0)
!826 = !{!827}
!827 = !DILocalVariable(name: "self", arg: 1, scope: !822, file: !481, line: 111, type: !825)
!828 = !{!573, !552, !553}
!829 = !DILocation(line: 111, column: 18, scope: !822)
!830 = !DILocation(line: 112, column: 19, scope: !822)
!831 = !DILocation(line: 113, column: 6, scope: !822)
!832 = distinct !DISubprogram(name: "size_hint<u16, core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17h74c964c242110fdaE", scope: !482, file: !481, line: 111, type: !833, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !277, templateParams: !779, retainedNodes: !836)
!833 = !DISubroutineType(types: !834)
!834 = !{!802, !835}
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>", baseType: !496, size: 32, align: 32, dwarfAddressSpace: 0)
!836 = !{!837}
!837 = !DILocalVariable(name: "self", arg: 1, scope: !832, file: !481, line: 111, type: !835)
!838 = !DILocation(line: 111, column: 18, scope: !832)
!839 = !DILocation(line: 112, column: 19, scope: !832)
!840 = !DILocation(line: 113, column: 6, scope: !832)
!841 = distinct !DISubprogram(name: "size_hint<char, core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16le_lossy::{closure_env#0}>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17h89b22289d0fc54dcE", scope: !482, file: !481, line: 111, type: !842, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !277, templateParams: !847, retainedNodes: !845)
!842 = !DISubroutineType(types: !843)
!843 = !{!802, !844}
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::Iter<[u8; 2]>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16le_lossy::{closure_env#0}>", baseType: !679, size: 32, align: 32, dwarfAddressSpace: 0)
!845 = !{!846}
!846 = !DILocalVariable(name: "self", arg: 1, scope: !841, file: !481, line: 111, type: !844)
!847 = !{!573, !696, !697}
!848 = !DILocation(line: 111, column: 18, scope: !841)
!849 = !DILocation(line: 112, column: 19, scope: !841)
!850 = !DILocation(line: 113, column: 6, scope: !841)
!851 = distinct !DISubprogram(name: "size_hint<u8, alloc::alloc::Global>", linkageName: "_ZN103_$LT$alloc..vec..into_iter..IntoIter$LT$T$C$A$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17hcbf8eb201d7f87d2E", scope: !853, file: !852, line: 229, type: !855, scopeLine: 229, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !277, templateParams: !217, retainedNodes: !873)
!852 = !DIFile(filename: "src/vec/into_iter.rs", directory: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/alloc", checksumkind: CSK_MD5, checksum: "a62aa168faaad8031032ab1ad0222556")
!853 = !DINamespace(name: "{impl#5}", scope: !854)
!854 = !DINamespace(name: "into_iter", scope: !183)
!855 = !DISubroutineType(types: !856)
!856 = !{!802, !857}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::vec::into_iter::IntoIter<u8, alloc::alloc::Global>", baseType: !858, size: 32, align: 32, dwarfAddressSpace: 0)
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "IntoIter<u8, alloc::alloc::Global>", scope: !854, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !859, templateParams: !217, identifier: "bac115eda391f5807576a87922e4b211")
!859 = !{!860, !861, !862, !863, !871, !872}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !858, file: !2, baseType: !197, size: 32, align: 32, flags: DIFlagProtected)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !858, file: !2, baseType: !203, align: 8, offset: 128, flags: DIFlagProtected)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !858, file: !2, baseType: !9, size: 32, align: 32, offset: 64, flags: DIFlagProtected)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !858, file: !2, baseType: !864, align: 8, offset: 128, flags: DIFlagProtected)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<alloc::alloc::Global>", scope: !865, file: !2, align: 8, flags: DIFlagPublic, elements: !867, templateParams: !869, identifier: "3dc66121399937a8871e9766485561d8")
!865 = !DINamespace(name: "manually_drop", scope: !866)
!866 = !DINamespace(name: "mem", scope: !15)
!867 = !{!868}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !864, file: !2, baseType: !212, align: 8, flags: DIFlagPrivate)
!869 = !{!870}
!870 = !DITemplateTypeParameter(name: "T", type: !212)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !858, file: !2, baseType: !197, size: 32, align: 32, offset: 32, flags: DIFlagProtected)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !858, file: !2, baseType: !201, size: 32, align: 32, offset: 96, flags: DIFlagProtected)
!873 = !{!874, !875}
!874 = !DILocalVariable(name: "self", arg: 1, scope: !851, file: !852, line: 229, type: !857)
!875 = !DILocalVariable(name: "exact", scope: !876, file: !852, line: 230, type: !9, align: 32)
!876 = distinct !DILexicalBlock(scope: !851, file: !852, line: 230, column: 9)
!877 = !DILocation(line: 229, column: 18, scope: !851)
!878 = !DILocation(line: 230, column: 13, scope: !876)
!879 = !DILocation(line: 230, column: 24, scope: !851)
!880 = !DILocation(line: 28, column: 20, scope: !851)
!881 = !DILocation(line: 28, column: 18, scope: !851)
!882 = !DILocation(line: 233, column: 66, scope: !851)
!883 = !DILocation(line: 233, column: 45, scope: !851)
!884 = !DILocation(line: 235, column: 10, scope: !876)
!885 = !DILocation(line: 235, column: 22, scope: !876)
!886 = !DILocation(line: 235, column: 9, scope: !876)
!887 = !DILocation(line: 236, column: 6, scope: !851)
!888 = distinct !DISubprogram(name: "next<core::slice::iter::Iter<u16>, u16>", linkageName: "_ZN104_$LT$core..iter..adapters..cloned..Cloned$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h48e6eee6f1ad3442E", scope: !890, file: !889, line: 40, type: !891, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !277, templateParams: !896, retainedNodes: !894)
!889 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/adapters/cloned.rs", directory: "", checksumkind: CSK_MD5, checksum: "bfed33096282515437a01f48265c2199")
!890 = !DINamespace(name: "{impl#1}", scope: !727)
!891 = !DISubroutineType(types: !892)
!892 = !{!532, !893}
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::cloned::Cloned<core::slice::iter::Iter<u16>>", baseType: !726, size: 32, align: 32, dwarfAddressSpace: 0)
!894 = !{!895}
!895 = !DILocalVariable(name: "self", arg: 1, scope: !888, file: !889, line: 40, type: !893)
!896 = !{!744, !539}
!897 = !DILocation(line: 40, column: 13, scope: !888)
!898 = !DILocation(line: 41, column: 17, scope: !888)
!899 = !DILocation(line: 41, column: 24, scope: !888)
!900 = !DILocation(line: 42, column: 6, scope: !888)
!901 = distinct !DISubprogram(name: "size_hint<core::slice::iter::Iter<u16>, u16>", linkageName: "_ZN104_$LT$core..iter..adapters..cloned..Cloned$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17h8184a2c9dc96cb9eE", scope: !890, file: !889, line: 44, type: !902, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !277, templateParams: !896, retainedNodes: !905)
!902 = !DISubroutineType(types: !903)
!903 = !{!802, !904}
