; ModuleID = 'miniz_oxide.7913174b45d8a707-cgu.0'
source_filename = "miniz_oxide.7913174b45d8a707-cgu.0"
target datalayout = "e-m:e-p:32:32-p10:8:8-p20:8:8-i64:64-i128:128-n32:64-S128-ni:1:10:20"
target triple = "wasm32-unknown-wasi"

%"inflate::core::HuffmanTable" = type { [1024 x i16], [576 x i16] }

@alloc_e5f068060171aa1e41bbfb541de8bf11 = private unnamed_addr constant [120 x i8] c"/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/adapters/zip.rs\00", align 1
@alloc_bbdfae2fe7cc92e259c457cd83407a54 = private unnamed_addr constant <{ ptr, [12 x i8] }> <{ ptr @alloc_e5f068060171aa1e41bbfb541de8bf11, [12 x i8] c"w\00\00\00H\01\00\00!\00\00\00" }>, align 4
@alloc_e73af6cd88521c856ab8b75d1360ee6c = private unnamed_addr constant <{ ptr, [12 x i8] }> <{ ptr @alloc_e5f068060171aa1e41bbfb541de8bf11, [12 x i8] c"w\00\00\00I\01\00\00\13\00\00\00" }>, align 4
@alloc_12ced2a16964da5a644be74de4fba2a9 = private unnamed_addr constant <{ ptr, [12 x i8] }> <{ ptr @alloc_e5f068060171aa1e41bbfb541de8bf11, [12 x i8] c"w\00\00\00_\01\00\00\18\00\00\00" }>, align 4
@alloc_c7326983c8c8a873fe2d8ad8484cd14d = private unnamed_addr constant <{ ptr, [12 x i8] }> <{ ptr @alloc_e5f068060171aa1e41bbfb541de8bf11, [12 x i8] c"w\00\00\00N\01\00\00\0D\00\00\00" }>, align 4

!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "State", scope: !36, file: !5, baseType: !37, size: 8, align: 8, flags: DIFlagEnumClass, elements: !38)
!36 = !DINamespace(name: "core", scope: !25)
!37 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73}
!39 = !DIEnumerator(name: "Start", value: 0, isUnsigned: true)
!40 = !DIEnumerator(name: "ReadZlibCmf", value: 1, isUnsigned: true)
!41 = !DIEnumerator(name: "ReadZlibFlg", value: 2, isUnsigned: true)
!42 = !DIEnumerator(name: "ReadBlockHeader", value: 3, isUnsigned: true)
!43 = !DIEnumerator(name: "BlockTypeNoCompression", value: 4, isUnsigned: true)
!44 = !DIEnumerator(name: "RawHeader", value: 5, isUnsigned: true)
!45 = !DIEnumerator(name: "RawMemcpy1", value: 6, isUnsigned: true)
!46 = !DIEnumerator(name: "RawMemcpy2", value: 7, isUnsigned: true)
!47 = !DIEnumerator(name: "ReadTableSizes", value: 8, isUnsigned: true)
!48 = !DIEnumerator(name: "ReadHufflenTableCodeSize", value: 9, isUnsigned: true)
!49 = !DIEnumerator(name: "ReadLitlenDistTablesCodeSize", value: 10, isUnsigned: true)
!50 = !DIEnumerator(name: "ReadExtraBitsCodeSize", value: 11, isUnsigned: true)
!51 = !DIEnumerator(name: "DecodeLitlen", value: 12, isUnsigned: true)
!52 = !DIEnumerator(name: "WriteSymbol", value: 13, isUnsigned: true)
!53 = !DIEnumerator(name: "ReadExtraBitsLitlen", value: 14, isUnsigned: true)
!54 = !DIEnumerator(name: "DecodeDistance", value: 15, isUnsigned: true)
!55 = !DIEnumerator(name: "ReadExtraBitsDistance", value: 16, isUnsigned: true)
!56 = !DIEnumerator(name: "RawReadFirstByte", value: 17, isUnsigned: true)
!57 = !DIEnumerator(name: "RawStoreFirstByte", value: 18, isUnsigned: true)
!58 = !DIEnumerator(name: "WriteLenBytesToEnd", value: 19, isUnsigned: true)
!59 = !DIEnumerator(name: "BlockDone", value: 20, isUnsigned: true)
!60 = !DIEnumerator(name: "HuffDecodeOuterLoop1", value: 21, isUnsigned: true)
!61 = !DIEnumerator(name: "HuffDecodeOuterLoop2", value: 22, isUnsigned: true)
!62 = !DIEnumerator(name: "ReadAdler32", value: 23, isUnsigned: true)
!63 = !DIEnumerator(name: "DoneForever", value: 24, isUnsigned: true)
!64 = !DIEnumerator(name: "BlockTypeUnexpected", value: 25, isUnsigned: true)
!65 = !DIEnumerator(name: "BadCodeSizeSum", value: 26, isUnsigned: true)
!66 = !DIEnumerator(name: "BadDistOrLiteralTableLength", value: 27, isUnsigned: true)
!67 = !DIEnumerator(name: "BadTotalSymbols", value: 28, isUnsigned: true)
!68 = !DIEnumerator(name: "BadZlibHeader", value: 29, isUnsigned: true)
!69 = !DIEnumerator(name: "DistanceOutOfBounds", value: 30, isUnsigned: true)
!70 = !DIEnumerator(name: "BadRawLength", value: 31, isUnsigned: true)
!71 = !DIEnumerator(name: "BadCodeSizeDistPrevLookup", value: 32, isUnsigned: true)
!72 = !DIEnumerator(name: "InvalidLitlen", value: 33, isUnsigned: true)
!73 = !DIEnumerator(name: "InvalidDist", value: 34, isUnsigned: true)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !75, file: !5, baseType: !37, size: 8, align: 8, flags: DIFlagEnumClass, elements: !77)
!75 = !DINamespace(name: "panicking", scope: !76)
!76 = !DINamespace(name: "core", scope: null)
!77 = !{!78, !79, !80}
!78 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!79 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!80 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!81 = !{i32 7, !"Dwarf Version", i32 4}
!82 = !{i32 2, !"Debug Info Version", i32 3}
!83 = distinct !DISubprogram(name: "next<core::iter::adapters::zip::Zip<core::slice::iter::Iter<u16>, core::slice::iter::IterMut<u32>>>", linkageName: "_ZN100_$LT$core..iter..adapters..skip..Skip$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h99f11f3911703e15E", scope: !85, file: !84, line: 40, type: !89, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !164, retainedNodes: !166)
!84 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/adapters/skip.rs", directory: "", checksumkind: CSK_MD5, checksum: "7f14038741e345a97bd590ea1e558f0e")
!85 = !DINamespace(name: "{impl#1}", scope: !86)
!86 = !DINamespace(name: "skip", scope: !87)
!87 = !DINamespace(name: "adapters", scope: !88)
!88 = !DINamespace(name: "iter", scope: !76)
!89 = !DISubroutineType(types: !90)
!90 = !{!91, !114}
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<(&u16, &mut u32)>", scope: !92, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !93, templateParams: !98, identifier: "aed8c62795e842c3a5d0770bb7768919")
!92 = !DINamespace(name: "option", scope: !76)
!93 = !{!94}
!94 = !DICompositeType(tag: DW_TAG_variant_part, scope: !91, file: !5, size: 64, align: 32, elements: !95, templateParams: !98, identifier: "2159d027b51d2daea445bf3fa632f39c", discriminator: !113)
!95 = !{!96, !109}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !94, file: !5, baseType: !97, size: 64, align: 32, extraData: i32 0)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !91, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !98, templateParams: !99, identifier: "6d8f0154af57cfe31dcd7b78449a35d2")
!98 = !{}
!99 = !{!100}
!100 = !DITemplateTypeParameter(name: "T", type: !101)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "(&u16, &mut u32)", file: !5, size: 64, align: 32, elements: !102, templateParams: !98, identifier: "d02ffdca7728125a7fb2fd14a397e31c")
!102 = !{!103, !106}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !101, file: !5, baseType: !104, size: 32, align: 32)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u16", baseType: !105, size: 32, align: 32, dwarfAddressSpace: 0)
!105 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !101, file: !5, baseType: !107, size: 32, align: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut u32", baseType: !108, size: 32, align: 32, dwarfAddressSpace: 0)
!108 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !94, file: !5, baseType: !110, size: 64, align: 32)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !91, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !111, templateParams: !99, identifier: "8dbdcb515350ce87c7ac1eef48d696b5")
!111 = !{!112}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !110, file: !5, baseType: !101, size: 64, align: 32, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, scope: !91, file: !5, baseType: !108, size: 32, align: 32, flags: DIFlagArtificial)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::skip::Skip<core::iter::adapters::zip::Zip<core::slice::iter::Iter<u16>, core::slice::iter::IterMut<u32>>>", baseType: !115, size: 32, align: 32, dwarfAddressSpace: 0)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "Skip<core::iter::adapters::zip::Zip<core::slice::iter::Iter<u16>, core::slice::iter::IterMut<u32>>>", scope: !86, file: !5, size: 224, align: 32, flags: DIFlagPublic, elements: !116, templateParams: !164, identifier: "c578b679314c8a3d228112a7f0cab30f")
!116 = !{!117, !163}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !115, file: !5, baseType: !118, size: 192, align: 32, flags: DIFlagPrivate)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "Zip<core::slice::iter::Iter<u16>, core::slice::iter::IterMut<u32>>", scope: !119, file: !5, size: 192, align: 32, flags: DIFlagPublic, elements: !120, templateParams: !160, identifier: "119e9fb4e56e61a8378ea3fc7bfe015b")
!119 = !DINamespace(name: "zip", scope: !87)
!120 = !{!121, !141, !157, !159}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !118, file: !5, baseType: !122, size: 64, align: 32, flags: DIFlagPrivate)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u16>", scope: !123, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !125, templateParams: !133, identifier: "2a3d3c946425c23b918e712ef529b62d")
!123 = !DINamespace(name: "iter", scope: !124)
!124 = !DINamespace(name: "slice", scope: !76)
!125 = !{!126, !135, !136}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !122, file: !5, baseType: !127, size: 32, align: 32, flags: DIFlagPrivate)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u16>", scope: !128, file: !5, size: 32, align: 32, flags: DIFlagPublic, elements: !130, templateParams: !133, identifier: "74706ff21a163d5b1876036a150af747")
!128 = !DINamespace(name: "non_null", scope: !129)
!129 = !DINamespace(name: "ptr", scope: !76)
!130 = !{!131}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !127, file: !5, baseType: !132, size: 32, align: 32, flags: DIFlagPrivate)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u16", baseType: !105, size: 32, align: 32, dwarfAddressSpace: 0)
!133 = !{!134}
!134 = !DITemplateTypeParameter(name: "T", type: !105)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !122, file: !5, baseType: !132, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !122, file: !5, baseType: !137, align: 8, offset: 64, flags: DIFlagPrivate)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u16>", scope: !138, file: !5, align: 8, flags: DIFlagPublic, elements: !98, templateParams: !139, identifier: "b9cff2cfc2d8a22e1813a29b8ae29804")
!138 = !DINamespace(name: "marker", scope: !76)
!139 = !{!140}
!140 = !DITemplateTypeParameter(name: "T", type: !104)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !118, file: !5, baseType: !142, size: 64, align: 32, offset: 64, flags: DIFlagPrivate)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "IterMut<u32>", scope: !123, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !143, templateParams: !149, identifier: "68bc2efc30f0876ba172d0964bd146e9")
!143 = !{!144, !151, !153}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !142, file: !5, baseType: !145, size: 32, align: 32, flags: DIFlagPrivate)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u32>", scope: !128, file: !5, size: 32, align: 32, flags: DIFlagPublic, elements: !146, templateParams: !149, identifier: "e1b1ee01f96627017b31f56937b10543")
!146 = !{!147}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !145, file: !5, baseType: !148, size: 32, align: 32, flags: DIFlagPrivate)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u32", baseType: !108, size: 32, align: 32, dwarfAddressSpace: 0)
!149 = !{!150}
!150 = !DITemplateTypeParameter(name: "T", type: !108)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !142, file: !5, baseType: !152, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u32", baseType: !108, size: 32, align: 32, dwarfAddressSpace: 0)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !142, file: !5, baseType: !154, align: 8, offset: 64, flags: DIFlagPrivate)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&mut u32>", scope: !138, file: !5, align: 8, flags: DIFlagPublic, elements: !98, templateParams: !155, identifier: "8613977e9180b71f1b8d164d13a64f92")
!155 = !{!156}
!156 = !DITemplateTypeParameter(name: "T", type: !107)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !118, file: !5, baseType: !158, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!158 = !DIBasicType(name: "usize", size: 32, encoding: DW_ATE_unsigned)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !118, file: !5, baseType: !158, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!160 = !{!161, !162}
!161 = !DITemplateTypeParameter(name: "A", type: !122)
!162 = !DITemplateTypeParameter(name: "B", type: !142)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !115, file: !5, baseType: !158, size: 32, align: 32, offset: 192, flags: DIFlagPrivate)
!164 = !{!165}
!165 = !DITemplateTypeParameter(name: "I", type: !118)
!166 = !{!167}
!167 = !DILocalVariable(name: "self", arg: 1, scope: !83, file: !84, line: 40, type: !114)
!168 = !DILocation(line: 40, column: 13, scope: !83)
!169 = !DILocation(line: 41, column: 21, scope: !83)
!170 = !DILocalVariable(name: "b", arg: 1, scope: !171, file: !172, line: 456, type: !176)
!171 = distinct !DISubprogram(name: "unlikely", linkageName: "_ZN4core10intrinsics8unlikely17hbdaab305ce3910c8E", scope: !173, file: !172, line: 456, type: !174, scopeLine: 456, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !98, retainedNodes: !177)
!172 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "5088527a679dbab229c7a43df7f388f7")
!173 = !DINamespace(name: "intrinsics", scope: !76)
!174 = !DISubroutineType(types: !175)
!175 = !{!176, !176}
!176 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!177 = !{!170}
!178 = !DILocation(line: 456, column: 23, scope: !171, inlinedAt: !179)
!179 = distinct !DILocation(line: 41, column: 12, scope: !83)
!180 = !DILocation(line: 457, column: 8, scope: !171, inlinedAt: !179)
!181 = !DILocation(line: 461, column: 9, scope: !171, inlinedAt: !179)
!182 = !DILocation(line: 457, column: 5, scope: !171, inlinedAt: !179)
!183 = !DILocation(line: 459, column: 9, scope: !171, inlinedAt: !179)
!184 = !DILocation(line: 463, column: 2, scope: !171, inlinedAt: !179)
!185 = !DILocation(line: 41, column: 12, scope: !83)
!186 = !DILocation(line: 44, column: 23, scope: !83)
!187 = !DILocation(line: 42, column: 44, scope: !83)
!188 = !DILocation(line: 42, column: 27, scope: !83)
!189 = !DILocation(line: 42, column: 23, scope: !83)
!190 = !DILocation(line: 46, column: 6, scope: !83)
!191 = distinct !DISubprogram(name: "start_bound<usize>", linkageName: "_ZN100_$LT$core..ops..range..RangeInclusive$LT$T$GT$$u20$as$u20$core..ops..range..RangeBounds$LT$T$GT$$GT$11start_bound17h7d9ba89dc34726ccE", scope: !193, file: !192, line: 1089, type: !196, scopeLine: 1089, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !226, retainedNodes: !224)
!192 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ops/range.rs", directory: "", checksumkind: CSK_MD5, checksum: "7a147c45a76a1a2965a82865e25902fd")
!193 = !DINamespace(name: "{impl#24}", scope: !194)
!194 = !DINamespace(name: "range", scope: !195)
!195 = !DINamespace(name: "ops", scope: !76)
!196 = !DISubroutineType(types: !197)
!197 = !{!198, !216}
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bound<&usize>", scope: !194, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !199, templateParams: !98, identifier: "b5fdb104be7fc866223a3e01a2e9901")
!199 = !{!200}
!200 = !DICompositeType(tag: DW_TAG_variant_part, scope: !198, file: !5, size: 64, align: 32, elements: !201, templateParams: !98, identifier: "33fe0d4e5a9d2a10eed8c8a34f306f4a", discriminator: !215)
!201 = !{!202, !209, !213}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "Included", scope: !200, file: !5, baseType: !203, size: 64, align: 32, extraData: i32 0)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "Included", scope: !198, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !204, templateParams: !207, identifier: "bc906d690d009a404bb57b08d996eb7")
!204 = !{!205}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !203, file: !5, baseType: !206, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !158, size: 32, align: 32, dwarfAddressSpace: 0)
!207 = !{!208}
!208 = !DITemplateTypeParameter(name: "T", type: !206)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "Excluded", scope: !200, file: !5, baseType: !210, size: 64, align: 32, extraData: i32 1)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "Excluded", scope: !198, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !211, templateParams: !207, identifier: "dfb982b00c639cba22bc9db37ed76be0")
!211 = !{!212}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !210, file: !5, baseType: !206, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "Unbounded", scope: !200, file: !5, baseType: !214, size: 64, align: 32, extraData: i32 2)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unbounded", scope: !198, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !98, templateParams: !207, identifier: "ca0d12b23306f8bd65669cdf03c6dccf")
!215 = !DIDerivedType(tag: DW_TAG_member, scope: !198, file: !5, baseType: !108, size: 32, align: 32, flags: DIFlagArtificial)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::ops::range::RangeInclusive<usize>", baseType: !217, size: 32, align: 32, dwarfAddressSpace: 0)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeInclusive<usize>", scope: !194, file: !5, size: 96, align: 32, flags: DIFlagPublic, elements: !218, templateParams: !222, identifier: "5b62870719694fc8589db31ec9dd6012")
!218 = !{!219, !220, !221}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !217, file: !5, baseType: !158, size: 32, align: 32, flags: DIFlagProtected)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !217, file: !5, baseType: !158, size: 32, align: 32, offset: 32, flags: DIFlagProtected)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "exhausted", scope: !217, file: !5, baseType: !176, size: 8, align: 8, offset: 64, flags: DIFlagProtected)
!222 = !{!223}
!223 = !DITemplateTypeParameter(name: "Idx", type: !158)
!224 = !{!225}
!225 = !DILocalVariable(name: "self", arg: 1, scope: !191, file: !192, line: 1089, type: !216)
!226 = !{!227}
!227 = !DITemplateTypeParameter(name: "T", type: !158)
!228 = !DILocation(line: 1089, column: 20, scope: !191)
!229 = !DILocation(line: 1091, column: 6, scope: !191)
!230 = distinct !DISubprogram(name: "end_bound<usize>", linkageName: "_ZN100_$LT$core..ops..range..RangeInclusive$LT$T$GT$$u20$as$u20$core..ops..range..RangeBounds$LT$T$GT$$GT$9end_bound17h9c6a358da176cad8E", scope: !193, file: !192, line: 1092, type: !196, scopeLine: 1092, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !226, retainedNodes: !231)
!231 = !{!232}
!232 = !DILocalVariable(name: "self", arg: 1, scope: !230, file: !192, line: 1092, type: !216)
!233 = !DILocation(line: 1092, column: 18, scope: !230)
!234 = !DILocation(line: 1093, column: 12, scope: !230)
!235 = !DILocation(line: 1098, column: 22, scope: !230)
!236 = !DILocation(line: 1098, column: 13, scope: !230)
!237 = !DILocation(line: 1093, column: 9, scope: !230)
!238 = !DILocation(line: 1096, column: 22, scope: !230)
!239 = !DILocation(line: 1096, column: 13, scope: !230)
!240 = !DILocation(line: 1100, column: 6, scope: !230)
!241 = distinct !DISubprogram(name: "nth<core::slice::iter::Iter<u16>, core::slice::iter::IterMut<u32>>", linkageName: "_ZN102_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$3nth17he9e61567c6bf8220E", scope: !243, file: !242, line: 94, type: !244, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !160, retainedNodes: !247)
!242 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/iter/adapters/zip.rs", directory: "", checksumkind: CSK_MD5, checksum: "3b799775cfe5a249b4485e2512707a77")
!243 = !DINamespace(name: "{impl#1}", scope: !119)
!244 = !DISubroutineType(types: !245)
!245 = !{!91, !246, !158}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::zip::Zip<core::slice::iter::Iter<u16>, core::slice::iter::IterMut<u32>>", baseType: !118, size: 32, align: 32, dwarfAddressSpace: 0)
!247 = !{!248, !249}
!248 = !DILocalVariable(name: "self", arg: 1, scope: !241, file: !242, line: 94, type: !246)
!249 = !DILocalVariable(name: "n", arg: 2, scope: !241, file: !242, line: 94, type: !158)
!250 = !DILocation(line: 94, column: 12, scope: !241)
!251 = !DILocation(line: 94, column: 23, scope: !241)
!252 = !DILocation(line: 95, column: 9, scope: !241)
!253 = !DILocation(line: 96, column: 6, scope: !241)
!254 = distinct !DISubprogram(name: "next<core::slice::iter::Iter<u16>, core::slice::iter::IterMut<u32>>", linkageName: "_ZN102_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h53cde08552ac4939E", scope: !243, file: !242, line: 84, type: !255, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !160, retainedNodes: !257)
!255 = !DISubroutineType(types: !256)
!256 = !{!91, !246}
!257 = !{!258}
!258 = !DILocalVariable(name: "self", arg: 1, scope: !254, file: !242, line: 84, type: !246)
!259 = !DILocation(line: 84, column: 13, scope: !254)
!260 = !DILocation(line: 85, column: 9, scope: !254)
!261 = !DILocation(line: 86, column: 6, scope: !254)
!262 = distinct !DISubprogram(name: "get<core::cell::Cell<u8>>", linkageName: "_ZN106_$LT$core..ops..range..Range$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$3get17h6bc0e2afcbbf7e69E", scope: !264, file: !263, line: 361, type: !266, scopeLine: 361, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !303, retainedNodes: !299)
!263 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "af6ecb4d2663035e0aa38579163ee106")
!264 = !DINamespace(name: "{impl#4}", scope: !265)
!265 = !DINamespace(name: "index", scope: !124)
!266 = !DISubroutineType(types: !267)
!267 = !{!268, !295, !276}
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::cell::Cell<u8>]>", scope: !92, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !269, templateParams: !98, identifier: "9405a45d970a72eea9ae759fcde6b224")
!269 = !{!270}
!270 = !DICompositeType(tag: DW_TAG_variant_part, scope: !268, file: !5, size: 64, align: 32, elements: !271, templateParams: !98, identifier: "74a001638c1f1ab22438fbcf4a1d9eb9", discriminator: !294)
!271 = !{!272, !290}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !270, file: !5, baseType: !273, size: 64, align: 32, extraData: i32 0)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !268, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !98, templateParams: !274, identifier: "c41042e55cb8a719f407735abad01269")
!274 = !{!275}
!275 = !DITemplateTypeParameter(name: "T", type: !276)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::cell::Cell<u8>]", file: !5, size: 64, align: 32, elements: !277, templateParams: !98, identifier: "e1cebee29cb0ebc84ab68c5ad0aba918")
!277 = !{!278, !289}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !276, file: !5, baseType: !279, size: 32, align: 32)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32, align: 32, dwarfAddressSpace: 0)
!280 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<u8>", scope: !281, file: !5, size: 8, align: 8, flags: DIFlagPublic, elements: !282, templateParams: !287, identifier: "fe1d374293d4fd774df623ff180a9")
!281 = !DINamespace(name: "cell", scope: !76)
!282 = !{!283}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !280, file: !5, baseType: !284, size: 8, align: 8, flags: DIFlagPrivate)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !281, file: !5, size: 8, align: 8, flags: DIFlagPublic, elements: !285, templateParams: !287, identifier: "7fbdf3765c7d982595b6e2f5da9ae737")
!285 = !{!286}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !284, file: !5, baseType: !37, size: 8, align: 8, flags: DIFlagPrivate)
!287 = !{!288}
!288 = !DITemplateTypeParameter(name: "T", type: !37)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !276, file: !5, baseType: !158, size: 32, align: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !270, file: !5, baseType: !291, size: 64, align: 32)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !268, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !292, templateParams: !274, identifier: "b138a466a5e6beea90da3c4c4f369378")
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !291, file: !5, baseType: !276, size: 64, align: 32, flags: DIFlagPublic)
!294 = !DIDerivedType(tag: DW_TAG_member, scope: !268, file: !5, baseType: !108, size: 32, align: 32, flags: DIFlagArtificial)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "Range<usize>", scope: !194, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !296, templateParams: !222, identifier: "163ec5cb5e1648a8f47c0fd85be167c6")
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !295, file: !5, baseType: !158, size: 32, align: 32, flags: DIFlagPublic)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !295, file: !5, baseType: !158, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!299 = !{!300, !301, !302}
!300 = !DILocalVariable(name: "self", arg: 1, scope: !262, file: !263, line: 361, type: !295)
!301 = !DILocalVariable(name: "slice", arg: 2, scope: !262, file: !263, line: 361, type: !276)
!302 = !DILocalVariable(name: "new_len", scope: !262, file: !263, line: 363, type: !158, align: 32)
!303 = !{!304}
!304 = !DITemplateTypeParameter(name: "T", type: !280)
!305 = !DILocation(line: 361, column: 12, scope: !262)
!306 = !DILocation(line: 361, column: 18, scope: !262)
!307 = !DILocation(line: 363, column: 32, scope: !262)
!308 = !DILocation(line: 363, column: 16, scope: !262)
!309 = !DILocation(line: 363, column: 21, scope: !262)
!310 = !DILocation(line: 364, column: 16, scope: !262)
!311 = !DILocation(line: 369, column: 13, scope: !262)
!312 = !DILocation(line: 363, column: 9, scope: !262)
!313 = !DILocalVariable(name: "ptr", arg: 1, scope: !314, file: !263, line: 82, type: !317)
!314 = distinct !DISubprogram(name: "get_offset_len_noubcheck<core::cell::Cell<u8>>", linkageName: "_ZN4core5slice5index24get_offset_len_noubcheck17h55319425aa6346c7E", scope: !265, file: !263, line: 81, type: !315, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !303, retainedNodes: !321)
!315 = !DISubroutineType(types: !316)
!316 = !{!317, !317, !158, !158}
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [core::cell::Cell<u8>]", file: !5, size: 64, align: 32, elements: !318, templateParams: !98, identifier: "3fecaadb8591ed9afd8760af31802225")
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !317, file: !5, baseType: !279, size: 32, align: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !317, file: !5, baseType: !158, size: 32, align: 32, offset: 32)
!321 = !{!313, !322, !323, !324, !327}
!322 = !DILocalVariable(name: "offset", arg: 2, scope: !314, file: !263, line: 83, type: !158)
!323 = !DILocalVariable(name: "len", arg: 3, scope: !314, file: !263, line: 84, type: !158)
!324 = !DILocalVariable(name: "ptr", scope: !325, file: !263, line: 86, type: !326, align: 32)
!325 = distinct !DILexicalBlock(scope: !314, file: !263, line: 86, column: 5)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::cell::Cell<u8>", baseType: !280, size: 32, align: 32, dwarfAddressSpace: 0)
!327 = !DILocalVariable(name: "ptr", scope: !328, file: !263, line: 88, type: !326, align: 32)
!328 = distinct !DILexicalBlock(scope: !325, file: !263, line: 88, column: 5)
!329 = !DILocation(line: 82, column: 5, scope: !314, inlinedAt: !330)
!330 = distinct !DILocation(line: 367, column: 29, scope: !262)
!331 = !DILocation(line: 83, column: 5, scope: !314, inlinedAt: !330)
!332 = !DILocation(line: 84, column: 5, scope: !314, inlinedAt: !330)
!333 = !DILocation(line: 86, column: 15, scope: !314, inlinedAt: !330)
!334 = !DILocation(line: 86, column: 9, scope: !325, inlinedAt: !330)
!335 = !DILocation(line: 88, column: 24, scope: !325, inlinedAt: !330)
!336 = !DILocation(line: 88, column: 9, scope: !328, inlinedAt: !330)
!337 = !DILocation(line: 90, column: 2, scope: !314, inlinedAt: !330)
!338 = !DILocation(line: 367, column: 29, scope: !262)
!339 = !DILocation(line: 367, column: 22, scope: !262)
!340 = !DILocation(line: 371, column: 6, scope: !262)
!341 = !DILocation(line: 361, column: 5, scope: !262)
!342 = distinct !DISubprogram(name: "index_mut<u32>", linkageName: "_ZN110_$LT$core..ops..range..RangeFrom$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h20a51ce4b1cc36f3E", scope: !343, file: !263, line: 574, type: !344, scopeLine: 574, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !149, retainedNodes: !378)
!343 = !DINamespace(name: "{impl#7}", scope: !265)
!344 = !DISubroutineType(types: !345)
!345 = !{!346, !351, !346, !354}
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [u32]", file: !5, size: 64, align: 32, elements: !347, templateParams: !98, identifier: "a0472006166d2ea01b967040b09ef870")
!347 = !{!348, !350}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !346, file: !5, baseType: !349, size: 32, align: 32)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32, align: 32, dwarfAddressSpace: 0)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !346, file: !5, baseType: !158, size: 32, align: 32, offset: 32)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFrom<usize>", scope: !194, file: !5, size: 32, align: 32, flags: DIFlagPublic, elements: !352, templateParams: !222, identifier: "61d74a89174d867df24adeb3c19e1a5e")
!352 = !{!353}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !351, file: !5, baseType: !158, size: 32, align: 32, flags: DIFlagPublic)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !355, size: 32, align: 32, dwarfAddressSpace: 0)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !356, file: !5, size: 128, align: 32, flags: DIFlagPublic, elements: !358, templateParams: !98, identifier: "7c34cafe8ea1dcad4032b9360816105f")
!356 = !DINamespace(name: "location", scope: !357)
!357 = !DINamespace(name: "panic", scope: !76)
!358 = !{!359, !368, !369, !370}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !355, file: !5, baseType: !360, size: 64, align: 32, flags: DIFlagPrivate)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<str>", scope: !128, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !361, templateParams: !287, identifier: "88212fc410c4399fd5095990cc8304ca")
!361 = !{!362}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !360, file: !5, baseType: !363, size: 64, align: 32, flags: DIFlagPrivate)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const str", file: !5, size: 64, align: 32, elements: !364, templateParams: !98, identifier: "238a44609877474087c05adf26cd41fa")
!364 = !{!365, !367}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !363, file: !5, baseType: !366, size: 32, align: 32)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 32, align: 32, dwarfAddressSpace: 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !363, file: !5, baseType: !158, size: 32, align: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !355, file: !5, baseType: !108, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !355, file: !5, baseType: !108, size: 32, align: 32, offset: 96, flags: DIFlagPrivate)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_filename", scope: !355, file: !5, baseType: !371, align: 8, offset: 128, flags: DIFlagPrivate)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&str>", scope: !138, file: !5, align: 8, flags: DIFlagPublic, elements: !98, templateParams: !372, identifier: "4cfc3eea77dd95eabd59051b67bd7e66")
!372 = !{!373}
!373 = !DITemplateTypeParameter(name: "T", type: !374)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !5, size: 64, align: 32, elements: !375, templateParams: !98, identifier: "9277eecd40495f85161460476aacc992")
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !374, file: !5, baseType: !366, size: 32, align: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !374, file: !5, baseType: !158, size: 32, align: 32, offset: 32)
!378 = !{!379, !380, !381}
!379 = !DILocalVariable(name: "self", arg: 1, scope: !342, file: !263, line: 574, type: !351)
!380 = !DILocalVariable(name: "slice", arg: 2, scope: !342, file: !263, line: 574, type: !346)
!381 = !DILocalVariable(name: "new_len", scope: !382, file: !263, line: 580, type: !158, align: 32)
!382 = distinct !DILexicalBlock(scope: !342, file: !263, line: 580, column: 13)
!383 = !DILocation(line: 574, column: 18, scope: !342)
!384 = !DILocation(line: 574, column: 24, scope: !342)
!385 = !DILocation(line: 575, column: 12, scope: !342)
!386 = !DILocation(line: 580, column: 27, scope: !342)
!387 = !DILocation(line: 580, column: 17, scope: !382)
!388 = !DILocalVariable(name: "ptr", arg: 1, scope: !389, file: !263, line: 94, type: !392)
!389 = distinct !DISubprogram(name: "get_offset_len_mut_noubcheck<u32>", linkageName: "_ZN4core5slice5index28get_offset_len_mut_noubcheck17hc1773f5fc5f8389dE", scope: !265, file: !263, line: 93, type: !390, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !149, retainedNodes: !396)
!390 = !DISubroutineType(types: !391)
!391 = !{!392, !392, !158, !158}
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "*mut [u32]", file: !5, size: 64, align: 32, elements: !393, templateParams: !98, identifier: "2074ba719b26e1e4a695d60bcae6b6e9")
!393 = !{!394, !395}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !392, file: !5, baseType: !349, size: 32, align: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !392, file: !5, baseType: !158, size: 32, align: 32, offset: 32)
!396 = !{!388, !397, !398, !399, !401}
!397 = !DILocalVariable(name: "offset", arg: 2, scope: !389, file: !263, line: 95, type: !158)
!398 = !DILocalVariable(name: "len", arg: 3, scope: !389, file: !263, line: 96, type: !158)
!399 = !DILocalVariable(name: "ptr", scope: !400, file: !263, line: 98, type: !152, align: 32)
!400 = distinct !DILexicalBlock(scope: !389, file: !263, line: 98, column: 5)
!401 = !DILocalVariable(name: "ptr", scope: !402, file: !263, line: 100, type: !152, align: 32)
!402 = distinct !DILexicalBlock(scope: !400, file: !263, line: 100, column: 5)
!403 = !DILocation(line: 94, column: 5, scope: !389, inlinedAt: !404)
!404 = distinct !DILocation(line: 581, column: 19, scope: !382)
!405 = !DILocation(line: 95, column: 5, scope: !389, inlinedAt: !404)
!406 = !DILocation(line: 96, column: 5, scope: !389, inlinedAt: !404)
!407 = !DILocation(line: 98, column: 15, scope: !389, inlinedAt: !404)
!408 = !DILocation(line: 98, column: 9, scope: !400, inlinedAt: !404)
!409 = !DILocation(line: 100, column: 24, scope: !400, inlinedAt: !404)
!410 = !DILocation(line: 100, column: 9, scope: !402, inlinedAt: !404)
!411 = !DILocation(line: 102, column: 2, scope: !389, inlinedAt: !404)
!412 = !DILocation(line: 581, column: 19, scope: !382)
!413 = !DILocation(line: 583, column: 6, scope: !342)
!414 = !DILocation(line: 576, column: 13, scope: !342)
!415 = distinct !DISubprogram(name: "new<core::slice::iter::Iter<u16>, core::slice::iter::IterMut<u32>>", linkageName: "_ZN111_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..adapters..zip..ZipImpl$LT$A$C$B$GT$$GT$3new17h0f63b83af19f0450E", scope: !416, file: !242, line: 299, type: !417, scopeLine: 299, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !160, retainedNodes: !419)
!416 = !DINamespace(name: "{impl#5}", scope: !119)
!417 = !DISubroutineType(types: !418)
!418 = !{!118, !122, !142}
!419 = !{!420, !421, !422}
!420 = !DILocalVariable(name: "a", arg: 1, scope: !415, file: !242, line: 299, type: !122)
!421 = !DILocalVariable(name: "b", arg: 2, scope: !415, file: !242, line: 299, type: !142)
!422 = !DILocalVariable(name: "len", scope: !423, file: !242, line: 300, type: !158, align: 32)
!423 = distinct !DILexicalBlock(scope: !415, file: !242, line: 300, column: 9)
!424 = !DILocation(line: 299, column: 12, scope: !415)
!425 = !DILocation(line: 299, column: 18, scope: !415)
!426 = !DILocation(line: 300, column: 30, scope: !415)
!427 = !DILocation(line: 300, column: 40, scope: !415)
!428 = !DILocation(line: 300, column: 19, scope: !415)
!429 = !DILocation(line: 300, column: 13, scope: !423)
!430 = !DILocation(line: 301, column: 15, scope: !423)
!431 = !DILocation(line: 301, column: 18, scope: !423)
!432 = !DILocation(line: 301, column: 9, scope: !423)
!433 = !DILocation(line: 302, column: 6, scope: !415)
!434 = distinct !DISubprogram(name: "nth<core::slice::iter::Iter<u16>, core::slice::iter::IterMut<u32>>", linkageName: "_ZN111_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..adapters..zip..ZipImpl$LT$A$C$B$GT$$GT$3nth17h3c754a0cc90e5638E", scope: !416, file: !242, line: 327, type: !244, scopeLine: 327, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !160, retainedNodes: !435)
!435 = !{!436, !437, !438, !440, !442}
!436 = !DILocalVariable(name: "self", arg: 1, scope: !434, file: !242, line: 327, type: !246)
!437 = !DILocalVariable(name: "n", arg: 2, scope: !434, file: !242, line: 327, type: !158)
!438 = !DILocalVariable(name: "delta", scope: !439, file: !242, line: 328, type: !158, align: 32)
!439 = distinct !DILexicalBlock(scope: !434, file: !242, line: 328, column: 9)
!440 = !DILocalVariable(name: "end", scope: !441, file: !242, line: 329, type: !158, align: 32)
!441 = distinct !DILexicalBlock(scope: !439, file: !242, line: 329, column: 9)
!442 = !DILocalVariable(name: "i", scope: !443, file: !242, line: 331, type: !158, align: 32)
!443 = distinct !DILexicalBlock(scope: !441, file: !242, line: 331, column: 13)
!444 = !DILocation(line: 327, column: 12, scope: !434)
!445 = !DILocation(line: 327, column: 23, scope: !434)
!446 = !DILocation(line: 328, column: 33, scope: !434)
!447 = !DILocation(line: 328, column: 44, scope: !434)
!448 = !DILocation(line: 328, column: 21, scope: !434)
!449 = !DILocation(line: 328, column: 13, scope: !439)
!450 = !DILocation(line: 329, column: 19, scope: !439)
!451 = !DILocation(line: 329, column: 13, scope: !441)
!452 = !DILocation(line: 330, column: 9, scope: !441)
!453 = !DILocation(line: 330, column: 15, scope: !441)
!454 = !DILocation(line: 351, column: 24, scope: !441)
!455 = !DILocation(line: 331, column: 21, scope: !441)
!456 = !DILocation(line: 331, column: 17, scope: !443)
!457 = !DILocation(line: 334, column: 13, scope: !443)
!458 = !DILocation(line: 351, column: 14, scope: !441)
!459 = !DILocation(line: 352, column: 6, scope: !434)
!460 = !DILocation(line: 335, column: 16, scope: !443)
!461 = !DILocation(line: 343, column: 16, scope: !443)
!462 = distinct !DISubprogram(name: "next<core::slice::iter::Iter<u16>, core::slice::iter::IterMut<u32>>", linkageName: "_ZN111_$LT$core..iter..adapters..zip..Zip$LT$A$C$B$GT$$u20$as$u20$core..iter..adapters..zip..ZipImpl$LT$A$C$B$GT$$GT$4next17hafd8f3112898d1c3E", scope: !416, file: !242, line: 305, type: !255, scopeLine: 305, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !160, retainedNodes: !463)
!463 = !{!464, !465}
!464 = !DILocalVariable(name: "self", arg: 1, scope: !462, file: !242, line: 305, type: !246)
!465 = !DILocalVariable(name: "i", scope: !466, file: !242, line: 307, type: !158, align: 32)
!466 = distinct !DILexicalBlock(scope: !462, file: !242, line: 307, column: 13)
!467 = !DILocation(line: 305, column: 13, scope: !462)
!468 = !DILocation(line: 306, column: 12, scope: !462)
!469 = !DILocation(line: 306, column: 25, scope: !462)
!470 = !DILocation(line: 316, column: 13, scope: !462)
!471 = !DILocation(line: 306, column: 9, scope: !462)
!472 = !DILocation(line: 307, column: 21, scope: !462)
!473 = !DILocation(line: 307, column: 17, scope: !466)
!474 = !DILocation(line: 310, column: 13, scope: !466)
!475 = !DILocation(line: 318, column: 6, scope: !462)
!476 = !DILocation(line: 313, column: 30, scope: !466)
!477 = !DILocation(line: 313, column: 59, scope: !466)
!478 = !DILocation(line: 313, column: 66, scope: !466)
!479 = !DILocation(line: 313, column: 17, scope: !466)
!480 = distinct !DISubprogram(name: "update_adler32", linkageName: "_ZN11miniz_oxide6shared14update_adler3217h6668bde8619c7d4aE", scope: !482, file: !481, line: 13, type: !483, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1, templateParams: !98, retainedNodes: !489)
!481 = !DIFile(filename: "src/shared.rs", directory: "/Users/namse/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/miniz_oxide-0.8.9", checksumkind: CSK_MD5, checksum: "f61efde18a22cc9989d0f737693d8075")
!482 = !DINamespace(name: "shared", scope: !6)
!483 = !DISubroutineType(types: !484)
!484 = !{!108, !108, !485}
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !5, size: 64, align: 32, elements: !486, templateParams: !98, identifier: "31681e0c10b314f1f33e38b2779acbb4")
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !485, file: !5, baseType: !366, size: 32, align: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !485, file: !5, baseType: !158, size: 32, align: 32, offset: 32)
!489 = !{!490, !491, !492}
!490 = !DILocalVariable(name: "adler", arg: 1, scope: !480, file: !481, line: 13, type: !108)
!491 = !DILocalVariable(name: "data", arg: 2, scope: !480, file: !481, line: 13, type: !485)
!492 = !DILocalVariable(name: "hash", scope: !493, file: !481, line: 14, type: !494, align: 16)
!493 = distinct !DILexicalBlock(scope: !480, file: !481, line: 14, column: 5)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "Adler32", scope: !495, file: !5, size: 32, align: 16, flags: DIFlagPublic, elements: !496, templateParams: !98, identifier: "46837ff781fc7d963a1cfbfde15b62c1")
!495 = !DINamespace(name: "adler2", scope: null)
!496 = !{!497, !498}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !494, file: !5, baseType: !105, size: 16, align: 16, flags: DIFlagPrivate)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !494, file: !5, baseType: !105, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!499 = !DILocation(line: 13, column: 23, scope: !480)
!500 = !DILocation(line: 13, column: 35, scope: !480)
!501 = !DILocation(line: 14, column: 9, scope: !493)
!502 = !DILocation(line: 14, column: 20, scope: !480)
!503 = !DILocation(line: 15, column: 10, scope: !493)
!504 = !DILocation(line: 16, column: 10, scope: !493)
!505 = !DILocation(line: 17, column: 2, scope: !480)
!506 = distinct !DISubprogram(name: "new", linkageName: "_ZN11miniz_oxide7MZFlush3new17h9ed99828ac9c9861E", scope: !4, file: !507, line: 72, type: !508, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1, templateParams: !98, declaration: !527, retainedNodes: !528)
!507 = !DIFile(filename: "src/lib.rs", directory: "/Users/namse/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/miniz_oxide-0.8.9", checksumkind: CSK_MD5, checksum: "894deab2391d79abb4e88131fdd03e69")
!508 = !DISubroutineType(types: !509)
!509 = !{!510, !7}
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<miniz_oxide::MZFlush, miniz_oxide::MZError>", scope: !511, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !512, templateParams: !98, identifier: "68c7251164daadb1e02abb18cf0b4f72")
!511 = !DINamespace(name: "result", scope: !76)
!512 = !{!513}
!513 = !DICompositeType(tag: DW_TAG_variant_part, scope: !510, file: !5, size: 64, align: 32, elements: !514, templateParams: !98, identifier: "490a841ff030c6814a486b8f6ca9ec67", discriminator: !526)
!514 = !{!515, !522}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !513, file: !5, baseType: !516, size: 64, align: 32, extraData: i32 0)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !510, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !517, templateParams: !519, identifier: "470b82538d1f89a31aaf6b421590a26d")
!517 = !{!518}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !516, file: !5, baseType: !4, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!519 = !{!520, !521}
!520 = !DITemplateTypeParameter(name: "T", type: !4)
!521 = !DITemplateTypeParameter(name: "E", type: !15)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !513, file: !5, baseType: !523, size: 64, align: 32, extraData: i32 1)
!523 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !510, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !524, templateParams: !519, identifier: "2cc9c5f2e7fd342ff73756b002cf8b3b")
!524 = !{!525}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !523, file: !5, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!526 = !DIDerivedType(tag: DW_TAG_member, scope: !510, file: !5, baseType: !108, size: 32, align: 32, flags: DIFlagArtificial)
!527 = !DISubprogram(name: "new", linkageName: "_ZN11miniz_oxide7MZFlush3new17h9ed99828ac9c9861E", scope: !4, file: !507, line: 72, type: !508, scopeLine: 72, flags: DIFlagPrototyped, spFlags: 0, templateParams: !98)
!528 = !{!529}
!529 = !DILocalVariable(name: "flush", arg: 1, scope: !506, file: !507, line: 72, type: !7)
!530 = !DILocation(line: 72, column: 16, scope: !506)
!531 = !DILocation(line: 73, column: 9, scope: !506)
!532 = !DILocation(line: 78, column: 18, scope: !506)
!533 = !DILocation(line: 78, column: 36, scope: !506)
!534 = !DILocation(line: 74, column: 18, scope: !506)
!535 = !DILocation(line: 74, column: 34, scope: !506)
!536 = !DILocation(line: 75, column: 22, scope: !506)
!537 = !DILocation(line: 75, column: 38, scope: !506)
!538 = !DILocation(line: 76, column: 18, scope: !506)
!539 = !DILocation(line: 76, column: 34, scope: !506)
!540 = !DILocation(line: 77, column: 18, scope: !506)
!541 = !DILocation(line: 77, column: 36, scope: !506)
!542 = !DILocation(line: 80, column: 6, scope: !506)
!543 = distinct !DISubprogram(name: "from_i32", linkageName: "_ZN11miniz_oxide7inflate11TINFLStatus8from_i3217h684347e588ee034fE", scope: !24, file: !544, line: 82, type: !545, scopeLine: 82, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1, templateParams: !98, declaration: !560, retainedNodes: !561)
!544 = !DIFile(filename: "src/inflate/mod.rs", directory: "/Users/namse/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/miniz_oxide-0.8.9", checksumkind: CSK_MD5, checksum: "2a0a37d3beadcf4b9f95009168be952b")
!545 = !DISubroutineType(types: !546)
!546 = !{!547, !7}
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<miniz_oxide::inflate::TINFLStatus>", scope: !92, file: !5, size: 8, align: 8, flags: DIFlagPublic, elements: !548, templateParams: !98, identifier: "b2d1bb71f583bee365ea080bad57c953")
!548 = !{!549}
!549 = !DICompositeType(tag: DW_TAG_variant_part, scope: !547, file: !5, size: 8, align: 8, elements: !550, templateParams: !98, identifier: "a15457e8adbfe96ce4f92324352012ec", discriminator: !559)
!550 = !{!551, !555}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !549, file: !5, baseType: !552, size: 8, align: 8, extraData: i8 3)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !547, file: !5, size: 8, align: 8, flags: DIFlagPublic, elements: !98, templateParams: !553, identifier: "512e16ad6a6823ed5b8fa0681f0a313d")
!553 = !{!554}
!554 = !DITemplateTypeParameter(name: "T", type: !24)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !549, file: !5, baseType: !556, size: 8, align: 8)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !547, file: !5, size: 8, align: 8, flags: DIFlagPublic, elements: !557, templateParams: !553, identifier: "eb4739ec0b4208c364e3e05ca51db090")
!557 = !{!558}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !556, file: !5, baseType: !24, size: 8, align: 8, flags: DIFlagPublic)
!559 = !DIDerivedType(tag: DW_TAG_member, scope: !547, file: !5, baseType: !37, size: 8, align: 8, flags: DIFlagArtificial)
!560 = !DISubprogram(name: "from_i32", linkageName: "_ZN11miniz_oxide7inflate11TINFLStatus8from_i3217h684347e588ee034fE", scope: !24, file: !544, line: 82, type: !545, scopeLine: 82, flags: DIFlagPrototyped, spFlags: 0, templateParams: !98)
!561 = !{!562}
!562 = !DILocalVariable(name: "value", arg: 1, scope: !543, file: !544, line: 82, type: !7)
!563 = !DILocation(line: 82, column: 21, scope: !543)
!564 = !DILocation(line: 84, column: 9, scope: !543)
!565 = !DILocation(line: 94, column: 18, scope: !543)
!566 = !DILocation(line: 85, column: 57, scope: !543)
!567 = !DILocation(line: 85, column: 86, scope: !543)
!568 = !DILocation(line: 86, column: 39, scope: !543)
!569 = !DILocation(line: 86, column: 52, scope: !543)
!570 = !DILocation(line: 87, column: 46, scope: !543)
!571 = !DILocation(line: 87, column: 66, scope: !543)
!572 = !DILocation(line: 88, column: 36, scope: !543)
!573 = !DILocation(line: 88, column: 47, scope: !543)
!574 = !DILocation(line: 89, column: 34, scope: !543)
!575 = !DILocation(line: 89, column: 43, scope: !543)
!576 = !DILocation(line: 90, column: 46, scope: !543)
!577 = !DILocation(line: 90, column: 65, scope: !543)
!578 = !DILocation(line: 91, column: 45, scope: !543)
!579 = !DILocation(line: 91, column: 63, scope: !543)
!580 = !DILocation(line: 96, column: 6, scope: !543)
!581 = distinct !DISubprogram(name: "read_byte", linkageName: "_ZN11miniz_oxide7inflate13output_buffer12InputWrapper9read_byte17h0377e7ab1821234fE", scope: !583, file: !582, line: 89, type: !587, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !98, declaration: !601, retainedNodes: !602)
!582 = !DIFile(filename: "src/inflate/output_buffer.rs", directory: "/Users/namse/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/miniz_oxide-0.8.9", checksumkind: CSK_MD5, checksum: "585e61c7bc6213f67a79d1eae2f1c770")
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "InputWrapper", scope: !584, file: !5, size: 64, align: 32, flags: DIFlagPublic, elements: !585, templateParams: !98, identifier: "82ced5c3f57a0689c456d93b75b417f")
!584 = !DINamespace(name: "output_buffer", scope: !25)
!585 = !{!586}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !583, file: !5, baseType: !485, size: 64, align: 32, flags: DIFlagPrivate)
!587 = !DISubroutineType(types: !588)
!588 = !{!589, !600}
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u8>", scope: !92, file: !5, size: 16, align: 8, flags: DIFlagPublic, elements: !590, templateParams: !98, identifier: "774a7bc235a763e0d0602fde53630227")
!590 = !{!591}
!591 = !DICompositeType(tag: DW_TAG_variant_part, scope: !589, file: !5, size: 16, align: 8, elements: !592, templateParams: !98, identifier: "d47ebcdec53ff1e1fc7d394cf5e1672d", discriminator: !599)
!592 = !{!593, !595}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !591, file: !5, baseType: !594, size: 16, align: 8, extraData: i8 0)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !589, file: !5, size: 16, align: 8, flags: DIFlagPublic, elements: !98, templateParams: !287, identifier: "84a45d26f79ed4caa31bc5af2c53fbf4")
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !591, file: !5, baseType: !596, size: 16, align: 8, extraData: i8 1)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !589, file: !5, size: 16, align: 8, flags: DIFlagPublic, elements: !597, templateParams: !287, identifier: "9d7bb1b003ae84b64da48c86aa454b4")
!597 = !{!598}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !596, file: !5, baseType: !37, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!599 = !DIDerivedType(tag: DW_TAG_member, scope: !589, file: !5, baseType: !37, size: 8, align: 8, flags: DIFlagArtificial)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut miniz_oxide::inflate::output_buffer::InputWrapper", baseType: !583, size: 32, align: 32, dwarfAddressSpace: 0)
!601 = !DISubprogram(name: "read_byte", linkageName: "_ZN11miniz_oxide7inflate13output_buffer12InputWrapper9read_byte17h0377e7ab1821234fE", scope: !583, file: !582, line: 89, type: !587, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !98)
!602 = !{!603}
!603 = !DILocalVariable(name: "self", arg: 1, scope: !581, file: !582, line: 89, type: !600)
!604 = !DILocation(line: 89, column: 22, scope: !581)
!605 = !DILocation(line: 90, column: 9, scope: !581)
!606 = !DILocation(line: 90, column: 20, scope: !581)
!607 = !DILocation(line: 90, column: 28, scope: !581)
!608 = !DILocation(line: 94, column: 6, scope: !581)
!609 = distinct !DISubprogram(name: "{closure#0}", linkageName: "_ZN11miniz_oxide7inflate13output_buffer12InputWrapper9read_byte28_$u7b$$u7b$closure$u7d$$u7d$17h1ca3d217ad9b632aE", scope: !610, file: !582, line: 90, type: !612, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !98, retainedNodes: !618)
!610 = !DINamespace(name: "read_byte", scope: !611)
!611 = !DINamespace(name: "{impl#1}", scope: !584)
!612 = !DISubroutineType(types: !613)
!613 = !{!37, !614, !617}
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !610, file: !5, size: 32, align: 32, elements: !615, templateParams: !98, identifier: "9344fdfba776cef5164d868fd8c67d23")
!615 = !{!616}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__self", scope: !614, file: !5, baseType: !600, size: 32, align: 32)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !37, size: 32, align: 32, dwarfAddressSpace: 0)
!618 = !{!619, !620}
!619 = !DILocalVariable(name: "n", arg: 2, scope: !609, file: !582, line: 90, type: !617)
!620 = !DILocalVariable(name: "self", scope: !609, file: !582, line: 89, type: !583, align: 32)
!621 = !DILocation(line: 89, column: 27, scope: !609)
!622 = !DILocation(line: 90, column: 33, scope: !609)
!623 = !DILocalVariable(name: "self", arg: 1, scope: !624, file: !582, line: 84, type: !600)
!624 = distinct !DISubprogram(name: "advance", linkageName: "_ZN11miniz_oxide7inflate13output_buffer12InputWrapper7advance17h320972a407d79eb8E", scope: !583, file: !582, line: 84, type: !625, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !98, declaration: !627, retainedNodes: !628)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !600, !158}
!627 = !DISubprogram(name: "advance", linkageName: "_ZN11miniz_oxide7inflate13output_buffer12InputWrapper7advance17h320972a407d79eb8E", scope: !583, file: !582, line: 84, type: !625, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !98)
!628 = !{!623, !629}
!629 = !DILocalVariable(name: "steps", arg: 2, scope: !624, file: !582, line: 84, type: !158)
!630 = !DILocation(line: 84, column: 20, scope: !624, inlinedAt: !631)
!631 = distinct !DILocation(line: 91, column: 18, scope: !609)
!632 = !DILocation(line: 84, column: 31, scope: !624, inlinedAt: !631)
!633 = !DILocation(line: 85, column: 23, scope: !624, inlinedAt: !631)
!634 = !DILocalVariable(name: "self", arg: 1, scope: !635, file: !263, line: 17, type: !485)
!635 = distinct !DISubprogram(name: "index<u8, core::ops::range::RangeFrom<usize>>", linkageName: "_ZN4core5slice5index74_$LT$impl$u20$core..ops..index..Index$LT$I$GT$$u20$for$u20$$u5b$T$u5d$$GT$5index17h7ef3efed14a7a1c5E", scope: !636, file: !263, line: 17, type: !637, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !641, retainedNodes: !639)
!636 = !DINamespace(name: "{impl#0}", scope: !265)
!637 = !DISubroutineType(types: !638)
!638 = !{!485, !485, !351, !354}
!639 = !{!634, !640}
!640 = !DILocalVariable(name: "index", arg: 2, scope: !635, file: !263, line: 17, type: !351)
!641 = !{!288, !642}
!642 = !DITemplateTypeParameter(name: "I", type: !351)
!643 = !DILocation(line: 17, column: 14, scope: !635, inlinedAt: !644)
!644 = distinct !DILocation(line: 85, column: 33, scope: !624, inlinedAt: !631)
!645 = !DILocation(line: 17, column: 21, scope: !635, inlinedAt: !644)
!646 = !DILocation(line: 18, column: 15, scope: !635, inlinedAt: !644)
!647 = !DILocation(line: 85, column: 33, scope: !624, inlinedAt: !631)
!648 = !DILocation(line: 85, column: 9, scope: !624, inlinedAt: !631)
!649 = !DILocation(line: 92, column: 13, scope: !609)
!650 = !DILocation(line: 93, column: 10, scope: !609)
!651 = distinct !DISubprogram(name: "bytes_left", linkageName: "_ZN11miniz_oxide7inflate13output_buffer12OutputBuffer10bytes_left17h846b88ec52df76d0E", scope: !652, file: !582, line: 47, type: !660, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !98, declaration: !663, retainedNodes: !664)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "OutputBuffer", scope: !584, file: !5, size: 96, align: 32, flags: DIFlagPublic, elements: !653, templateParams: !98, identifier: "7164bcb35f65d3656760976cee20e36c")
!653 = !{!654, !659}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !652, file: !5, baseType: !655, size: 64, align: 32, flags: DIFlagPrivate)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [u8]", file: !5, size: 64, align: 32, elements: !656, templateParams: !98, identifier: "bdfeb4840e2373d8742974745efe30b6")
!656 = !{!657, !658}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !655, file: !5, baseType: !366, size: 32, align: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !655, file: !5, baseType: !158, size: 32, align: 32, offset: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !652, file: !5, baseType: !158, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!660 = !DISubroutineType(types: !661)
!661 = !{!158, !662}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&miniz_oxide::inflate::output_buffer::OutputBuffer", baseType: !652, size: 32, align: 32, dwarfAddressSpace: 0)
!663 = !DISubprogram(name: "bytes_left", linkageName: "_ZN11miniz_oxide7inflate13output_buffer12OutputBuffer10bytes_left17h846b88ec52df76d0E", scope: !652, file: !582, line: 47, type: !660, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !98)
!664 = !{!665}
!665 = !DILocalVariable(name: "self", arg: 1, scope: !651, file: !582, line: 47, type: !662)
!666 = !DILocation(line: 47, column: 29, scope: !651)
!667 = !DILocation(line: 48, column: 9, scope: !651)
!668 = !DILocation(line: 48, column: 28, scope: !651)
!669 = !DILocation(line: 49, column: 6, scope: !651)
!670 = distinct !DISubprogram(name: "write_byte", linkageName: "_ZN11miniz_oxide7inflate13output_buffer12OutputBuffer10write_byte17hd03d530c461b3a30E", scope: !652, file: !582, line: 31, type: !671, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !98, declaration: !674, retainedNodes: !675)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !673, !37}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut miniz_oxide::inflate::output_buffer::OutputBuffer", baseType: !652, size: 32, align: 32, dwarfAddressSpace: 0)
!674 = !DISubprogram(name: "write_byte", linkageName: "_ZN11miniz_oxide7inflate13output_buffer12OutputBuffer10write_byte17hd03d530c461b3a30E", scope: !652, file: !582, line: 31, type: !671, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !98)
!675 = !{!676, !677}
!676 = !DILocalVariable(name: "self", arg: 1, scope: !670, file: !582, line: 31, type: !673)
!677 = !DILocalVariable(name: "byte", arg: 2, scope: !670, file: !582, line: 31, type: !37)
!678 = !DILocation(line: 31, column: 23, scope: !670)
!679 = !DILocation(line: 31, column: 34, scope: !670)
!680 = !DILocation(line: 32, column: 20, scope: !670)
!681 = !DILocation(line: 32, column: 9, scope: !670)
!682 = !DILocation(line: 33, column: 9, scope: !670)
!683 = !DILocation(line: 34, column: 6, scope: !670)
!684 = distinct !DISubprogram(name: "write_slice", linkageName: "_ZN11miniz_oxide7inflate13output_buffer12OutputBuffer11write_slice17haa1dbbd03040dff4E", scope: !652, file: !582, line: 40, type: !685, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !98, declaration: !687, retainedNodes: !688)
!685 = !DISubroutineType(types: !686)
!686 = !{null, !673, !485}
!687 = !DISubprogram(name: "write_slice", linkageName: "_ZN11miniz_oxide7inflate13output_buffer12OutputBuffer11write_slice17haa1dbbd03040dff4E", scope: !652, file: !582, line: 40, type: !685, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !98)
!688 = !{!689, !690, !691}
!689 = !DILocalVariable(name: "self", arg: 1, scope: !684, file: !582, line: 40, type: !673)
!690 = !DILocalVariable(name: "data", arg: 2, scope: !684, file: !582, line: 40, type: !485)
!691 = !DILocalVariable(name: "len", scope: !692, file: !582, line: 41, type: !158, align: 32)
!692 = distinct !DILexicalBlock(scope: !684, file: !582, line: 41, column: 9)
!693 = !DILocation(line: 40, column: 24, scope: !684)
!694 = !DILocation(line: 40, column: 35, scope: !684)
!695 = !DILocation(line: 41, column: 19, scope: !684)
!696 = !DILocation(line: 41, column: 13, scope: !692)
!697 = !DILocation(line: 42, column: 9, scope: !692)
!698 = !DILocation(line: 42, column: 20, scope: !692)
!699 = !DILocation(line: 42, column: 35, scope: !692)
!700 = !DILocalVariable(name: "self", arg: 1, scope: !701, file: !263, line: 29, type: !655)
!701 = distinct !DISubprogram(name: "index_mut<u8, core::ops::range::Range<usize>>", linkageName: "_ZN4core5slice5index77_$LT$impl$u20$core..ops..index..IndexMut$LT$I$GT$$u20$for$u20$$u5b$T$u5d$$GT$9index_mut17hce654561117346f3E", scope: !702, file: !263, line: 29, type: !703, scopeLine: 29, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !707, retainedNodes: !705)
!702 = !DINamespace(name: "{impl#1}", scope: !265)
!703 = !DISubroutineType(types: !704)
!704 = !{!655, !655, !295, !354}
!705 = !{!700, !706}
!706 = !DILocalVariable(name: "index", arg: 2, scope: !701, file: !263, line: 29, type: !295)
!707 = !{!288, !708}
!708 = !DITemplateTypeParameter(name: "I", type: !295)
!709 = !DILocation(line: 29, column: 18, scope: !701, inlinedAt: !710)
!710 = distinct !DILocation(line: 42, column: 19, scope: !692)
!711 = !DILocation(line: 29, column: 29, scope: !701, inlinedAt: !710)
!712 = !DILocation(line: 30, column: 15, scope: !701, inlinedAt: !710)
!713 = !DILocation(line: 42, column: 19, scope: !692)
!714 = !DILocation(line: 42, column: 56, scope: !692)
!715 = !DILocation(line: 43, column: 9, scope: !692)
!716 = !DILocation(line: 44, column: 6, scope: !684)
!717 = distinct !DISubprogram(name: "from_slice_and_pos", linkageName: "_ZN11miniz_oxide7inflate13output_buffer12OutputBuffer18from_slice_and_pos17hbd5ae6e2f26ce0abE", scope: !652, file: !582, line: 13, type: !718, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !98, declaration: !720, retainedNodes: !721)
!718 = !DISubroutineType(types: !719)
!719 = !{!652, !655, !158}
!720 = !DISubprogram(name: "from_slice_and_pos", linkageName: "_ZN11miniz_oxide7inflate13output_buffer12OutputBuffer18from_slice_and_pos17hbd5ae6e2f26ce0abE", scope: !652, file: !582, line: 13, type: !718, scopeLine: 13, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !98)
!721 = !{!722, !723}
!722 = !DILocalVariable(name: "slice", arg: 1, scope: !717, file: !582, line: 13, type: !655)
!723 = !DILocalVariable(name: "position", arg: 2, scope: !717, file: !582, line: 13, type: !158)
!724 = !DILocation(line: 13, column: 31, scope: !717)
!725 = !DILocation(line: 13, column: 52, scope: !717)
!726 = !DILocation(line: 14, column: 9, scope: !717)
!727 = !DILocation(line: 15, column: 6, scope: !717)
!728 = distinct !DISubprogram(name: "decompress", linkageName: "_ZN11miniz_oxide7inflate4core10decompress17h5728ab399a716cb3E", scope: !36, file: !729, line: 1358, type: !730, scopeLine: 1358, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1, templateParams: !98, retainedNodes: !789)
!729 = !DIFile(filename: "src/inflate/core.rs", directory: "/Users/namse/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/miniz_oxide-0.8.9", checksumkind: CSK_MD5, checksum: "16675d3fc7bd05238d0c74f164609fe9")
!730 = !DISubroutineType(types: !731)
!731 = !{!732, !737, !485, !655, !158, !108}
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "(miniz_oxide::inflate::TINFLStatus, usize, usize)", file: !5, size: 96, align: 32, elements: !733, templateParams: !98, identifier: "b96570347c7b34de40334f1d7a82faf")
!733 = !{!734, !735, !736}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !732, file: !5, baseType: !24, size: 8, align: 8, offset: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !732, file: !5, baseType: !158, size: 32, align: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !732, file: !5, baseType: !158, size: 32, align: 32, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut miniz_oxide::inflate::core::DecompressorOxide", baseType: !738, size: 32, align: 32, dwarfAddressSpace: 0)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "DecompressorOxide", scope: !36, file: !5, size: 84000, align: 32, flags: DIFlagPublic, elements: !739, templateParams: !98, identifier: "4b1bc68ddc2621557b1fd0d0e71d4dae")
!739 = !{!740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !755, !756, !769, !773, !777, !781, !785}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !738, file: !5, baseType: !35, size: 8, align: 8, offset: 83968, flags: DIFlagPrivate)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "num_bits", scope: !738, file: !5, baseType: !108, size: 32, align: 32, offset: 83456, flags: DIFlagPrivate)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "z_header0", scope: !738, file: !5, baseType: !108, size: 32, align: 32, offset: 83488, flags: DIFlagPrivate)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "z_header1", scope: !738, file: !5, baseType: !108, size: 32, align: 32, offset: 83520, flags: DIFlagPrivate)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "z_adler32", scope: !738, file: !5, baseType: !108, size: 32, align: 32, offset: 83552, flags: DIFlagPrivate)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "finish", scope: !738, file: !5, baseType: !37, size: 8, align: 8, offset: 83792, flags: DIFlagPrivate)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "block_type", scope: !738, file: !5, baseType: !37, size: 8, align: 8, offset: 83800, flags: DIFlagPrivate)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "check_adler32", scope: !738, file: !5, baseType: !108, size: 32, align: 32, offset: 83584, flags: DIFlagPrivate)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !738, file: !5, baseType: !108, size: 32, align: 32, offset: 83616, flags: DIFlagPrivate)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !738, file: !5, baseType: !108, size: 32, align: 32, offset: 83648, flags: DIFlagPrivate)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "num_extra", scope: !738, file: !5, baseType: !37, size: 8, align: 8, offset: 83808, flags: DIFlagPrivate)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "table_sizes", scope: !738, file: !5, baseType: !752, size: 48, align: 16, offset: 83744, flags: DIFlagPrivate)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 48, align: 16, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 3, lowerBound: 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "bit_buf", scope: !738, file: !5, baseType: !108, size: 32, align: 32, offset: 83680, flags: DIFlagPrivate)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "tables", scope: !738, file: !5, baseType: !757, size: 76800, align: 16, offset: 4096, flags: DIFlagPrivate)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 76800, align: 16, elements: !753)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "HuffmanTable", scope: !36, file: !5, size: 25600, align: 16, flags: DIFlagPrivate, elements: !759, templateParams: !98, identifier: "ae72897abfc615a171c7cbfaddbd4bd")
!759 = !{!760, !765}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "look_up", scope: !758, file: !5, baseType: !761, size: 16384, align: 16, flags: DIFlagPublic)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 16384, align: 16, elements: !763)
!762 = !DIBasicType(name: "i16", size: 16, encoding: DW_ATE_signed)
!763 = !{!764}
!764 = !DISubrange(count: 1024, lowerBound: 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !758, file: !5, baseType: !766, size: 9216, align: 16, offset: 16384, flags: DIFlagPublic)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 9216, align: 16, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 576, lowerBound: 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "code_size_literal", scope: !738, file: !5, baseType: !770, size: 2304, align: 8, offset: 80896, flags: DIFlagPrivate)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 2304, align: 8, elements: !771)
!771 = !{!772}
!772 = !DISubrange(count: 288, lowerBound: 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "code_size_dist", scope: !738, file: !5, baseType: !774, size: 256, align: 8, offset: 83200, flags: DIFlagPrivate)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 256, align: 8, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 32, lowerBound: 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "code_size_huffman", scope: !738, file: !5, baseType: !778, size: 152, align: 8, offset: 83816, flags: DIFlagPrivate)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 152, align: 8, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 19, lowerBound: 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "raw_header", scope: !738, file: !5, baseType: !782, size: 32, align: 8, offset: 83712, flags: DIFlagPrivate)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 32, align: 8, elements: !783)
!783 = !{!784}
!784 = !DISubrange(count: 4, lowerBound: 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "len_codes", scope: !738, file: !5, baseType: !786, size: 4096, align: 8, flags: DIFlagPrivate)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 4096, align: 8, elements: !787)
!787 = !{!788}
!788 = !DISubrange(count: 512, lowerBound: 0)
!789 = !{!790, !791, !792, !793, !794, !795, !797, !799, !801, !803, !812, !814, !816, !818, !820, !822, !824, !826, !828, !830, !832, !834, !836, !838, !840, !842, !844, !846, !848, !850, !852, !854, !856, !858, !860, !862, !864, !866, !868, !870, !872, !874, !876, !878, !880, !882, !884, !886, !888, !890, !892, !894, !896, !897, !899, !900, !902, !903, !905, !907, !909, !911, !913, !915, !917, !919, !921, !923, !925, !927, !929, !931, !933, !935, !937, !939, !941, !943, !945, !947, !949, !951, !953, !955, !957, !962, !963, !966, !968, !970, !972, !974, !976, !978}
!790 = !DILocalVariable(name: "r", arg: 1, scope: !728, file: !729, line: 1359, type: !737)
!791 = !DILocalVariable(name: "in_buf", arg: 2, scope: !728, file: !729, line: 1360, type: !485)
!792 = !DILocalVariable(name: "out", arg: 3, scope: !728, file: !729, line: 1361, type: !655)
!793 = !DILocalVariable(name: "out_pos", arg: 4, scope: !728, file: !729, line: 1362, type: !158)
!794 = !DILocalVariable(name: "flags", arg: 5, scope: !728, file: !729, line: 1363, type: !108)
!795 = !DILocalVariable(name: "out_buf_size_mask", scope: !796, file: !729, line: 1365, type: !158, align: 32)
!796 = distinct !DILexicalBlock(scope: !728, file: !729, line: 1365, column: 5)
!797 = !DILocalVariable(name: "in_iter", scope: !798, file: !729, line: 1382, type: !583, align: 32)
!798 = distinct !DILexicalBlock(scope: !796, file: !729, line: 1382, column: 5)
!799 = !DILocalVariable(name: "state", scope: !800, file: !729, line: 1384, type: !35, align: 8)
!800 = distinct !DILexicalBlock(scope: !798, file: !729, line: 1384, column: 5)
!801 = !DILocalVariable(name: "out_buf", scope: !802, file: !729, line: 1386, type: !652, align: 32)
!802 = distinct !DILexicalBlock(scope: !800, file: !729, line: 1386, column: 5)
!803 = !DILocalVariable(name: "l", scope: !804, file: !729, line: 1389, type: !805, align: 32)
!804 = distinct !DILexicalBlock(scope: !802, file: !729, line: 1389, column: 5)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "LocalVars", scope: !36, file: !5, size: 160, align: 32, flags: DIFlagPrivate, elements: !806, templateParams: !98, identifier: "9e08b4365cf390df23bc9c295b0f4b05")
!806 = !{!807, !808, !809, !810, !811}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "bit_buf", scope: !805, file: !5, baseType: !108, size: 32, align: 32, flags: DIFlagPublic)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "num_bits", scope: !805, file: !5, baseType: !108, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !805, file: !5, baseType: !108, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !805, file: !5, baseType: !108, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "num_extra", scope: !805, file: !5, baseType: !37, size: 8, align: 8, offset: 128, flags: DIFlagPublic)
!812 = !DILocalVariable(name: "status", scope: !813, file: !729, line: 1397, type: !24, align: 8)
!813 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1397, column: 5)
!814 = !DILocalVariable(name: "new_state", scope: !815, file: !729, line: 1012, type: !35, align: 8)
!815 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!816 = !DILocalVariable(name: "result", scope: !817, file: !729, line: 1016, type: !24, align: 8)
!817 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!818 = !DILocalVariable(name: "new_state", scope: !819, file: !729, line: 1012, type: !35, align: 8)
!819 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!820 = !DILocalVariable(name: "result", scope: !821, file: !729, line: 1016, type: !24, align: 8)
!821 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!822 = !DILocalVariable(name: "new_state", scope: !823, file: !729, line: 1012, type: !35, align: 8)
!823 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!824 = !DILocalVariable(name: "result", scope: !825, file: !729, line: 1016, type: !24, align: 8)
!825 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!826 = !DILocalVariable(name: "new_state", scope: !827, file: !729, line: 1012, type: !35, align: 8)
!827 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!828 = !DILocalVariable(name: "result", scope: !829, file: !729, line: 1016, type: !24, align: 8)
!829 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!830 = !DILocalVariable(name: "new_state", scope: !831, file: !729, line: 1012, type: !35, align: 8)
!831 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!832 = !DILocalVariable(name: "result", scope: !833, file: !729, line: 1016, type: !24, align: 8)
!833 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!834 = !DILocalVariable(name: "length", scope: !835, file: !729, line: 1480, type: !105, align: 16)
!835 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1480, column: 21)
!836 = !DILocalVariable(name: "check", scope: !837, file: !729, line: 1481, type: !105, align: 16)
!837 = distinct !DILexicalBlock(scope: !835, file: !729, line: 1481, column: 21)
!838 = !DILocalVariable(name: "valid", scope: !839, file: !729, line: 1482, type: !176, align: 8)
!839 = distinct !DILexicalBlock(scope: !837, file: !729, line: 1482, column: 21)
!840 = !DILocalVariable(name: "new_state", scope: !841, file: !729, line: 1012, type: !35, align: 8)
!841 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!842 = !DILocalVariable(name: "result", scope: !843, file: !729, line: 1016, type: !24, align: 8)
!843 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!844 = !DILocalVariable(name: "new_state", scope: !845, file: !729, line: 1012, type: !35, align: 8)
!845 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!846 = !DILocalVariable(name: "result", scope: !847, file: !729, line: 1016, type: !24, align: 8)
!847 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!848 = !DILocalVariable(name: "new_state", scope: !849, file: !729, line: 1012, type: !35, align: 8)
!849 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!850 = !DILocalVariable(name: "result", scope: !851, file: !729, line: 1016, type: !24, align: 8)
!851 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!852 = !DILocalVariable(name: "new_state", scope: !853, file: !729, line: 1012, type: !35, align: 8)
!853 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!854 = !DILocalVariable(name: "result", scope: !855, file: !729, line: 1016, type: !24, align: 8)
!855 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!856 = !DILocalVariable(name: "space_left", scope: !857, file: !729, line: 1543, type: !158, align: 32)
!857 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1543, column: 21)
!858 = !DILocalVariable(name: "bytes_to_copy", scope: !859, file: !729, line: 1544, type: !158, align: 32)
!859 = distinct !DILexicalBlock(scope: !857, file: !729, line: 1544, column: 21)
!860 = !DILocalVariable(name: "new_state", scope: !861, file: !729, line: 1012, type: !35, align: 8)
!861 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!862 = !DILocalVariable(name: "result", scope: !863, file: !729, line: 1016, type: !24, align: 8)
!863 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!864 = !DILocalVariable(name: "num_bits", scope: !865, file: !729, line: 1563, type: !108, align: 32)
!865 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1563, column: 21)
!866 = !DILocalVariable(name: "new_state", scope: !867, file: !729, line: 1012, type: !35, align: 8)
!867 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!868 = !DILocalVariable(name: "result", scope: !869, file: !729, line: 1016, type: !24, align: 8)
!869 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!870 = !DILocalVariable(name: "new_state", scope: !871, file: !729, line: 1012, type: !35, align: 8)
!871 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!872 = !DILocalVariable(name: "result", scope: !873, file: !729, line: 1016, type: !24, align: 8)
!873 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!874 = !DILocalVariable(name: "dist_table_start", scope: !875, file: !729, line: 1633, type: !158, align: 32)
!875 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1633, column: 21)
!876 = !DILocalVariable(name: "dist_table_end", scope: !877, file: !729, line: 1635, type: !158, align: 32)
!877 = distinct !DILexicalBlock(scope: !875, file: !729, line: 1635, column: 21)
!878 = !DILocalVariable(name: "code_size_dist_end", scope: !879, file: !729, line: 1637, type: !158, align: 32)
!879 = distinct !DILexicalBlock(scope: !877, file: !729, line: 1637, column: 21)
!880 = !DILocalVariable(name: "dist_table_start", scope: !881, file: !729, line: 1640, type: !158, align: 32)
!881 = distinct !DILexicalBlock(scope: !879, file: !729, line: 1640, column: 21)
!882 = !DILocalVariable(name: "dist_table_end", scope: !883, file: !729, line: 1641, type: !158, align: 32)
!883 = distinct !DILexicalBlock(scope: !881, file: !729, line: 1641, column: 21)
!884 = !DILocalVariable(name: "new_state", scope: !885, file: !729, line: 1012, type: !35, align: 8)
!885 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!886 = !DILocalVariable(name: "result", scope: !887, file: !729, line: 1016, type: !24, align: 8)
!887 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!888 = !DILocalVariable(name: "num_extra", scope: !889, file: !729, line: 1651, type: !108, align: 32)
!889 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1651, column: 17)
!890 = !DILocalVariable(name: "new_state", scope: !891, file: !729, line: 1012, type: !35, align: 8)
!891 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!892 = !DILocalVariable(name: "result", scope: !893, file: !729, line: 1016, type: !24, align: 8)
!893 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!894 = !DILocalVariable(name: "status", scope: !895, file: !729, line: 1697, type: !24, align: 8)
!895 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1697, column: 21)
!896 = !DILocalVariable(name: "new_state", scope: !895, file: !729, line: 1697, type: !35, align: 8)
!897 = !DILocalVariable(name: "symbol", scope: !898, file: !729, line: 1715, type: !7, align: 32)
!898 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1715, column: 21)
!899 = !DILocalVariable(name: "code_len", scope: !898, file: !729, line: 1715, type: !108, align: 32)
!900 = !DILocalVariable(name: "symbol", scope: !901, file: !729, line: 1731, type: !7, align: 32)
!901 = distinct !DILexicalBlock(scope: !898, file: !729, line: 1731, column: 25)
!902 = !DILocalVariable(name: "code_len", scope: !901, file: !729, line: 1731, type: !108, align: 32)
!903 = !DILocalVariable(name: "new_state", scope: !904, file: !729, line: 1012, type: !35, align: 8)
!904 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!905 = !DILocalVariable(name: "result", scope: !906, file: !729, line: 1016, type: !24, align: 8)
!906 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!907 = !DILocalVariable(name: "new_state", scope: !908, file: !729, line: 1012, type: !35, align: 8)
!908 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!909 = !DILocalVariable(name: "result", scope: !910, file: !729, line: 1016, type: !24, align: 8)
!910 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!911 = !DILocalVariable(name: "new_state", scope: !912, file: !729, line: 1012, type: !35, align: 8)
!912 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!913 = !DILocalVariable(name: "result", scope: !914, file: !729, line: 1016, type: !24, align: 8)
!914 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!915 = !DILocalVariable(name: "num_extra", scope: !916, file: !729, line: 1795, type: !108, align: 32)
!916 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1795, column: 17)
!917 = !DILocalVariable(name: "new_state", scope: !918, file: !729, line: 1012, type: !35, align: 8)
!918 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!919 = !DILocalVariable(name: "result", scope: !920, file: !729, line: 1016, type: !24, align: 8)
!920 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!921 = !DILocalVariable(name: "new_state", scope: !922, file: !729, line: 1012, type: !35, align: 8)
!922 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!923 = !DILocalVariable(name: "result", scope: !924, file: !729, line: 1016, type: !24, align: 8)
!924 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!925 = !DILocalVariable(name: "num_extra", scope: !926, file: !729, line: 1829, type: !108, align: 32)
!926 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1829, column: 17)
!927 = !DILocalVariable(name: "new_state", scope: !928, file: !729, line: 1012, type: !35, align: 8)
!928 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!929 = !DILocalVariable(name: "result", scope: !930, file: !729, line: 1016, type: !24, align: 8)
!930 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!931 = !DILocalVariable(name: "out_pos", scope: !932, file: !729, line: 1844, type: !158, align: 32)
!932 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1844, column: 21)
!933 = !DILocalVariable(name: "source_pos", scope: !934, file: !729, line: 1845, type: !158, align: 32)
!934 = distinct !DILexicalBlock(scope: !932, file: !729, line: 1845, column: 21)
!935 = !DILocalVariable(name: "out_len", scope: !936, file: !729, line: 1848, type: !158, align: 32)
!936 = distinct !DILexicalBlock(scope: !934, file: !729, line: 1848, column: 21)
!937 = !DILocalVariable(name: "match_end_pos", scope: !938, file: !729, line: 1849, type: !158, align: 32)
!938 = distinct !DILexicalBlock(scope: !936, file: !729, line: 1849, column: 21)
!939 = !DILocalVariable(name: "new_state", scope: !940, file: !729, line: 1012, type: !35, align: 8)
!940 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!941 = !DILocalVariable(name: "result", scope: !942, file: !729, line: 1016, type: !24, align: 8)
!942 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!943 = !DILocalVariable(name: "out_pos", scope: !944, file: !729, line: 1879, type: !158, align: 32)
!944 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1879, column: 21)
!945 = !DILocalVariable(name: "source_pos", scope: !946, file: !729, line: 1880, type: !158, align: 32)
!946 = distinct !DILexicalBlock(scope: !944, file: !729, line: 1880, column: 21)
!947 = !DILocalVariable(name: "len", scope: !948, file: !729, line: 1884, type: !158, align: 32)
!948 = distinct !DILexicalBlock(scope: !946, file: !729, line: 1884, column: 21)
!949 = !DILocalVariable(name: "new_state", scope: !950, file: !729, line: 1012, type: !35, align: 8)
!950 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!951 = !DILocalVariable(name: "result", scope: !952, file: !729, line: 1016, type: !24, align: 8)
!952 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!953 = !DILocalVariable(name: "in_consumed", scope: !954, file: !729, line: 1905, type: !158, align: 32)
!954 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1905, column: 21)
!955 = !DILocalVariable(name: "undo", scope: !956, file: !729, line: 1906, type: !158, align: 32)
!956 = distinct !DILexicalBlock(scope: !954, file: !729, line: 1906, column: 21)
!957 = !DILocalVariable(name: "left_val", scope: !958, file: !729, line: 1910, type: !961, align: 32)
!958 = !DILexicalBlockFile(scope: !959, file: !729, discriminator: 0)
!959 = distinct !DILexicalBlock(scope: !956, file: !960, line: 45, column: 13)
!960 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/macros/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "ec901dc314d42500d18c9938d02d4ad0")
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !108, size: 32, align: 32, dwarfAddressSpace: 0)
!962 = !DILocalVariable(name: "right_val", scope: !958, file: !729, line: 1910, type: !961, align: 32)
!963 = !DILocalVariable(name: "kind", scope: !964, file: !729, line: 1910, type: !74, align: 8)
!964 = !DILexicalBlockFile(scope: !965, file: !729, discriminator: 0)
!965 = distinct !DILexicalBlock(scope: !959, file: !960, line: 47, column: 21)
!966 = !DILocalVariable(name: "new_state", scope: !967, file: !729, line: 1012, type: !35, align: 8)
!967 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!968 = !DILocalVariable(name: "result", scope: !969, file: !729, line: 1016, type: !24, align: 8)
!969 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!970 = !DILocalVariable(name: "new_state", scope: !971, file: !729, line: 1012, type: !35, align: 8)
!971 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1012, column: 17)
!972 = !DILocalVariable(name: "result", scope: !973, file: !729, line: 1016, type: !24, align: 8)
!973 = distinct !DILexicalBlock(scope: !804, file: !729, line: 1016, column: 17)
!974 = !DILocalVariable(name: "in_undo", scope: !975, file: !729, line: 1966, type: !158, align: 32)
!975 = distinct !DILexicalBlock(scope: !813, file: !729, line: 1966, column: 5)
!976 = !DILocalVariable(name: "need_adler", scope: !977, file: !729, line: 2001, type: !176, align: 8)
!977 = distinct !DILexicalBlock(scope: !975, file: !729, line: 2001, column: 5)
!978 = !DILocalVariable(name: "out_buf_pos", scope: !979, file: !729, line: 2008, type: !158, align: 32)
!979 = distinct !DILexicalBlock(scope: !977, file: !729, line: 2008, column: 9)
!980 = !DILocation(line: 1359, column: 5, scope: !728)
!981 = !DILocation(line: 1360, column: 5, scope: !728)
!982 = !DILocation(line: 1361, column: 5, scope: !728)
!983 = !DILocation(line: 1362, column: 5, scope: !728)
!984 = !DILocation(line: 1363, column: 5, scope: !728)
!985 = !DILocation(line: 1365, column: 9, scope: !796)
!986 = !DILocation(line: 1382, column: 9, scope: !798)
!987 = !DILocation(line: 1384, column: 9, scope: !800)
!988 = !DILocation(line: 1386, column: 9, scope: !802)
!989 = !DILocation(line: 1389, column: 9, scope: !804)
!990 = !DILocation(line: 1397, column: 9, scope: !813)
!991 = !DILocation(line: 1697, column: 26, scope: !895)
!992 = !DILocation(line: 1966, column: 9, scope: !975)
!993 = !DILocation(line: 2001, column: 9, scope: !977)
!994 = !DILocation(line: 1365, column: 32, scope: !728)
!995 = !DILocalVariable(name: "self", arg: 1, scope: !996, file: !997, line: 2191, type: !158)
!996 = distinct !DISubprogram(name: "saturating_sub", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$14saturating_sub17h2d08798150a08418E", scope: !998, file: !997, line: 2191, type: !1000, scopeLine: 2191, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !98, retainedNodes: !1002)
!997 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/num/uint_macros.rs", directory: "", checksumkind: CSK_MD5, checksum: "5be88be11ad076a5d1229d10f045d3e0")
!998 = !DINamespace(name: "{impl#11}", scope: !999)
!999 = !DINamespace(name: "num", scope: !76)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!158, !158, !158}
!1002 = !{!995, !1003}
!1003 = !DILocalVariable(name: "rhs", arg: 2, scope: !996, file: !997, line: 2191, type: !158)
!1004 = !DILocation(line: 2191, column: 37, scope: !996, inlinedAt: !1005)
!1005 = distinct !DILocation(line: 1371, column: 19, scope: !728)
!1006 = !DILocation(line: 2191, column: 43, scope: !996, inlinedAt: !1005)
!1007 = !DILocation(line: 2192, column: 13, scope: !996, inlinedAt: !1005)
!1008 = !DILocation(line: 1371, column: 19, scope: !728)
!1009 = !DILocation(line: 1366, column: 9, scope: !728)
!1010 = !DILocation(line: 1365, column: 29, scope: !728)
!1011 = !DILocation(line: 1378, column: 9, scope: !796)
!1012 = !DILocalVariable(name: "self", arg: 1, scope: !1013, file: !997, line: 2302, type: !158)
!1013 = distinct !DISubprogram(name: "wrapping_add", linkageName: "_ZN4core3num23_$LT$impl$u20$usize$GT$12wrapping_add17hbe427153f7d9beb6E", scope: !998, file: !997, line: 2302, type: !1000, scopeLine: 2302, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !98, retainedNodes: !1014)
!1014 = !{!1012, !1015}
!1015 = !DILocalVariable(name: "rhs", arg: 2, scope: !1013, file: !997, line: 2302, type: !158)
!1016 = !DILocation(line: 2302, column: 35, scope: !1013, inlinedAt: !1017)
!1017 = distinct !DILocation(line: 1378, column: 27, scope: !796)
!1018 = !DILocation(line: 2302, column: 41, scope: !1013, inlinedAt: !1017)
!1019 = !DILocation(line: 2303, column: 13, scope: !1013, inlinedAt: !1017)
!1020 = !DILocation(line: 1378, column: 45, scope: !796)
!1021 = !DILocation(line: 1378, column: 8, scope: !796)
!1022 = !DILocation(line: 1378, column: 72, scope: !796)
!1023 = !DILocation(line: 1379, column: 16, scope: !796)
!1024 = !DILocation(line: 2029, column: 2, scope: !728)
!1025 = !DILocalVariable(name: "slice", arg: 1, scope: !1026, file: !582, line: 79, type: !485)
!1026 = distinct !DISubprogram(name: "from_slice", linkageName: "_ZN11miniz_oxide7inflate13output_buffer12InputWrapper10from_slice17h53cc25d70825cf92E", scope: !583, file: !582, line: 79, type: !1027, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !98, declaration: !1029, retainedNodes: !1030)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!583, !485}
!1029 = !DISubprogram(name: "from_slice", linkageName: "_ZN11miniz_oxide7inflate13output_buffer12InputWrapper10from_slice17h53cc25d70825cf92E", scope: !583, file: !582, line: 79, type: !1027, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !98)
!1030 = !{!1025}
!1031 = !DILocation(line: 79, column: 29, scope: !1026, inlinedAt: !1032)
!1032 = distinct !DILocation(line: 1382, column: 23, scope: !796)
!1033 = !DILocation(line: 81, column: 6, scope: !1026, inlinedAt: !1032)
!1034 = !DILocation(line: 1382, column: 23, scope: !796)
!1035 = !DILocation(line: 1384, column: 21, scope: !798)
!1036 = !DILocation(line: 1386, column: 23, scope: !800)
!1037 = !DILocation(line: 1390, column: 18, scope: !802)
!1038 = !DILocation(line: 1391, column: 19, scope: !802)
!1039 = !DILocation(line: 1392, column: 15, scope: !802)
!1040 = !DILocation(line: 1393, column: 18, scope: !802)
!1041 = !DILocation(line: 1394, column: 20, scope: !802)
!1042 = !DILocation(line: 1389, column: 17, scope: !802)
!1043 = !DILocation(line: 1397, column: 22, scope: !804)
!1044 = !DILocation(line: 1398, column: 15, scope: !804)
!1045 = !DILocation(line: 1398, column: 9, scope: !804)
!1046 = !DILocation(line: 1962, column: 24, scope: !804)
!1047 = !DILocation(line: 1962, column: 18, scope: !804)
!1048 = !DILocation(line: 1400, column: 17, scope: !804)
!1049 = !DILocation(line: 1401, column: 17, scope: !804)
!1050 = !DILocation(line: 1402, column: 17, scope: !804)
!1051 = !DILocation(line: 1403, column: 17, scope: !804)
!1052 = !DILocation(line: 1404, column: 17, scope: !804)
!1053 = !DILocation(line: 1405, column: 17, scope: !804)
!1054 = !DILocation(line: 1406, column: 17, scope: !804)
!1055 = !DILocation(line: 1407, column: 17, scope: !804)
!1056 = !DILocation(line: 1408, column: 17, scope: !804)
!1057 = !DILocation(line: 1409, column: 20, scope: !804)
!1058 = !DILocation(line: 1417, column: 48, scope: !804)
!1059 = !DILocation(line: 1417, column: 17, scope: !804)
!1060 = !DILocation(line: 1416, column: 67, scope: !804)
!1061 = !DILocation(line: 1010, column: 13, scope: !804)
!1062 = !DILocation(line: 1424, column: 48, scope: !804)
!1063 = !DILocation(line: 1424, column: 17, scope: !804)
!1064 = !DILocation(line: 1423, column: 67, scope: !804)
!1065 = !DILocation(line: 1432, column: 17, scope: !804)
!1066 = !DILocation(line: 1431, column: 71, scope: !804)
!1067 = !DILocation(line: 1453, column: 17, scope: !804)
!1068 = !DILocation(line: 1452, column: 78, scope: !804)
!1069 = !DILocation(line: 1461, column: 20, scope: !804)
!1070 = !DILocation(line: 1529, column: 20, scope: !804)
!1071 = !DILocalVariable(name: "self", arg: 1, scope: !1072, file: !582, line: 108, type: !1075)
!1072 = distinct !DISubprogram(name: "bytes_left", linkageName: "_ZN11miniz_oxide7inflate13output_buffer12InputWrapper10bytes_left17h535d89e1935ad677E", scope: !583, file: !582, line: 108, type: !1073, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1, templateParams: !98, declaration: !1076, retainedNodes: !1077)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!158, !1075}
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&miniz_oxide::inflate::output_buffer::InputWrapper", baseType: !583, size: 32, align: 32, dwarfAddressSpace: 0)
!1076 = !DISubprogram(name: "bytes_left", linkageName: "_ZN11miniz_oxide7inflate13output_buffer12InputWrapper10bytes_left17h535d89e1935ad677E", scope: !583, file: !582, line: 108, type: !1073, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !98)
!1077 = !{!1071}
!1078 = !DILocation(line: 108, column: 29, scope: !1072, inlinedAt: !1079)
!1079 = distinct !DILocation(line: 1539, column: 28, scope: !804)
