; ModuleID = 'wasi.476d268f7a32d6a5-cgu.0'
source_filename = "wasi.476d268f7a32d6a5-cgu.0"
target datalayout = "e-m:e-p:32:32-p10:8:8-p20:8:8-i64:64-i128:128-n32:64-S128-ni:1:10:20"
target triple = "wasm32-unknown-wasi"

%"core::fmt::rt::Argument<'_>" = type { %"core::fmt::rt::ArgumentType<'_>" }
%"core::fmt::rt::ArgumentType<'_>" = type { ptr, [1 x i32] }

@alloc_ed8641ebea8e5515740d4eb49a916ff5 = private unnamed_addr constant [218 x i8] c"unsafe precondition(s) violated: ptr::read requires that the pointer argument is aligned and non-null\0A\0AThis indicates a bug in the program. This Undefined Behavior check is optional, and cannot be relied on for safety.", align 1
@alloc_75fb06c2453febd814e73f5f2e72ae38 = private unnamed_addr constant [199 x i8] c"unsafe precondition(s) violated: hint::unreachable_unchecked must never be reached\0A\0AThis indicates a bug in the program. This Undefined Behavior check is optional, and cannot be relied on for safety.", align 1
@alloc_86a8c10f7fc85c93d1bc5807d3c512ac = private unnamed_addr constant [122 x i8] c"/Users/namse/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/wasi-0.11.1+wasi-snapshot-preview1/src/lib_generated.rs\00", align 1
@alloc_67e747fb881d0fb15b51613bd08b794b = private unnamed_addr constant <{ ptr, [12 x i8] }> <{ ptr @alloc_86a8c10f7fc85c93d1bc5807d3c512ac, [12 x i8] c"y\00\00\00M\06\00\00\11\00\00\00" }>, align 4
@alloc_c6ac80460b9305d5066a706b621b8266 = private unnamed_addr constant [3 x i8] c"DIR", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<u16 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u16 as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !13, identifier: "fffaff872192bedf9b7c17461b85f2e2")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 32, align: 32)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 32, align: 32, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!9 = !DIBasicType(name: "usize", size: 32, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!12 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!13 = !{}
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "<&str as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !16, isLocal: true, isDefinition: true)
!16 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&str as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !17, vtableHolder: !22, templateParams: !13, identifier: "4c72bea2c43ff6a7f7303943d2ccbafe")
!17 = !{!18, !19, !20, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !16, file: !2, baseType: !6, size: 32, align: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !16, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !16, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !16, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!22 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 64, align: 32, elements: !23, templateParams: !13, identifier: "9277eecd40495f85161460476aacc992")
!23 = !{!24, !27}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !22, file: !2, baseType: !25, size: 32, align: 32)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32, align: 32, dwarfAddressSpace: 0)
!26 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !22, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "<u8 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !30, isLocal: true, isDefinition: true)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u8 as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !31, vtableHolder: !26, templateParams: !13, identifier: "c612a2affee42820c5ff622205e5f9de")
!31 = !{!32, !33, !34, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !30, file: !2, baseType: !6, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !30, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !30, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !30, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "<u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !38, isLocal: true, isDefinition: true)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !39, vtableHolder: !44, templateParams: !13, identifier: "19c70b5ae051baee956e0e118b17cd59")
!39 = !{!40, !41, !42, !43}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !38, file: !2, baseType: !6, size: 32, align: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !38, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !38, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !38, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!44 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!45 = !{!"rustc version 1.92.0-nightly (6380899f3 2025-10-18)"}
!46 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !47, producer: "clang LLVM (rustc version 1.92.0-nightly (6380899f3 2025-10-18))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !48, splitDebugInlining: false, nameTableKind: None)
!47 = !DIFile(filename: "/Users/namse/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/wasi-0.11.1+wasi-snapshot-preview1/src/lib.rs/@/wasi.476d268f7a32d6a5-cgu.0", directory: "/Users/namse/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/wasi-0.11.1+wasi-snapshot-preview1")
!48 = !{!0, !14, !28, !36}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num49_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u8$GT$3fmt17h923b7f36013e4d7dE", scope: !53, file: !52, line: 85, type: !57, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !98)
!52 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "14f1acdd980d957a36bf4243cc704071")
!53 = !DINamespace(name: "{impl#58}", scope: !54)
!54 = !DINamespace(name: "num", scope: !55)
!55 = !DINamespace(name: "fmt", scope: !56)
!56 = !DINamespace(name: "core", scope: null)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !77, !78}
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !60, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !61, templateParams: !13, identifier: "613ace46ae0c395d39c31f05d3934750")
!60 = !DINamespace(name: "result", scope: !56)
!61 = !{!62}
!62 = !DICompositeType(tag: DW_TAG_variant_part, scope: !59, file: !2, size: 8, align: 8, elements: !63, templateParams: !13, identifier: "2bd67c77928327a5a86e1d970227dbc3", discriminator: !76)
!63 = !{!64, !72}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !62, file: !2, baseType: !65, size: 8, align: 8, extraData: i8 0)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !59, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !66, templateParams: !68, identifier: "8e1fa5ea2cd8f77479a16f216aa53a42")
!66 = !{!67}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !65, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!68 = !{!69, !70}
!69 = !DITemplateTypeParameter(name: "T", type: !7)
!70 = !DITemplateTypeParameter(name: "E", type: !71)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !55, file: !2, align: 8, flags: DIFlagPublic, elements: !13, identifier: "cac4d2a6635a122844ffbe3b52a15933")
!72 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !62, file: !2, baseType: !73, size: 8, align: 8, extraData: i8 1)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !59, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !74, templateParams: !68, identifier: "bd8eb8fbb58ca24e2467a7f35c864471")
!74 = !{!75}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !73, file: !2, baseType: !71, align: 8, offset: 8, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, scope: !59, file: !2, baseType: !26, size: 8, align: 8, flags: DIFlagArtificial)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !26, size: 32, align: 32, dwarfAddressSpace: 0)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !79, size: 32, align: 32, dwarfAddressSpace: 0)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !55, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !80, templateParams: !13, identifier: "9c19c8ef0b5ae3cad350e741e841742c")
!80 = !{!81, !87}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !79, file: !2, baseType: !82, size: 64, align: 32, offset: 64, flags: DIFlagPrivate)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormattingOptions", scope: !55, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !83, templateParams: !13, identifier: "8e7d20540a73fe2190308d0618721e3e")
!83 = !{!84, !85, !86}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !82, file: !2, baseType: !44, size: 32, align: 32, flags: DIFlagPrivate)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !82, file: !2, baseType: !12, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !82, file: !2, baseType: !12, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !79, file: !2, baseType: !88, size: 64, align: 32, flags: DIFlagPrivate)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 64, align: 32, elements: !89, templateParams: !13, identifier: "ed1fc41b72305de4afb5dbb44887680d")
!89 = !{!90, !93}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !88, file: !2, baseType: !91, size: 32, align: 32)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 32, align: 32, dwarfAddressSpace: 0)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !13, identifier: "3bd7022d6bc7a1bba9386a42dfa7db9d")
!93 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !88, file: !2, baseType: !94, size: 32, align: 32, offset: 32)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 6]", baseType: !95, size: 32, align: 32, dwarfAddressSpace: 0)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 32, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 6, lowerBound: 0)
!98 = !{!99, !100}
!99 = !DILocalVariable(name: "self", arg: 1, scope: !51, file: !52, line: 85, type: !77)
!100 = !DILocalVariable(name: "f", arg: 2, scope: !51, file: !52, line: 85, type: !78)
!101 = !DILocation(line: 85, column: 24, scope: !51)
!102 = !DILocation(line: 85, column: 31, scope: !51)
!103 = !DILocation(line: 86, column: 26, scope: !51)
!104 = !DILocation(line: 86, column: 24, scope: !51)
!105 = !DILocation(line: 88, column: 33, scope: !51)
!106 = !DILocation(line: 88, column: 31, scope: !51)
!107 = !DILocation(line: 87, column: 25, scope: !51)
!108 = !DILocation(line: 91, column: 25, scope: !51)
!109 = !DILocation(line: 89, column: 25, scope: !51)
!110 = !DILocation(line: 93, column: 18, scope: !51)
!111 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u16$GT$3fmt17hc63df5a2f7a3da02E", scope: !112, file: !52, line: 85, type: !113, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !116)
!112 = !DINamespace(name: "{impl#59}", scope: !54)
!113 = !DISubroutineType(types: !114)
!114 = !{!59, !115, !78}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u16", baseType: !12, size: 32, align: 32, dwarfAddressSpace: 0)
!116 = !{!117, !118}
!117 = !DILocalVariable(name: "self", arg: 1, scope: !111, file: !52, line: 85, type: !115)
!118 = !DILocalVariable(name: "f", arg: 2, scope: !111, file: !52, line: 85, type: !78)
!119 = !DILocation(line: 85, column: 24, scope: !111)
!120 = !DILocation(line: 85, column: 31, scope: !111)
!121 = !DILocation(line: 86, column: 26, scope: !111)
!122 = !DILocation(line: 86, column: 24, scope: !111)
!123 = !DILocation(line: 88, column: 33, scope: !111)
!124 = !DILocation(line: 88, column: 31, scope: !111)
!125 = !DILocation(line: 87, column: 25, scope: !111)
!126 = !DILocation(line: 91, column: 25, scope: !111)
!127 = !DILocation(line: 89, column: 25, scope: !111)
!128 = !DILocation(line: 93, column: 18, scope: !111)
!129 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u32$GT$3fmt17hfbd5c8efd222f376E", scope: !130, file: !52, line: 85, type: !131, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !134)
!130 = !DINamespace(name: "{impl#60}", scope: !54)
!131 = !DISubroutineType(types: !132)
!132 = !{!59, !133, !78}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !44, size: 32, align: 32, dwarfAddressSpace: 0)
!134 = !{!135, !136}
!135 = !DILocalVariable(name: "self", arg: 1, scope: !129, file: !52, line: 85, type: !133)
!136 = !DILocalVariable(name: "f", arg: 2, scope: !129, file: !52, line: 85, type: !78)
!137 = !DILocation(line: 85, column: 24, scope: !129)
!138 = !DILocation(line: 85, column: 31, scope: !129)
!139 = !DILocation(line: 86, column: 26, scope: !129)
!140 = !DILocation(line: 86, column: 24, scope: !129)
!141 = !DILocation(line: 88, column: 33, scope: !129)
!142 = !DILocation(line: 88, column: 31, scope: !129)
!143 = !DILocation(line: 87, column: 25, scope: !129)
!144 = !DILocation(line: 91, column: 25, scope: !129)
!145 = !DILocation(line: 89, column: 25, scope: !129)
!146 = !DILocation(line: 93, column: 18, scope: !129)
!147 = distinct !DISubprogram(name: "as_statically_known_str", linkageName: "_ZN4core3fmt9Arguments23as_statically_known_str17h4ba4e91277018bdbE", scope: !149, file: !148, line: 717, type: !237, scopeLine: 717, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !13, declaration: !253, retainedNodes: !254)
!148 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "953353698add15f5879168b0ac566843")
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !55, file: !2, size: 192, align: 32, flags: DIFlagPublic, elements: !150, templateParams: !13, identifier: "d691e62b2ee4847c2af32873f04bd10")
!150 = !{!151, !157, !199}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !149, file: !2, baseType: !152, size: 64, align: 32, flags: DIFlagPrivate)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 64, align: 32, elements: !153, templateParams: !13, identifier: "4e66b00a376d6af5b8765440fb2839f")
!153 = !{!154, !156}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !152, file: !2, baseType: !155, size: 32, align: 32)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 32, align: 32, dwarfAddressSpace: 0)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !152, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !149, file: !2, baseType: !158, size: 64, align: 32, offset: 128, flags: DIFlagPrivate)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !159, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !160, templateParams: !13, identifier: "a638667a460b22fe10961f9a2f3202aa")
!159 = !DINamespace(name: "option", scope: !56)
!160 = !{!161}
!161 = !DICompositeType(tag: DW_TAG_variant_part, scope: !158, file: !2, size: 64, align: 32, elements: !162, templateParams: !13, identifier: "29af53ccc7f21f4d5671e352d673889a", discriminator: !198)
!162 = !{!163, !194}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !161, file: !2, baseType: !164, size: 64, align: 32, extraData: i32 0)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !158, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !13, templateParams: !165, identifier: "11ce4f4d10f67887bbe6bf59a521c479")
!165 = !{!166}
!166 = !DITemplateTypeParameter(name: "T", type: !167)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 64, align: 32, elements: !168, templateParams: !13, identifier: "b0485535d7020130e949c24f3fc2aa00")
!168 = !{!169, !193}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !167, file: !2, baseType: !170, size: 32, align: 32)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32, align: 32, dwarfAddressSpace: 0)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !172, file: !2, size: 192, align: 32, flags: DIFlagPublic, elements: !173, templateParams: !13, identifier: "8cb06f9d78dc629c8f52fc3b5544996c")
!172 = !DINamespace(name: "rt", scope: !55)
!173 = !{!174, !175, !176, !192}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !171, file: !2, baseType: !9, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !171, file: !2, baseType: !44, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !171, file: !2, baseType: !177, size: 64, align: 32, flags: DIFlagPublic)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !172, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !178, templateParams: !13, identifier: "2d7772037f5c744e87d41105441784d5")
!178 = !{!179}
!179 = !DICompositeType(tag: DW_TAG_variant_part, scope: !177, file: !2, size: 64, align: 32, elements: !180, templateParams: !13, identifier: "af14687975a61e1ae6bbcdaeb79a8a2", discriminator: !191)
!180 = !{!181, !185, !189}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !179, file: !2, baseType: !182, size: 64, align: 32, extraData: i16 0)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !177, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !183, templateParams: !13, identifier: "da16c9b5356522ffb015c0e99237342e")
!183 = !{!184}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !182, file: !2, baseType: !12, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !179, file: !2, baseType: !186, size: 64, align: 32, extraData: i16 1)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !177, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !187, templateParams: !13, identifier: "8d84b26eccf0f48fe70ea50c79b83fc9")
!187 = !{!188}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !186, file: !2, baseType: !9, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !179, file: !2, baseType: !190, size: 64, align: 32, extraData: i16 2)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !177, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !13, identifier: "e4d910bcc0c2da0048af65cce9b02bdf")
!191 = !DIDerivedType(tag: DW_TAG_member, scope: !177, file: !2, baseType: !12, size: 16, align: 16, flags: DIFlagArtificial)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !171, file: !2, baseType: !177, size: 64, align: 32, offset: 64, flags: DIFlagPublic)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !167, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !161, file: !2, baseType: !195, size: 64, align: 32)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !158, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !196, templateParams: !165, identifier: "b6f59188292a44db7736125146b92cb0")
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !195, file: !2, baseType: !167, size: 64, align: 32, flags: DIFlagPublic)
!198 = !DIDerivedType(tag: DW_TAG_member, scope: !158, file: !2, baseType: !44, size: 32, align: 32, flags: DIFlagArtificial)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !149, file: !2, baseType: !200, size: 64, align: 32, offset: 64, flags: DIFlagPrivate)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !2, size: 64, align: 32, elements: !201, templateParams: !13, identifier: "14634098cacc86d372c43019bc81f26f")
!201 = !{!202, !236}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !200, file: !2, baseType: !203, size: 32, align: 32)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32, align: 32, dwarfAddressSpace: 0)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !172, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !205, templateParams: !13, identifier: "14dca3c1b1040cd8e8db0eaa112c8216")
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !204, file: !2, baseType: !207, size: 64, align: 32, flags: DIFlagPrivate)
!207 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentType", scope: !172, file: !2, size: 64, align: 32, flags: DIFlagPrivate, elements: !208, templateParams: !13, identifier: "fb1492950c21086074bab206592842dc")
!208 = !{!209}
!209 = !DICompositeType(tag: DW_TAG_variant_part, scope: !207, file: !2, size: 64, align: 32, elements: !210, templateParams: !13, identifier: "478e018ae6e38e2110d0d424641ab18", discriminator: !235)
!210 = !{!211, !231}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Placeholder", scope: !209, file: !2, baseType: !212, size: 64, align: 32)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !207, file: !2, size: 64, align: 32, flags: DIFlagPrivate, elements: !213, templateParams: !13, identifier: "59bc7f5c5a99ab4be3c3f06b9190c327")
!213 = !{!214, !221, !225}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !212, file: !2, baseType: !215, size: 32, align: 32, flags: DIFlagPrivate)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !216, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !218, templateParams: !220, identifier: "d9f2bcb64deb934daba9b509aea4a83e")
!216 = !DINamespace(name: "non_null", scope: !217)
!217 = !DINamespace(name: "ptr", scope: !56)
!218 = !{!219}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !215, file: !2, baseType: !6, size: 32, align: 32, flags: DIFlagPrivate)
!220 = !{!69}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !212, file: !2, baseType: !222, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(core::ptr::non_null::NonNull<()>, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !223, size: 32, align: 32, dwarfAddressSpace: 0)
!223 = !DISubroutineType(types: !224)
!224 = !{!59, !215, !78}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_lifetime", scope: !212, file: !2, baseType: !226, align: 8, offset: 64, flags: DIFlagPrivate)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&()>", scope: !227, file: !2, align: 8, flags: DIFlagPublic, elements: !13, templateParams: !228, identifier: "e71ee38df7dbfccdae82d3411c10d5bc")
!227 = !DINamespace(name: "marker", scope: !56)
!228 = !{!229}
!229 = !DITemplateTypeParameter(name: "T", type: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !7, size: 32, align: 32, dwarfAddressSpace: 0)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !209, file: !2, baseType: !232, size: 64, align: 32, extraData: i32 0)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !207, file: !2, size: 64, align: 32, flags: DIFlagPrivate, elements: !233, templateParams: !13, identifier: "bcc61db69ea5777ac138ac099ea396b2")
!233 = !{!234}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !232, file: !2, baseType: !12, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!235 = !DIDerivedType(tag: DW_TAG_member, scope: !207, file: !2, baseType: !44, size: 32, align: 32, flags: DIFlagArtificial)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !200, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!237 = !DISubroutineType(types: !238)
!238 = !{!239, !252}
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&str>", scope: !159, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !240, templateParams: !13, identifier: "70526b74386e3ab1af24a4552995aad0")
!240 = !{!241}
!241 = !DICompositeType(tag: DW_TAG_variant_part, scope: !239, file: !2, size: 64, align: 32, elements: !242, templateParams: !13, identifier: "8075e3d3cbf81a82fddc7ee972736375", discriminator: !251)
!242 = !{!243, !247}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !241, file: !2, baseType: !244, size: 64, align: 32, extraData: i32 0)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !239, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !13, templateParams: !245, identifier: "a2c8c52cbf664b15e04ba33a9d1fb455")
!245 = !{!246}
!246 = !DITemplateTypeParameter(name: "T", type: !22)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !241, file: !2, baseType: !248, size: 64, align: 32)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !239, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !249, templateParams: !245, identifier: "b664394454dbb74539919442d1cb2e90")
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !248, file: !2, baseType: !22, size: 64, align: 32, flags: DIFlagPublic)
!251 = !DIDerivedType(tag: DW_TAG_member, scope: !239, file: !2, baseType: !44, size: 32, align: 32, flags: DIFlagArtificial)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Arguments", baseType: !149, size: 32, align: 32, dwarfAddressSpace: 0)
!253 = !DISubprogram(name: "as_statically_known_str", linkageName: "_ZN4core3fmt9Arguments23as_statically_known_str17h4ba4e91277018bdbE", scope: !149, file: !148, line: 717, type: !237, scopeLine: 717, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !13)
!254 = !{!255, !256}
!255 = !DILocalVariable(name: "self", arg: 1, scope: !147, file: !148, line: 717, type: !252)
!256 = !DILocalVariable(name: "s", scope: !257, file: !148, line: 718, type: !239, align: 32)
!257 = distinct !DILexicalBlock(scope: !147, file: !148, line: 718, column: 9)
!258 = !DILocation(line: 717, column: 36, scope: !147)
!259 = !DILocation(line: 718, column: 13, scope: !257)
!260 = !DILocation(line: 718, column: 22, scope: !147)
!261 = !DILocation(line: 719, column: 56, scope: !257)
!262 = !DILocation(line: 719, column: 12, scope: !257)
!263 = !DILocation(line: 719, column: 80, scope: !257)
!264 = !DILocation(line: 719, column: 9, scope: !257)
!265 = !DILocation(line: 719, column: 69, scope: !257)
!266 = !DILocation(line: 720, column: 6, scope: !147)
!267 = distinct !DISubprogram(name: "as_str", linkageName: "_ZN4core3fmt9Arguments6as_str17h5f43f546cd1c7996E", scope: !149, file: !148, line: 704, type: !237, scopeLine: 704, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !13, declaration: !268, retainedNodes: !269)
!268 = !DISubprogram(name: "as_str", linkageName: "_ZN4core3fmt9Arguments6as_str17h5f43f546cd1c7996E", scope: !149, file: !148, line: 704, type: !237, scopeLine: 704, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !13)
!269 = !{!270, !271}
!270 = !DILocalVariable(name: "self", arg: 1, scope: !267, file: !148, line: 704, type: !252)
!271 = !DILocalVariable(name: "s", scope: !272, file: !148, line: 707, type: !273, align: 32)
!272 = distinct !DILexicalBlock(scope: !267, file: !148, line: 707, column: 13)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !22, size: 32, align: 32, dwarfAddressSpace: 0)
!274 = !DILocation(line: 704, column: 25, scope: !267)
!275 = !DILocation(line: 705, column: 16, scope: !267)
!276 = !DILocation(line: 705, column: 29, scope: !267)
!277 = !DILocation(line: 705, column: 15, scope: !267)
!278 = !DILocation(line: 706, column: 14, scope: !267)
!279 = !DILocation(line: 706, column: 18, scope: !267)
!280 = !DILocation(line: 707, column: 14, scope: !267)
!281 = !DILocation(line: 706, column: 25, scope: !267)
!282 = !DILocation(line: 706, column: 32, scope: !267)
!283 = !DILocation(line: 708, column: 18, scope: !267)
!284 = !DILocation(line: 710, column: 6, scope: !267)
!285 = !DILocation(line: 707, column: 19, scope: !267)
!286 = !DILocation(line: 707, column: 15, scope: !267)
!287 = !DILocation(line: 707, column: 15, scope: !272)
!288 = !DILocation(line: 707, column: 31, scope: !272)
!289 = !DILocation(line: 707, column: 26, scope: !272)
!290 = !DILocation(line: 707, column: 32, scope: !267)
!291 = distinct !DISubprogram(name: "write_fmt", linkageName: "_ZN4core3fmt9Formatter9write_fmt17h5e1a4779fbbec593E", scope: !79, file: !148, line: 1915, type: !292, scopeLine: 1915, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !13, declaration: !294, retainedNodes: !295)
!292 = !DISubroutineType(types: !293)
!293 = !{!59, !78, !149}
!294 = !DISubprogram(name: "write_fmt", linkageName: "_ZN4core3fmt9Formatter9write_fmt17h5e1a4779fbbec593E", scope: !79, file: !148, line: 1915, type: !292, scopeLine: 1915, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !13)
!295 = !{!296, !297, !298}
!296 = !DILocalVariable(name: "self", arg: 1, scope: !291, file: !148, line: 1915, type: !78)
!297 = !DILocalVariable(name: "fmt", arg: 2, scope: !291, file: !148, line: 1915, type: !149)
!298 = !DILocalVariable(name: "s", scope: !299, file: !148, line: 1916, type: !22, align: 32)
!299 = distinct !DILexicalBlock(scope: !291, file: !148, line: 1916, column: 56)
!300 = !DILocation(line: 1915, column: 22, scope: !291)
!301 = !DILocation(line: 1915, column: 33, scope: !291)
!302 = !DILocation(line: 1916, column: 30, scope: !299)
!303 = !DILocation(line: 1916, column: 26, scope: !299)
!304 = !DILocation(line: 1916, column: 16, scope: !299)
!305 = !DILocation(line: 1916, column: 21, scope: !299)
!306 = !DILocation(line: 1917, column: 13, scope: !299)
!307 = !DILocation(line: 1917, column: 22, scope: !299)
!308 = !DILocation(line: 1919, column: 19, scope: !291)
!309 = !DILocation(line: 1919, column: 13, scope: !291)
!310 = !DILocation(line: 1921, column: 6, scope: !291)
!311 = !DILocation(line: 1915, column: 5, scope: !291)
!312 = distinct !DISubprogram(name: "read<u16>", linkageName: "_ZN4core3ptr4read17h188bb76cc8094201E", scope: !217, file: !313, line: 1705, type: !314, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !338, retainedNodes: !336)
!313 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "8857c34524728cc5887872677b8e1917")
!314 = !DISubroutineType(types: !315)
!315 = !{!12, !316, !317}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u16", baseType: !12, size: 32, align: 32, dwarfAddressSpace: 0)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !318, size: 32, align: 32, dwarfAddressSpace: 0)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !319, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !321, templateParams: !13, identifier: "7c34cafe8ea1dcad4032b9360816105f")
!319 = !DINamespace(name: "location", scope: !320)
!320 = !DINamespace(name: "panic", scope: !56)
!321 = !{!322, !332, !333, !334}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !318, file: !2, baseType: !323, size: 64, align: 32, flags: DIFlagPrivate)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<str>", scope: !216, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !324, templateParams: !330, identifier: "88212fc410c4399fd5095990cc8304ca")
!324 = !{!325}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !323, file: !2, baseType: !326, size: 64, align: 32, flags: DIFlagPrivate)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const str", file: !2, size: 64, align: 32, elements: !327, templateParams: !13, identifier: "238a44609877474087c05adf26cd41fa")
!327 = !{!328, !329}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !326, file: !2, baseType: !25, size: 32, align: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !326, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!330 = !{!331}
!331 = !DITemplateTypeParameter(name: "T", type: !26)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !318, file: !2, baseType: !44, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !318, file: !2, baseType: !44, size: 32, align: 32, offset: 96, flags: DIFlagPrivate)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "_filename", scope: !318, file: !2, baseType: !335, align: 8, offset: 128, flags: DIFlagPrivate)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&str>", scope: !227, file: !2, align: 8, flags: DIFlagPublic, elements: !13, templateParams: !245, identifier: "4cfc3eea77dd95eabd59051b67bd7e66")
!336 = !{!337}
!337 = !DILocalVariable(name: "src", arg: 1, scope: !312, file: !313, line: 1705, type: !316)
!338 = !{!339}
!339 = !DITemplateTypeParameter(name: "T", type: !12)
!340 = !DILocation(line: 1705, column: 29, scope: !312)
!341 = !DILocation(line: 77, column: 35, scope: !342)
!342 = !DILexicalBlockFile(scope: !312, file: !343, discriminator: 0)
!343 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/ub_checks.rs", directory: "", checksumkind: CSK_MD5, checksum: "41b3943b2b7dc8c218ee37ead81b317d")
!344 = !DILocation(line: 1744, column: 9, scope: !312)
!345 = !DILocation(line: 1746, column: 2, scope: !312)
!346 = !DILocation(line: 78, column: 17, scope: !342)
!347 = distinct !DISubprogram(name: "read<wasi::lib_generated::Fdstat>", linkageName: "_ZN4core3ptr4read17h28b571f9788304ccE", scope: !217, file: !313, line: 1705, type: !348, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !365, retainedNodes: !363)
!348 = !DISubroutineType(types: !349)
!349 = !{!350, !362, !317}
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "Fdstat", scope: !351, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !353, templateParams: !13, identifier: "e494ba5722f7ff0de34bf1d7151eb2f3")
!351 = !DINamespace(name: "lib_generated", scope: !352)
!352 = !DINamespace(name: "wasi", scope: null)
!353 = !{!354, !358, !359, !361}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "fs_filetype", scope: !350, file: !2, baseType: !355, size: 8, align: 8, flags: DIFlagPublic)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "Filetype", scope: !351, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !356, templateParams: !13, identifier: "24877855dc10e77c2f78d2abc8a35243")
!356 = !{!357}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !355, file: !2, baseType: !26, size: 8, align: 8, flags: DIFlagPrivate)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !350, file: !2, baseType: !12, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "fs_rights_base", scope: !350, file: !2, baseType: !360, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!360 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "fs_rights_inheriting", scope: !350, file: !2, baseType: !360, size: 64, align: 64, offset: 128, flags: DIFlagPublic)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const wasi::lib_generated::Fdstat", baseType: !350, size: 32, align: 32, dwarfAddressSpace: 0)
!363 = !{!364}
!364 = !DILocalVariable(name: "src", arg: 1, scope: !347, file: !313, line: 1705, type: !362)
!365 = !{!366}
!366 = !DITemplateTypeParameter(name: "T", type: !350)
!367 = !DILocation(line: 1705, column: 29, scope: !347)
!368 = !DILocation(line: 77, column: 35, scope: !369)
!369 = !DILexicalBlockFile(scope: !347, file: !343, discriminator: 0)
!370 = !DILocation(line: 1744, column: 9, scope: !347)
!371 = !DILocation(line: 1746, column: 2, scope: !347)
!372 = !DILocation(line: 78, column: 17, scope: !369)
!373 = distinct !DISubprogram(name: "read<u64>", linkageName: "_ZN4core3ptr4read17h487dc6145fad69b1E", scope: !217, file: !313, line: 1705, type: !374, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !379, retainedNodes: !377)
!374 = !DISubroutineType(types: !375)
!375 = !{!360, !376, !317}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u64", baseType: !360, size: 32, align: 32, dwarfAddressSpace: 0)
!377 = !{!378}
!378 = !DILocalVariable(name: "src", arg: 1, scope: !373, file: !313, line: 1705, type: !376)
!379 = !{!380}
!380 = !DITemplateTypeParameter(name: "T", type: !360)
!381 = !DILocation(line: 1705, column: 29, scope: !373)
!382 = !DILocation(line: 77, column: 35, scope: !383)
!383 = !DILexicalBlockFile(scope: !373, file: !343, discriminator: 0)
!384 = !DILocation(line: 1744, column: 9, scope: !373)
!385 = !DILocation(line: 1746, column: 2, scope: !373)
!386 = !DILocation(line: 78, column: 17, scope: !383)
!387 = distinct !DISubprogram(name: "read<wasi::lib_generated::Prestat>", linkageName: "_ZN4core3ptr4read17h58671998979cdf8bE", scope: !217, file: !313, line: 1705, type: !388, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !403, retainedNodes: !401)
!388 = !DISubroutineType(types: !389)
!389 = !{!390, !400, !317}
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "Prestat", scope: !351, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !391, templateParams: !13, identifier: "1a06d4c03dc019c192407bcb1cd592e")
!391 = !{!392, !393}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !390, file: !2, baseType: !26, size: 8, align: 8, flags: DIFlagPublic)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !390, file: !2, baseType: !394, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!394 = !DICompositeType(tag: DW_TAG_union_type, name: "PrestatU", scope: !351, file: !2, size: 32, align: 32, elements: !395, templateParams: !13, identifier: "17f75b084371c9103c355dc9bf61522")
!395 = !{!396}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !394, file: !2, baseType: !397, size: 32, align: 32)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "PrestatDir", scope: !351, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !398, templateParams: !13, identifier: "395615a0667192f93013bba3e153006")
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pr_name_len", scope: !397, file: !2, baseType: !9, size: 32, align: 32, flags: DIFlagPublic)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const wasi::lib_generated::Prestat", baseType: !390, size: 32, align: 32, dwarfAddressSpace: 0)
!401 = !{!402}
!402 = !DILocalVariable(name: "src", arg: 1, scope: !387, file: !313, line: 1705, type: !400)
!403 = !{!404}
!404 = !DITemplateTypeParameter(name: "T", type: !390)
!405 = !DILocation(line: 1705, column: 29, scope: !387)
!406 = !DILocation(line: 77, column: 35, scope: !407)
!407 = !DILexicalBlockFile(scope: !387, file: !343, discriminator: 0)
!408 = !DILocation(line: 1744, column: 9, scope: !387)
!409 = !DILocation(line: 1746, column: 2, scope: !387)
!410 = !DILocation(line: 78, column: 17, scope: !407)
!411 = distinct !DISubprogram(name: "read<wasi::lib_generated::Filestat>", linkageName: "_ZN4core3ptr4read17hc08313af9d479144E", scope: !217, file: !313, line: 1705, type: !412, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !427, retainedNodes: !425)
!412 = !DISubroutineType(types: !413)
!413 = !{!414, !424, !317}
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "Filestat", scope: !351, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !415, templateParams: !13, identifier: "ecc2d135f2b156ff837ac30d7fe012a1")
!415 = !{!416, !417, !418, !419, !420, !421, !422, !423}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !414, file: !2, baseType: !360, size: 64, align: 64, flags: DIFlagPublic)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !414, file: !2, baseType: !360, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !414, file: !2, baseType: !355, size: 8, align: 8, offset: 128, flags: DIFlagPublic)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !414, file: !2, baseType: !360, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !414, file: !2, baseType: !360, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "atim", scope: !414, file: !2, baseType: !360, size: 64, align: 64, offset: 320, flags: DIFlagPublic)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "mtim", scope: !414, file: !2, baseType: !360, size: 64, align: 64, offset: 384, flags: DIFlagPublic)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ctim", scope: !414, file: !2, baseType: !360, size: 64, align: 64, offset: 448, flags: DIFlagPublic)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const wasi::lib_generated::Filestat", baseType: !414, size: 32, align: 32, dwarfAddressSpace: 0)
!425 = !{!426}
!426 = !DILocalVariable(name: "src", arg: 1, scope: !411, file: !313, line: 1705, type: !424)
!427 = !{!428}
!428 = !DITemplateTypeParameter(name: "T", type: !414)
!429 = !DILocation(line: 1705, column: 29, scope: !411)
!430 = !DILocation(line: 77, column: 35, scope: !431)
!431 = !DILexicalBlockFile(scope: !411, file: !343, discriminator: 0)
!432 = !DILocation(line: 1744, column: 9, scope: !411)
!433 = !DILocation(line: 1746, column: 2, scope: !411)
!434 = !DILocation(line: 78, column: 17, scope: !431)
!435 = distinct !DISubprogram(name: "read<u32>", linkageName: "_ZN4core3ptr4read17he4d71e30ba8af448E", scope: !217, file: !313, line: 1705, type: !436, scopeLine: 1705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !441, retainedNodes: !439)
!436 = !DISubroutineType(types: !437)
!437 = !{!44, !438, !317}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u32", baseType: !44, size: 32, align: 32, dwarfAddressSpace: 0)
!439 = !{!440}
!440 = !DILocalVariable(name: "src", arg: 1, scope: !435, file: !313, line: 1705, type: !438)
!441 = !{!442}
!442 = !DITemplateTypeParameter(name: "T", type: !44)
!443 = !DILocation(line: 1705, column: 29, scope: !435)
!444 = !DILocation(line: 77, column: 35, scope: !445)
!445 = !DILexicalBlockFile(scope: !435, file: !343, discriminator: 0)
!446 = !DILocation(line: 1744, column: 9, scope: !435)
!447 = !DILocation(line: 1746, column: 2, scope: !435)
!448 = !DILocation(line: 78, column: 17, scope: !445)
!449 = distinct !DISubprogram(name: "precondition_check", linkageName: "_ZN4core3ptr4read18precondition_check17h1f0d0df461b2cb3fE", scope: !450, file: !343, line: 68, type: !451, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !454)
!450 = !DINamespace(name: "read", scope: !217)
!451 = !DISubroutineType(types: !452)
!452 = !{null, !6, !9, !453, !317}
!453 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!454 = !{!455, !456, !457, !458}
!455 = !DILocalVariable(name: "addr", arg: 1, scope: !449, file: !343, line: 68, type: !6)
!456 = !DILocalVariable(name: "align", arg: 2, scope: !449, file: !343, line: 68, type: !9)
!457 = !DILocalVariable(name: "is_zst", arg: 3, scope: !449, file: !343, line: 68, type: !453)
!458 = !DILocalVariable(name: "msg", scope: !459, file: !343, line: 70, type: !22, align: 32)
!459 = distinct !DILexicalBlock(scope: !449, file: !343, line: 70, column: 21)
!460 = !DILocation(line: 68, column: 43, scope: !449)
!461 = !DILocation(line: 70, column: 25, scope: !459)
!462 = !DILocation(line: 1742, column: 18, scope: !463)
!463 = !DILexicalBlockFile(scope: !449, file: !313, discriminator: 0)
!464 = !DILocation(line: 73, column: 94, scope: !459)
!465 = !DILocation(line: 73, column: 59, scope: !459)
!466 = !DILocation(line: 73, column: 21, scope: !459)
!467 = !DILocation(line: 75, column: 14, scope: !449)
!468 = distinct !DISubprogram(name: "len", linkageName: "_ZN4core3str21_$LT$impl$u20$str$GT$3len17h3af2aaf307a9ee60E", scope: !470, file: !469, line: 141, type: !472, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !474)
!469 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/str/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "361734e74e585b99fb3835c9168d18d7")
!470 = !DINamespace(name: "{impl#0}", scope: !471)
!471 = !DINamespace(name: "str", scope: !56)
!472 = !DISubroutineType(types: !473)
!473 = !{!9, !22}
!474 = !{!475}
!475 = !DILocalVariable(name: "self", arg: 1, scope: !468, file: !469, line: 141, type: !22)
!476 = !DILocation(line: 141, column: 22, scope: !468)
!477 = !DILocalVariable(name: "self", arg: 1, scope: !478, file: !469, line: 486, type: !22)
!478 = distinct !DISubprogram(name: "as_bytes", linkageName: "_ZN4core3str21_$LT$impl$u20$str$GT$8as_bytes17h9707b0eb27d72843E", scope: !470, file: !469, line: 486, type: !479, scopeLine: 486, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !485)
!479 = !DISubroutineType(types: !480)
!480 = !{!481, !22}
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !2, size: 64, align: 32, elements: !482, templateParams: !13, identifier: "31681e0c10b314f1f33e38b2779acbb4")
!482 = !{!483, !484}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !481, file: !2, baseType: !25, size: 32, align: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !481, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!485 = !{!477}
!486 = !DILocation(line: 486, column: 27, scope: !478, inlinedAt: !487)
!487 = distinct !DILocation(line: 142, column: 14, scope: !468)
!488 = !DILocation(line: 489, column: 6, scope: !478, inlinedAt: !487)
!489 = !DILocation(line: 142, column: 14, scope: !468)
!490 = !DILocation(line: 143, column: 6, scope: !468)
!491 = distinct !DISubprogram(name: "unreachable_unchecked", linkageName: "_ZN4core4hint21unreachable_unchecked17h9b3c9dbd75c21290E", scope: !493, file: !492, line: 102, type: !494, scopeLine: 102, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !13)
!492 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "56f659f9cbc57d60ad8ce456b7f06ccb")
!493 = !DINamespace(name: "hint", scope: !56)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !317}
!496 = !DILocation(line: 77, column: 35, scope: !497)
!497 = !DILexicalBlockFile(scope: !491, file: !343, discriminator: 0)
!498 = !DILocation(line: 110, column: 14, scope: !491)
!499 = !DILocation(line: 78, column: 17, scope: !497)
!500 = distinct !DISubprogram(name: "precondition_check", linkageName: "_ZN4core4hint21unreachable_unchecked18precondition_check17ha0410ca2683f1fabE", scope: !501, file: !343, line: 68, type: !494, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !502)
!501 = !DINamespace(name: "unreachable_unchecked", scope: !493)
!502 = !{!503}
!503 = !DILocalVariable(name: "msg", scope: !504, file: !343, line: 70, type: !22, align: 32)
!504 = distinct !DILexicalBlock(scope: !500, file: !343, line: 70, column: 21)
!505 = !DILocation(line: 70, column: 25, scope: !504)
!506 = !DILocation(line: 73, column: 94, scope: !504)
!507 = !DILocation(line: 73, column: 59, scope: !504)
!508 = !DILocation(line: 73, column: 21, scope: !504)
!509 = distinct !DISubprogram(name: "panic_nounwind_fmt", linkageName: "_ZN4core9panicking18panic_nounwind_fmt17h898da05acec7acadE", scope: !511, file: !510, line: 95, type: !512, scopeLine: 95, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !514)
!510 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/panicking.rs", directory: "", checksumkind: CSK_MD5, checksum: "b120da646d1a09f31201b8a519374e57")
!511 = !DINamespace(name: "panicking", scope: !56)
!512 = !DISubroutineType(types: !513)
!513 = !{null, !149, !453, !317}
!514 = !{!515, !516}
!515 = !DILocalVariable(name: "fmt", arg: 1, scope: !509, file: !510, line: 95, type: !149)
!516 = !DILocalVariable(name: "force_no_backtrace", arg: 2, scope: !509, file: !510, line: 95, type: !453)
!517 = !DILocation(line: 95, column: 33, scope: !509)
!518 = !DILocation(line: 95, column: 58, scope: !509)
!519 = !DILocation(line: 2435, column: 27, scope: !520)
!520 = !DILexicalBlockFile(scope: !509, file: !521, discriminator: 0)
!521 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/intrinsics/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "5088527a679dbab229c7a43df7f388f7")
!522 = !DILocation(line: 2435, column: 9, scope: !520)
!523 = distinct !DISubprogram(name: "runtime", linkageName: "_ZN4core9panicking18panic_nounwind_fmt7runtime17h0317e615256657b0E", scope: !524, file: !521, line: 2423, type: !512, scopeLine: 2423, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !525)
!524 = !DINamespace(name: "panic_nounwind_fmt", scope: !511)
!525 = !{!526, !527, !528}
!526 = !DILocalVariable(name: "fmt", arg: 1, scope: !523, file: !521, line: 2423, type: !149)
!527 = !DILocalVariable(name: "force_no_backtrace", arg: 2, scope: !523, file: !521, line: 2423, type: !453)
!528 = !DILocalVariable(name: "pi", scope: !529, file: !510, line: 114, type: !530, align: 32)
!529 = distinct !DILexicalBlock(scope: !523, file: !510, line: 114, column: 13)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "PanicInfo", scope: !531, file: !2, size: 96, align: 32, flags: DIFlagPublic, elements: !532, templateParams: !13, identifier: "74943ad5cfeaa8d7c3439d6f603267a6")
!531 = !DINamespace(name: "panic_info", scope: !320)
!532 = !{!533, !534, !535, !536}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !530, file: !2, baseType: !252, size: 32, align: 32, flags: DIFlagPrivate)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !530, file: !2, baseType: !317, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "can_unwind", scope: !530, file: !2, baseType: !453, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "force_no_backtrace", scope: !530, file: !2, baseType: !453, size: 8, align: 8, offset: 72, flags: DIFlagPrivate)
!537 = !DILocation(line: 2423, column: 40, scope: !523)
!538 = !DILocation(line: 103, column: 17, scope: !539)
!539 = !DILexicalBlockFile(scope: !523, file: !510, discriminator: 0)
!540 = distinct !DISubprogram(name: "maybe_is_aligned", linkageName: "_ZN4core9ub_checks16maybe_is_aligned17haad94b0cc6d1077dE", scope: !541, file: !343, line: 135, type: !542, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !544)
!541 = !DINamespace(name: "ub_checks", scope: !56)
!542 = !DISubroutineType(types: !543)
!543 = !{!453, !6, !9}
!544 = !{!545, !546}
!545 = !DILocalVariable(name: "ptr", arg: 1, scope: !540, file: !343, line: 135, type: !6)
!546 = !DILocalVariable(name: "align", arg: 2, scope: !540, file: !343, line: 135, type: !9)
!547 = !DILocation(line: 135, column: 38, scope: !540)
!548 = !DILocation(line: 135, column: 54, scope: !540)
!549 = !DILocation(line: 2435, column: 9, scope: !550)
!550 = !DILexicalBlockFile(scope: !540, file: !521, discriminator: 0)
!551 = !DILocation(line: 145, column: 2, scope: !540)
!552 = distinct !DISubprogram(name: "runtime", linkageName: "_ZN4core9ub_checks16maybe_is_aligned7runtime17hda16d0ba0b9a56bdE", scope: !553, file: !521, line: 2423, type: !542, scopeLine: 2423, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !554)
!553 = !DINamespace(name: "maybe_is_aligned", scope: !541)
!554 = !{!555, !556}
!555 = !DILocalVariable(name: "ptr", arg: 1, scope: !552, file: !521, line: 2423, type: !6)
!556 = !DILocalVariable(name: "align", arg: 2, scope: !552, file: !521, line: 2423, type: !9)
!557 = !DILocation(line: 2423, column: 40, scope: !552)
!558 = !DILocation(line: 142, column: 17, scope: !559)
!559 = !DILexicalBlockFile(scope: !552, file: !343, discriminator: 0)
!560 = !DILocation(line: 2425, column: 10, scope: !552)
!561 = distinct !DISubprogram(name: "check_language_ub", linkageName: "_ZN4core9ub_checks17check_language_ub17h82985c394737b77cE", scope: !541, file: !343, line: 96, type: !562, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !13)
!562 = !DISubroutineType(types: !563)
!563 = !{!453}
!564 = !DILocation(line: 98, column: 5, scope: !561)
!565 = !DILocation(line: 2435, column: 9, scope: !566)
!566 = !DILexicalBlockFile(scope: !561, file: !521, discriminator: 0)
!567 = !DILocation(line: 109, column: 2, scope: !561)
!568 = distinct !DISubprogram(name: "runtime", linkageName: "_ZN4core9ub_checks17check_language_ub7runtime17h0715ca3a72765d67E", scope: !569, file: !521, line: 2423, type: !562, scopeLine: 2423, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !13)
!569 = !DINamespace(name: "check_language_ub", scope: !541)
!570 = !DILocation(line: 2425, column: 10, scope: !568)
!571 = distinct !DISubprogram(name: "maybe_is_aligned_and_not_null", linkageName: "_ZN4core9ub_checks29maybe_is_aligned_and_not_null17hc491a94493deec50E", scope: !541, file: !343, line: 119, type: !572, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !574)
!572 = !DISubroutineType(types: !573)
!573 = !{!453, !6, !9, !453}
!574 = !{!575, !576, !577}
!575 = !DILocalVariable(name: "ptr", arg: 1, scope: !571, file: !343, line: 120, type: !6)
!576 = !DILocalVariable(name: "align", arg: 2, scope: !571, file: !343, line: 121, type: !9)
!577 = !DILocalVariable(name: "is_zst", arg: 3, scope: !571, file: !343, line: 122, type: !453)
!578 = !DILocation(line: 120, column: 5, scope: !571)
!579 = !DILocation(line: 121, column: 5, scope: !571)
!580 = !DILocation(line: 122, column: 5, scope: !571)
!581 = !DILocation(line: 125, column: 5, scope: !571)
!582 = !DILocation(line: 125, column: 38, scope: !571)
!583 = !DILocation(line: 126, column: 2, scope: !571)
!584 = !DILocation(line: 125, column: 53, scope: !571)
!585 = !DILocation(line: 125, column: 48, scope: !571)
!586 = !DILocation(line: 125, column: 37, scope: !571)
!587 = distinct !DISubprogram(name: "fd_readdir", linkageName: "_ZN4wasi13lib_generated10fd_readdir17h70dd87b0fd008942E", scope: !351, file: !588, line: 1598, type: !589, scopeLine: 1598, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !611)
!588 = !DIFile(filename: "src/lib_generated.rs", directory: "/Users/namse/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/wasi-0.11.1+wasi-snapshot-preview1", checksumkind: CSK_MD5, checksum: "547fc91ba6caf9be070898a050126dd3")
!589 = !DISubroutineType(types: !590)
!590 = !{!591, !44, !610, !9, !360}
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, wasi::lib_generated::Errno>", scope: !60, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !592, templateParams: !13, identifier: "a141799c73d98e9ce0f447a6c3a399c")
!592 = !{!593}
!593 = !DICompositeType(tag: DW_TAG_variant_part, scope: !591, file: !2, size: 64, align: 32, elements: !594, templateParams: !13, identifier: "21f71d73271994a8ced188f0227c710", discriminator: !609)
!594 = !{!595, !605}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !593, file: !2, baseType: !596, size: 64, align: 32, extraData: i16 0)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !591, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !597, templateParams: !599, identifier: "76d15b3d5849a4f59c45609d11ba88f8")
!597 = !{!598}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !596, file: !2, baseType: !9, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!599 = !{!600, !601}
!600 = !DITemplateTypeParameter(name: "T", type: !9)
!601 = !DITemplateTypeParameter(name: "E", type: !602)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "Errno", scope: !351, file: !2, size: 16, align: 16, flags: DIFlagPublic, elements: !603, templateParams: !13, identifier: "9b47191c9dac14bee2941ffcb3885eec")
!603 = !{!604}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !602, file: !2, baseType: !12, size: 16, align: 16, flags: DIFlagPrivate)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !593, file: !2, baseType: !606, size: 64, align: 32, extraData: i16 1)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !591, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !607, templateParams: !599, identifier: "395b16f805d648399b7de2da59fd8ce9")
!607 = !{!608}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !606, file: !2, baseType: !602, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!609 = !DIDerivedType(tag: DW_TAG_member, scope: !591, file: !2, baseType: !12, size: 16, align: 16, flags: DIFlagArtificial)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !26, size: 32, align: 32, dwarfAddressSpace: 0)
!611 = !{!612, !613, !614, !615, !616, !629}
!612 = !DILocalVariable(name: "fd", arg: 1, scope: !587, file: !588, line: 1599, type: !44)
!613 = !DILocalVariable(name: "buf", arg: 2, scope: !587, file: !588, line: 1600, type: !610)
!614 = !DILocalVariable(name: "buf_len", arg: 3, scope: !587, file: !588, line: 1601, type: !9)
!615 = !DILocalVariable(name: "cookie", arg: 4, scope: !587, file: !588, line: 1602, type: !360)
!616 = !DILocalVariable(name: "rp0", scope: !617, file: !588, line: 1604, type: !618, align: 32)
!617 = distinct !DILexicalBlock(scope: !587, file: !588, line: 1604, column: 5)
!618 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<usize>", scope: !619, file: !2, size: 32, align: 32, elements: !621, templateParams: !628, identifier: "b8e0231bd6357640c8ea5a3bfea73185")
!619 = !DINamespace(name: "maybe_uninit", scope: !620)
!620 = !DINamespace(name: "mem", scope: !56)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !618, file: !2, baseType: !7, align: 8)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !618, file: !2, baseType: !624, size: 32, align: 32)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<usize>", scope: !625, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !626, templateParams: !628, identifier: "cc5a7752ecfed6d271e3750e21422ca9")
!625 = !DINamespace(name: "manually_drop", scope: !620)
!626 = !{!627}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !624, file: !2, baseType: !9, size: 32, align: 32, flags: DIFlagPrivate)
!628 = !{!600}
!629 = !DILocalVariable(name: "ret", scope: !630, file: !588, line: 1605, type: !631, align: 32)
!630 = distinct !DILexicalBlock(scope: !617, file: !588, line: 1605, column: 5)
!631 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!632 = !DILocation(line: 1599, column: 5, scope: !587)
!633 = !DILocation(line: 1600, column: 5, scope: !587)
!634 = !DILocation(line: 1601, column: 5, scope: !587)
!635 = !DILocation(line: 1602, column: 5, scope: !587)
!636 = !DILocation(line: 1604, column: 9, scope: !617)
!637 = !DILocation(line: 1604, column: 19, scope: !587)
!638 = !DILocation(line: 1607, column: 9, scope: !617)
!639 = !DILocalVariable(name: "self", arg: 1, scope: !640, file: !641, line: 560, type: !645)
!640 = distinct !DISubprogram(name: "as_mut_ptr<usize>", linkageName: "_ZN4core3mem12maybe_uninit20MaybeUninit$LT$T$GT$10as_mut_ptr17h37c5e939d2090adfE", scope: !618, file: !641, line: 560, type: !642, scopeLine: 560, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !628, declaration: !646, retainedNodes: !647)
!641 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/mem/maybe_uninit.rs", directory: "", checksumkind: CSK_MD5, checksum: "6de2d108794a3cb7d570256a1615f222")
!642 = !DISubroutineType(types: !643)
!643 = !{!644, !645}
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut usize", baseType: !9, size: 32, align: 32, dwarfAddressSpace: 0)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::mem::maybe_uninit::MaybeUninit<usize>", baseType: !618, size: 32, align: 32, dwarfAddressSpace: 0)
!646 = !DISubprogram(name: "as_mut_ptr<usize>", linkageName: "_ZN4core3mem12maybe_uninit20MaybeUninit$LT$T$GT$10as_mut_ptr17h37c5e939d2090adfE", scope: !618, file: !641, line: 560, type: !642, scopeLine: 560, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !628)
!647 = !{!639}
!648 = !DILocation(line: 560, column: 29, scope: !640, inlinedAt: !649)
!649 = distinct !DILocation(line: 1610, column: 13, scope: !617)
!650 = !DILocation(line: 1610, column: 9, scope: !617)
!651 = !DILocation(line: 1605, column: 15, scope: !617)
!652 = !DILocation(line: 1605, column: 9, scope: !630)
!653 = !DILocation(line: 1612, column: 5, scope: !630)
!654 = !DILocation(line: 560, column: 29, scope: !640, inlinedAt: !655)
!655 = distinct !DILocation(line: 1613, column: 37, scope: !630)
!656 = !DILocation(line: 1613, column: 33, scope: !630)
!657 = !DILocation(line: 1613, column: 17, scope: !630)
!658 = !DILocation(line: 1613, column: 14, scope: !630)
!659 = !DILocation(line: 1613, column: 72, scope: !630)
!660 = !DILocation(line: 1614, column: 24, scope: !630)
!661 = !DILocation(line: 1614, column: 14, scope: !630)
!662 = !DILocation(line: 1614, column: 35, scope: !630)
!663 = !DILocation(line: 1616, column: 2, scope: !587)
!664 = distinct !DISubprogram(name: "proc_raise", linkageName: "_ZN4wasi13lib_generated10proc_raise17h7a2e0aeb3b0e2c49E", scope: !351, file: !588, line: 2028, type: !665, scopeLine: 2028, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !684)
!665 = !DISubroutineType(types: !666)
!666 = !{!667, !681}
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), wasi::lib_generated::Errno>", scope: !60, file: !2, size: 32, align: 16, flags: DIFlagPublic, elements: !668, templateParams: !13, identifier: "6609f8701d6c58f07153c01845c109bc")
!668 = !{!669}
!669 = !DICompositeType(tag: DW_TAG_variant_part, scope: !667, file: !2, size: 32, align: 16, elements: !670, templateParams: !13, identifier: "58f8948c7aba808f2158d9e06fc9f4e6", discriminator: !680)
!670 = !{!671, !676}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !669, file: !2, baseType: !672, size: 32, align: 16, extraData: i16 0)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !667, file: !2, size: 32, align: 16, flags: DIFlagPublic, elements: !673, templateParams: !675, identifier: "9a33842f7e0505dfdd150216872198fb")
!673 = !{!674}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !672, file: !2, baseType: !7, align: 8, offset: 16, flags: DIFlagPublic)
!675 = !{!69, !601}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !669, file: !2, baseType: !677, size: 32, align: 16, extraData: i16 1)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !667, file: !2, size: 32, align: 16, flags: DIFlagPublic, elements: !678, templateParams: !675, identifier: "10519c1708c25086ccf5ab779f05f03c")
!678 = !{!679}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !677, file: !2, baseType: !602, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!680 = !DIDerivedType(tag: DW_TAG_member, scope: !667, file: !2, baseType: !12, size: 16, align: 16, flags: DIFlagArtificial)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "Signal", scope: !351, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !682, templateParams: !13, identifier: "21b14c6948fdf80c2ae268fb6ace6e47")
!682 = !{!683}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !681, file: !2, baseType: !26, size: 8, align: 8, flags: DIFlagPrivate)
!684 = !{!685, !686}
!685 = !DILocalVariable(name: "sig", arg: 1, scope: !664, file: !588, line: 2028, type: !681)
!686 = !DILocalVariable(name: "ret", scope: !687, file: !588, line: 2029, type: !631, align: 32)
!687 = distinct !DILexicalBlock(scope: !664, file: !588, line: 2029, column: 5)
!688 = !DILocation(line: 2028, column: 26, scope: !664)
!689 = !DILocation(line: 2029, column: 50, scope: !664)
!690 = !DILocation(line: 2029, column: 15, scope: !664)
!691 = !DILocation(line: 2029, column: 9, scope: !687)
!692 = !DILocation(line: 2030, column: 5, scope: !687)
!693 = !DILocation(line: 2031, column: 14, scope: !687)
!694 = !DILocation(line: 2031, column: 19, scope: !687)
!695 = !DILocation(line: 2032, column: 24, scope: !687)
!696 = !DILocation(line: 2032, column: 14, scope: !687)
!697 = !DILocation(line: 2032, column: 35, scope: !687)
!698 = !DILocation(line: 2034, column: 2, scope: !664)
!699 = distinct !DISubprogram(name: "random_get", linkageName: "_ZN4wasi13lib_generated10random_get17h623dfe08f2cd86edE", scope: !351, file: !588, line: 2056, type: !700, scopeLine: 2056, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !702)
!700 = !DISubroutineType(types: !701)
!701 = !{!667, !610, !9}
!702 = !{!703, !704, !705}
!703 = !DILocalVariable(name: "buf", arg: 1, scope: !699, file: !588, line: 2056, type: !610)
!704 = !DILocalVariable(name: "buf_len", arg: 2, scope: !699, file: !588, line: 2056, type: !9)
!705 = !DILocalVariable(name: "ret", scope: !706, file: !588, line: 2057, type: !631, align: 32)
!706 = distinct !DILexicalBlock(scope: !699, file: !588, line: 2057, column: 5)
!707 = !DILocation(line: 2056, column: 26, scope: !699)
!708 = !DILocation(line: 2056, column: 40, scope: !699)
!709 = !DILocation(line: 2057, column: 50, scope: !699)
!710 = !DILocation(line: 2057, column: 15, scope: !699)
!711 = !DILocation(line: 2057, column: 9, scope: !706)
!712 = !DILocation(line: 2058, column: 5, scope: !706)
!713 = !DILocation(line: 2059, column: 14, scope: !706)
!714 = !DILocation(line: 2059, column: 19, scope: !706)
!715 = !DILocation(line: 2060, column: 24, scope: !706)
!716 = !DILocation(line: 2060, column: 14, scope: !706)
!717 = !DILocation(line: 2060, column: 35, scope: !706)
!718 = !DILocation(line: 2062, column: 2, scope: !699)
!719 = distinct !DISubprogram(name: "raw", linkageName: "_ZN4wasi13lib_generated11Preopentype3raw17h66bac64334fbea7cE", scope: !720, file: !588, line: 1163, type: !723, scopeLine: 1163, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !46, templateParams: !13, declaration: !726, retainedNodes: !727)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "Preopentype", scope: !351, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !721, templateParams: !13, identifier: "610b2c516912183380c929386866152b")
!721 = !{!722}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !720, file: !2, baseType: !26, size: 8, align: 8, flags: DIFlagPrivate)
!723 = !DISubroutineType(types: !724)
!724 = !{!26, !725}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&wasi::lib_generated::Preopentype", baseType: !720, size: 32, align: 32, dwarfAddressSpace: 0)
!726 = !DISubprogram(name: "raw", linkageName: "_ZN4wasi13lib_generated11Preopentype3raw17h66bac64334fbea7cE", scope: !720, file: !588, line: 1163, type: !723, scopeLine: 1163, flags: DIFlagPrototyped, spFlags: 0, templateParams: !13)
!727 = !{!728}
!728 = !DILocalVariable(name: "self", arg: 1, scope: !719, file: !588, line: 1163, type: !725)
!729 = !DILocation(line: 1163, column: 22, scope: !719)
!730 = !DILocation(line: 1164, column: 9, scope: !719)
!731 = !DILocation(line: 1165, column: 6, scope: !719)
!732 = distinct !DISubprogram(name: "name", linkageName: "_ZN4wasi13lib_generated11Preopentype4name17h51a1ca3954e9478cE", scope: !720, file: !588, line: 1167, type: !733, scopeLine: 1167, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !46, templateParams: !13, declaration: !735, retainedNodes: !736)
!733 = !DISubroutineType(types: !734)
!734 = !{!22, !725}
!735 = !DISubprogram(name: "name", linkageName: "_ZN4wasi13lib_generated11Preopentype4name17h51a1ca3954e9478cE", scope: !720, file: !588, line: 1167, type: !733, scopeLine: 1167, flags: DIFlagPrototyped, spFlags: 0, templateParams: !13)
!736 = !{!737}
!737 = !DILocalVariable(name: "self", arg: 1, scope: !732, file: !588, line: 1167, type: !725)
!738 = !DILocation(line: 1167, column: 17, scope: !732)
!739 = !DILocation(line: 1168, column: 9, scope: !732)
!740 = !DILocation(line: 1172, column: 6, scope: !732)
!741 = !DILocation(line: 1170, column: 27, scope: !732)
!742 = distinct !DISubprogram(name: "message", linkageName: "_ZN4wasi13lib_generated11Preopentype7message17ha683a318ca855ec8E", scope: !720, file: !588, line: 1173, type: !733, scopeLine: 1173, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !46, templateParams: !13, declaration: !743, retainedNodes: !744)
!743 = !DISubprogram(name: "message", linkageName: "_ZN4wasi13lib_generated11Preopentype7message17ha683a318ca855ec8E", scope: !720, file: !588, line: 1173, type: !733, scopeLine: 1173, flags: DIFlagPrototyped, spFlags: 0, templateParams: !13)
!744 = !{!745}
!745 = !DILocalVariable(name: "self", arg: 1, scope: !742, file: !588, line: 1173, type: !725)
!746 = !DILocation(line: 1173, column: 20, scope: !742)
!747 = !DILocation(line: 1174, column: 9, scope: !742)
!748 = !DILocation(line: 1178, column: 6, scope: !742)
!749 = !DILocation(line: 1176, column: 27, scope: !742)
!750 = distinct !DISubprogram(name: "environ_get", linkageName: "_ZN4wasi13lib_generated11environ_get17he9729f8c36e4c46eE", scope: !351, file: !588, line: 1242, type: !751, scopeLine: 1242, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !754)
!751 = !DISubroutineType(types: !752)
!752 = !{!667, !753, !610}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut *mut u8", baseType: !610, size: 32, align: 32, dwarfAddressSpace: 0)
!754 = !{!755, !756, !757}
!755 = !DILocalVariable(name: "environ", arg: 1, scope: !750, file: !588, line: 1242, type: !753)
!756 = !DILocalVariable(name: "environ_buf", arg: 2, scope: !750, file: !588, line: 1242, type: !610)
!757 = !DILocalVariable(name: "ret", scope: !758, file: !588, line: 1243, type: !631, align: 32)
!758 = distinct !DILexicalBlock(scope: !750, file: !588, line: 1243, column: 5)
!759 = !DILocation(line: 1242, column: 27, scope: !750)
!760 = !DILocation(line: 1242, column: 50, scope: !750)
!761 = !DILocation(line: 1243, column: 51, scope: !750)
!762 = !DILocation(line: 1243, column: 67, scope: !750)
!763 = !DILocation(line: 1243, column: 15, scope: !750)
!764 = !DILocation(line: 1243, column: 9, scope: !758)
!765 = !DILocation(line: 1244, column: 5, scope: !758)
!766 = !DILocation(line: 1245, column: 14, scope: !758)
!767 = !DILocation(line: 1245, column: 19, scope: !758)
!768 = !DILocation(line: 1246, column: 24, scope: !758)
!769 = !DILocation(line: 1246, column: 14, scope: !758)
!770 = !DILocation(line: 1246, column: 35, scope: !758)
!771 = !DILocation(line: 1248, column: 2, scope: !750)
!772 = distinct !DISubprogram(name: "fd_allocate", linkageName: "_ZN4wasi13lib_generated11fd_allocate17hf95871a71c82ef1eE", scope: !351, file: !588, line: 1344, type: !773, scopeLine: 1344, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !775)
!773 = !DISubroutineType(types: !774)
!774 = !{!667, !44, !360, !360}
!775 = !{!776, !777, !778, !779}
!776 = !DILocalVariable(name: "fd", arg: 1, scope: !772, file: !588, line: 1344, type: !44)
!777 = !DILocalVariable(name: "offset", arg: 2, scope: !772, file: !588, line: 1344, type: !360)
!778 = !DILocalVariable(name: "len", arg: 3, scope: !772, file: !588, line: 1344, type: !360)
!779 = !DILocalVariable(name: "ret", scope: !780, file: !588, line: 1345, type: !631, align: 32)
!780 = distinct !DILexicalBlock(scope: !772, file: !588, line: 1345, column: 5)
!781 = !DILocation(line: 1344, column: 27, scope: !772)
!782 = !DILocation(line: 1344, column: 35, scope: !772)
!783 = !DILocation(line: 1344, column: 53, scope: !772)
!784 = !DILocation(line: 1345, column: 15, scope: !772)
!785 = !DILocation(line: 1345, column: 9, scope: !780)
!786 = !DILocation(line: 1346, column: 5, scope: !780)
!787 = !DILocation(line: 1347, column: 14, scope: !780)
!788 = !DILocation(line: 1347, column: 19, scope: !780)
!789 = !DILocation(line: 1348, column: 24, scope: !780)
!790 = !DILocation(line: 1348, column: 14, scope: !780)
!791 = !DILocation(line: 1348, column: 35, scope: !780)
!792 = !DILocation(line: 1350, column: 2, scope: !772)
!793 = distinct !DISubprogram(name: "fd_datasync", linkageName: "_ZN4wasi13lib_generated11fd_datasync17h896903f285885e8dE", scope: !351, file: !588, line: 1364, type: !794, scopeLine: 1364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !796)
!794 = !DISubroutineType(types: !795)
!795 = !{!667, !44}
!796 = !{!797, !798}
!797 = !DILocalVariable(name: "fd", arg: 1, scope: !793, file: !588, line: 1364, type: !44)
!798 = !DILocalVariable(name: "ret", scope: !799, file: !588, line: 1365, type: !631, align: 32)
!799 = distinct !DILexicalBlock(scope: !793, file: !588, line: 1365, column: 5)
!800 = !DILocation(line: 1364, column: 27, scope: !793)
!801 = !DILocation(line: 1365, column: 15, scope: !793)
!802 = !DILocation(line: 1365, column: 9, scope: !799)
!803 = !DILocation(line: 1366, column: 5, scope: !799)
!804 = !DILocation(line: 1367, column: 14, scope: !799)
!805 = !DILocation(line: 1367, column: 19, scope: !799)
!806 = !DILocation(line: 1368, column: 24, scope: !799)
!807 = !DILocation(line: 1368, column: 14, scope: !799)
!808 = !DILocation(line: 1368, column: 35, scope: !799)
!809 = !DILocation(line: 1370, column: 2, scope: !793)
!810 = distinct !DISubprogram(name: "fd_renumber", linkageName: "_ZN4wasi13lib_generated11fd_renumber17ha35f9110cd723dc5E", scope: !351, file: !588, line: 1630, type: !811, scopeLine: 1630, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !813)
!811 = !DISubroutineType(types: !812)
!812 = !{!667, !44, !44}
!813 = !{!814, !815, !816}
!814 = !DILocalVariable(name: "fd", arg: 1, scope: !810, file: !588, line: 1630, type: !44)
!815 = !DILocalVariable(name: "to", arg: 2, scope: !810, file: !588, line: 1630, type: !44)
!816 = !DILocalVariable(name: "ret", scope: !817, file: !588, line: 1631, type: !631, align: 32)
!817 = distinct !DILexicalBlock(scope: !810, file: !588, line: 1631, column: 5)
!818 = !DILocation(line: 1630, column: 27, scope: !810)
!819 = !DILocation(line: 1630, column: 35, scope: !810)
!820 = !DILocation(line: 1631, column: 15, scope: !810)
!821 = !DILocation(line: 1631, column: 9, scope: !817)
!822 = !DILocation(line: 1632, column: 5, scope: !817)
!823 = !DILocation(line: 1633, column: 14, scope: !817)
!824 = !DILocation(line: 1633, column: 19, scope: !817)
!825 = !DILocation(line: 1634, column: 24, scope: !817)
!826 = !DILocation(line: 1634, column: 14, scope: !817)
!827 = !DILocation(line: 1634, column: 35, scope: !817)
!828 = !DILocation(line: 1636, column: 2, scope: !810)
!829 = distinct !DISubprogram(name: "path_rename", linkageName: "_ZN4wasi13lib_generated11path_rename17hecc7b81cf9ee57abE", scope: !351, file: !588, line: 1927, type: !830, scopeLine: 1927, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !832)
!830 = !DISubroutineType(types: !831)
!831 = !{!667, !44, !22, !44, !22}
!832 = !{!833, !834, !835, !836, !837}
!833 = !DILocalVariable(name: "fd", arg: 1, scope: !829, file: !588, line: 1927, type: !44)
!834 = !DILocalVariable(name: "old_path", arg: 2, scope: !829, file: !588, line: 1927, type: !22)
!835 = !DILocalVariable(name: "new_fd", arg: 3, scope: !829, file: !588, line: 1927, type: !44)
!836 = !DILocalVariable(name: "new_path", arg: 4, scope: !829, file: !588, line: 1927, type: !22)
!837 = !DILocalVariable(name: "ret", scope: !838, file: !588, line: 1928, type: !631, align: 32)
!838 = distinct !DILexicalBlock(scope: !829, file: !588, line: 1928, column: 5)
!839 = !DILocation(line: 1927, column: 27, scope: !829)
!840 = !DILocation(line: 1927, column: 35, scope: !829)
!841 = !DILocation(line: 1927, column: 51, scope: !829)
!842 = !DILocation(line: 1927, column: 63, scope: !829)
!843 = !DILocalVariable(name: "self", arg: 1, scope: !844, file: !469, line: 562, type: !22)
!844 = distinct !DISubprogram(name: "as_ptr", linkageName: "_ZN4core3str21_$LT$impl$u20$str$GT$6as_ptr17h9cdaf2fb3e15fe28E", scope: !470, file: !469, line: 562, type: !845, scopeLine: 562, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !848)
!845 = !DISubroutineType(types: !846)
!846 = !{!847, !22}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !26, size: 32, align: 32, dwarfAddressSpace: 0)
!848 = !{!843}
!849 = !DILocation(line: 562, column: 25, scope: !844, inlinedAt: !850)
!850 = distinct !DILocation(line: 1930, column: 18, scope: !829)
!851 = !DILocation(line: 1930, column: 9, scope: !829)
!852 = !DILocation(line: 1931, column: 18, scope: !829)
!853 = !DILocation(line: 562, column: 25, scope: !844, inlinedAt: !854)
!854 = distinct !DILocation(line: 1933, column: 18, scope: !829)
!855 = !DILocation(line: 1933, column: 9, scope: !829)
!856 = !DILocation(line: 1934, column: 18, scope: !829)
!857 = !DILocation(line: 1928, column: 15, scope: !829)
!858 = !DILocation(line: 1928, column: 9, scope: !838)
!859 = !DILocation(line: 1936, column: 5, scope: !838)
!860 = !DILocation(line: 1937, column: 14, scope: !838)
!861 = !DILocation(line: 1937, column: 19, scope: !838)
!862 = !DILocation(line: 1938, column: 24, scope: !838)
!863 = !DILocation(line: 1938, column: 14, scope: !838)
!864 = !DILocation(line: 1938, column: 35, scope: !838)
!865 = !DILocation(line: 1940, column: 2, scope: !829)
!866 = distinct !DISubprogram(name: "poll_oneoff", linkageName: "_ZN4wasi13lib_generated11poll_oneoff17hb1a91275e741c2fdE", scope: !351, file: !588, line: 1993, type: !867, scopeLine: 1993, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !909)
!867 = !DISubroutineType(types: !868)
!868 = !{!591, !869, !895, !9}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const wasi::lib_generated::Subscription", baseType: !870, size: 32, align: 32, dwarfAddressSpace: 0)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "Subscription", scope: !351, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !871, templateParams: !13, identifier: "8da8c210b66aba2645fb9bd7db578ec8")
!871 = !{!872, !873}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !870, file: !2, baseType: !360, size: 64, align: 64, flags: DIFlagPublic)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !870, file: !2, baseType: !874, size: 320, align: 64, offset: 64, flags: DIFlagPublic)
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "SubscriptionU", scope: !351, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !875, templateParams: !13, identifier: "b603683e2e0919d17609e65d162ccf16")
!875 = !{!876, !877}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !874, file: !2, baseType: !26, size: 8, align: 8, flags: DIFlagPublic)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !874, file: !2, baseType: !878, size: 256, align: 64, offset: 64, flags: DIFlagPublic)
!878 = !DICompositeType(tag: DW_TAG_union_type, name: "SubscriptionUU", scope: !351, file: !2, size: 256, align: 64, elements: !879, templateParams: !13, identifier: "b969325dc869ec8e94bdb44672666040")
!879 = !{!880, !890, !894}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "clock", scope: !878, file: !2, baseType: !881, size: 256, align: 64)
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "SubscriptionClock", scope: !351, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !882, templateParams: !13, identifier: "28a76cae444232a65cdf4ce20628cf9b")
!882 = !{!883, !887, !888, !889}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !881, file: !2, baseType: !884, size: 32, align: 32, flags: DIFlagPublic)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "Clockid", scope: !351, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !885, templateParams: !13, identifier: "402969a54c50692a7a19965fab563a54")
!885 = !{!886}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !884, file: !2, baseType: !44, size: 32, align: 32, flags: DIFlagPrivate)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !881, file: !2, baseType: !360, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !881, file: !2, baseType: !360, size: 64, align: 64, offset: 128, flags: DIFlagPublic)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !881, file: !2, baseType: !12, size: 16, align: 16, offset: 192, flags: DIFlagPublic)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "fd_read", scope: !878, file: !2, baseType: !891, size: 32, align: 32)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "SubscriptionFdReadwrite", scope: !351, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !892, templateParams: !13, identifier: "d490a63562d6df3eb5451158e24fea24")
!892 = !{!893}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "file_descriptor", scope: !891, file: !2, baseType: !44, size: 32, align: 32, flags: DIFlagPublic)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "fd_write", scope: !878, file: !2, baseType: !891, size: 32, align: 32)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut wasi::lib_generated::Event", baseType: !896, size: 32, align: 32, dwarfAddressSpace: 0)
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "Event", scope: !351, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !897, templateParams: !13, identifier: "2c21f2ac42b08edef0df6aab055d94eb")
!897 = !{!898, !899, !900, !904}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !896, file: !2, baseType: !360, size: 64, align: 64, flags: DIFlagPublic)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !896, file: !2, baseType: !602, size: 16, align: 16, offset: 64, flags: DIFlagPublic)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "type_", scope: !896, file: !2, baseType: !901, size: 8, align: 8, offset: 80, flags: DIFlagPublic)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "Eventtype", scope: !351, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !902, templateParams: !13, identifier: "d36064fdb246235c9b3f43a829bd7fc7")
!902 = !{!903}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !901, file: !2, baseType: !26, size: 8, align: 8, flags: DIFlagPrivate)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "fd_readwrite", scope: !896, file: !2, baseType: !905, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "EventFdReadwrite", scope: !351, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !906, templateParams: !13, identifier: "6381a9db7eda7d05f17187494acc08e4")
!906 = !{!907, !908}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "nbytes", scope: !905, file: !2, baseType: !360, size: 64, align: 64, flags: DIFlagPublic)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !905, file: !2, baseType: !12, size: 16, align: 16, offset: 64, flags: DIFlagPublic)
!909 = !{!910, !911, !912, !913, !915}
!910 = !DILocalVariable(name: "in_", arg: 1, scope: !866, file: !588, line: 1994, type: !869)
!911 = !DILocalVariable(name: "out", arg: 2, scope: !866, file: !588, line: 1995, type: !895)
!912 = !DILocalVariable(name: "nsubscriptions", arg: 3, scope: !866, file: !588, line: 1996, type: !9)
!913 = !DILocalVariable(name: "rp0", scope: !914, file: !588, line: 1998, type: !618, align: 32)
!914 = distinct !DILexicalBlock(scope: !866, file: !588, line: 1998, column: 5)
!915 = !DILocalVariable(name: "ret", scope: !916, file: !588, line: 1999, type: !631, align: 32)
!916 = distinct !DILexicalBlock(scope: !914, file: !588, line: 1999, column: 5)
!917 = !DILocation(line: 1994, column: 5, scope: !866)
!918 = !DILocation(line: 1995, column: 5, scope: !866)
!919 = !DILocation(line: 1996, column: 5, scope: !866)
!920 = !DILocation(line: 1998, column: 9, scope: !914)
!921 = !DILocation(line: 1998, column: 19, scope: !866)
!922 = !DILocation(line: 2000, column: 9, scope: !914)
!923 = !DILocation(line: 2001, column: 9, scope: !914)
!924 = !DILocation(line: 560, column: 29, scope: !640, inlinedAt: !925)
!925 = distinct !DILocation(line: 2003, column: 13, scope: !914)
!926 = !DILocation(line: 2003, column: 9, scope: !914)
!927 = !DILocation(line: 1999, column: 15, scope: !914)
!928 = !DILocation(line: 1999, column: 9, scope: !916)
!929 = !DILocation(line: 2005, column: 5, scope: !916)
!930 = !DILocation(line: 560, column: 29, scope: !640, inlinedAt: !931)
!931 = distinct !DILocation(line: 2006, column: 37, scope: !916)
!932 = !DILocation(line: 2006, column: 33, scope: !916)
!933 = !DILocation(line: 2006, column: 17, scope: !916)
!934 = !DILocation(line: 2006, column: 14, scope: !916)
!935 = !DILocation(line: 2006, column: 72, scope: !916)
!936 = !DILocation(line: 2007, column: 24, scope: !916)
!937 = !DILocation(line: 2007, column: 14, scope: !916)
!938 = !DILocation(line: 2007, column: 35, scope: !916)
!939 = !DILocation(line: 2009, column: 2, scope: !866)
!940 = distinct !DISubprogram(name: "sched_yield", linkageName: "_ZN4wasi13lib_generated11sched_yield17h754331c024719597E", scope: !351, file: !588, line: 2038, type: !941, scopeLine: 2038, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !943)
!941 = !DISubroutineType(types: !942)
!942 = !{!667}
!943 = !{!944}
!944 = !DILocalVariable(name: "ret", scope: !945, file: !588, line: 2039, type: !631, align: 32)
!945 = distinct !DILexicalBlock(scope: !940, file: !588, line: 2039, column: 5)
!946 = !DILocation(line: 2039, column: 15, scope: !940)
!947 = !DILocation(line: 2039, column: 9, scope: !945)
!948 = !DILocation(line: 2040, column: 5, scope: !945)
!949 = !DILocation(line: 2041, column: 14, scope: !945)
!950 = !DILocation(line: 2041, column: 19, scope: !945)
!951 = !DILocation(line: 2042, column: 24, scope: !945)
!952 = !DILocation(line: 2042, column: 14, scope: !945)
!953 = !DILocation(line: 2042, column: 35, scope: !945)
!954 = !DILocation(line: 2044, column: 2, scope: !940)
!955 = distinct !DISubprogram(name: "sock_accept", linkageName: "_ZN4wasi13lib_generated11sock_accept17h300d2bf8b4b573d3E", scope: !351, file: !588, line: 2075, type: !956, scopeLine: 2075, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !972)
!956 = !DISubroutineType(types: !957)
!957 = !{!958, !44, !12}
!958 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u32, wasi::lib_generated::Errno>", scope: !60, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !959, templateParams: !13, identifier: "b9f1b5c924c18c3252161cf42a04033e")
!959 = !{!960}
!960 = !DICompositeType(tag: DW_TAG_variant_part, scope: !958, file: !2, size: 64, align: 32, elements: !961, templateParams: !13, identifier: "408e84fd462e51153ab1b6742dc9b442", discriminator: !971)
!961 = !{!962, !967}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !960, file: !2, baseType: !963, size: 64, align: 32, extraData: i16 0)
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !958, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !964, templateParams: !966, identifier: "821bc9d2c37c0e42db97994a40fa8a3a")
!964 = !{!965}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !963, file: !2, baseType: !44, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!966 = !{!442, !601}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !960, file: !2, baseType: !968, size: 64, align: 32, extraData: i16 1)
!968 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !958, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !969, templateParams: !966, identifier: "1d3f41cca37d2241221953e5414f22cc")
!969 = !{!970}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !968, file: !2, baseType: !602, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!971 = !DIDerivedType(tag: DW_TAG_member, scope: !958, file: !2, baseType: !12, size: 16, align: 16, flags: DIFlagArtificial)
!972 = !{!973, !974, !975, !984}
!973 = !DILocalVariable(name: "fd", arg: 1, scope: !955, file: !588, line: 2075, type: !44)
!974 = !DILocalVariable(name: "flags", arg: 2, scope: !955, file: !588, line: 2075, type: !12)
!975 = !DILocalVariable(name: "rp0", scope: !976, file: !588, line: 2076, type: !977, align: 32)
!976 = distinct !DILexicalBlock(scope: !955, file: !588, line: 2076, column: 5)
!977 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<u32>", scope: !619, file: !2, size: 32, align: 32, elements: !978, templateParams: !441, identifier: "52a5877638ce66e2347ecc7dd79ec760")
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !977, file: !2, baseType: !7, align: 8)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !977, file: !2, baseType: !981, size: 32, align: 32)
!981 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<u32>", scope: !625, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !982, templateParams: !441, identifier: "3280d801f801104734b467ad49dc7394")
!982 = !{!983}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !981, file: !2, baseType: !44, size: 32, align: 32, flags: DIFlagPrivate)
!984 = !DILocalVariable(name: "ret", scope: !985, file: !588, line: 2077, type: !631, align: 32)
!985 = distinct !DILexicalBlock(scope: !976, file: !588, line: 2077, column: 5)
!986 = !DILocation(line: 2075, column: 27, scope: !955)
!987 = !DILocation(line: 2075, column: 35, scope: !955)
!988 = !DILocation(line: 2076, column: 9, scope: !976)
!989 = !DILocation(line: 2076, column: 19, scope: !955)
!990 = !DILocation(line: 2077, column: 62, scope: !976)
!991 = !DILocalVariable(name: "self", arg: 1, scope: !992, file: !641, line: 560, type: !996)
!992 = distinct !DISubprogram(name: "as_mut_ptr<u32>", linkageName: "_ZN4core3mem12maybe_uninit20MaybeUninit$LT$T$GT$10as_mut_ptr17h266e1c70e6db7950E", scope: !977, file: !641, line: 560, type: !993, scopeLine: 560, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !46, templateParams: !441, declaration: !997, retainedNodes: !998)
!993 = !DISubroutineType(types: !994)
!994 = !{!995, !996}
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u32", baseType: !44, size: 32, align: 32, dwarfAddressSpace: 0)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::mem::maybe_uninit::MaybeUninit<u32>", baseType: !977, size: 32, align: 32, dwarfAddressSpace: 0)
!997 = !DISubprogram(name: "as_mut_ptr<u32>", linkageName: "_ZN4core3mem12maybe_uninit20MaybeUninit$LT$T$GT$10as_mut_ptr17h266e1c70e6db7950E", scope: !977, file: !641, line: 560, type: !993, scopeLine: 560, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !441)
!998 = !{!991}
!999 = !DILocation(line: 560, column: 29, scope: !992, inlinedAt: !1000)
!1000 = distinct !DILocation(line: 2077, column: 80, scope: !976)
!1001 = !DILocation(line: 2077, column: 76, scope: !976)
!1002 = !DILocation(line: 2077, column: 15, scope: !976)
!1003 = !DILocation(line: 2077, column: 9, scope: !985)
!1004 = !DILocation(line: 2078, column: 5, scope: !985)
!1005 = !DILocation(line: 560, column: 29, scope: !992, inlinedAt: !1006)
!1006 = distinct !DILocation(line: 2079, column: 37, scope: !985)
!1007 = !DILocation(line: 2079, column: 33, scope: !985)
!1008 = !DILocation(line: 2079, column: 17, scope: !985)
!1009 = !DILocation(line: 2079, column: 14, scope: !985)
!1010 = !DILocation(line: 2079, column: 70, scope: !985)
!1011 = !DILocation(line: 2080, column: 24, scope: !985)
!1012 = !DILocation(line: 2080, column: 14, scope: !985)
!1013 = !DILocation(line: 2080, column: 35, scope: !985)
!1014 = !DILocation(line: 2082, column: 2, scope: !955)
!1015 = distinct !DISubprogram(name: "path_symlink", linkageName: "_ZN4wasi13lib_generated12path_symlink17h382523bc6931237dE", scope: !351, file: !588, line: 1949, type: !1016, scopeLine: 1949, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !1018)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!667, !22, !44, !22}
!1018 = !{!1019, !1020, !1021, !1022}
!1019 = !DILocalVariable(name: "old_path", arg: 1, scope: !1015, file: !588, line: 1949, type: !22)
!1020 = !DILocalVariable(name: "fd", arg: 2, scope: !1015, file: !588, line: 1949, type: !44)
!1021 = !DILocalVariable(name: "new_path", arg: 3, scope: !1015, file: !588, line: 1949, type: !22)
!1022 = !DILocalVariable(name: "ret", scope: !1023, file: !588, line: 1950, type: !631, align: 32)
!1023 = distinct !DILexicalBlock(scope: !1015, file: !588, line: 1950, column: 5)
!1024 = !DILocation(line: 1949, column: 28, scope: !1015)
!1025 = !DILocation(line: 1949, column: 44, scope: !1015)
!1026 = !DILocation(line: 1949, column: 52, scope: !1015)
!1027 = !DILocation(line: 562, column: 25, scope: !844, inlinedAt: !1028)
!1028 = distinct !DILocation(line: 1951, column: 18, scope: !1015)
!1029 = !DILocation(line: 1951, column: 9, scope: !1015)
!1030 = !DILocation(line: 1952, column: 18, scope: !1015)
!1031 = !DILocation(line: 562, column: 25, scope: !844, inlinedAt: !1032)
!1032 = distinct !DILocation(line: 1954, column: 18, scope: !1015)
!1033 = !DILocation(line: 1954, column: 9, scope: !1015)
!1034 = !DILocation(line: 1955, column: 18, scope: !1015)
!1035 = !DILocation(line: 1950, column: 15, scope: !1015)
!1036 = !DILocation(line: 1950, column: 9, scope: !1023)
!1037 = !DILocation(line: 1957, column: 5, scope: !1023)
!1038 = !DILocation(line: 1958, column: 14, scope: !1023)
!1039 = !DILocation(line: 1958, column: 19, scope: !1023)
!1040 = !DILocation(line: 1959, column: 24, scope: !1023)
!1041 = !DILocation(line: 1959, column: 14, scope: !1023)
!1042 = !DILocation(line: 1959, column: 35, scope: !1023)
!1043 = !DILocation(line: 1961, column: 2, scope: !1015)
!1044 = distinct !DISubprogram(name: "clock_res_get", linkageName: "_ZN4wasi13lib_generated13clock_res_get17h963bdaa4c47e82c7E", scope: !351, file: !588, line: 1282, type: !1045, scopeLine: 1282, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !46, templateParams: !13, retainedNodes: !1061)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!1047, !884}
!1047 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u64, wasi::lib_generated::Errno>", scope: !60, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !1048, templateParams: !13, identifier: "37c446e14b242af26734d99f94ae6d8f")
!1048 = !{!1049}
!1049 = !DICompositeType(tag: DW_TAG_variant_part, scope: !1047, file: !2, size: 128, align: 64, elements: !1050, templateParams: !13, identifier: "fb99b26091e543d7811729574a73b22e", discriminator: !1060)
!1050 = !{!1051, !1056}
