; ModuleID = 'combined.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-p10:8:8-p20:8:8-i64:64-i128:128-n32:64-S128-ni:1:10:20"
target triple = "wasm32-unknown-wasi"

%"line::LineSequence" = type { %"alloc::boxed::Box<[line::LineRow]>", i64, i64 }
%"alloc::boxed::Box<[line::LineRow]>" = type { %"core::ptr::unique::Unique<[line::LineRow]>", %"core::marker::PhantomData<[line::LineRow]>" }
%"core::ptr::unique::Unique<[line::LineRow]>" = type { %"core::ptr::non_null::NonNull<[line::LineRow]>", %"core::marker::PhantomData<[line::LineRow]>" }
%"core::ptr::non_null::NonNull<[line::LineRow]>" = type { { ptr, i32 } }
%"core::marker::PhantomData<[line::LineRow]>" = type {}
%"line::LineRow" = type { i64, i64, i32, i32 }
%"alloc::string::String" = type { %"alloc::vec::Vec<u8>" }
%"alloc::vec::Vec<u8>" = type { %"alloc::raw_vec::RawVec<u8>", i32 }
%"alloc::raw_vec::RawVec<u8>" = type { %"alloc::raw_vec::RawVecInner", %"core::marker::PhantomData<[line::LineRow]>" }
%"alloc::raw_vec::RawVecInner" = type { i32, ptr, %"core::marker::PhantomData<[line::LineRow]>" }
%"fmt::rt::Argument<'_>" = type { %"fmt::rt::ArgumentType<'_>" }
%"fmt::rt::ArgumentType<'_>" = type { ptr, [1 x i32] }
%"fmt::rt::Placeholder" = type { %"fmt::rt::Count", %"fmt::rt::Count", i32, i32 }
%"fmt::rt::Count" = type { i16, [3 x i16] }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<&usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !13, identifier: "780b51af4c263e5a25cc8e22f3f934fe")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 32, align: 32)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 32, align: 32, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!9 = !DIBasicType(name: "usize", size: 32, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 32, align: 32, dwarfAddressSpace: 0)
!13 = !{}
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "EMPTY_PANIC", linkageName: "_ZN3std9panicking11EMPTY_PANIC17h852b3f8202fddedbE", scope: !16, file: !18, line: 43, type: !19, isLocal: false, isDefinition: true, align: 32)
!16 = !DINamespace(name: "panicking", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !DIFile(filename: "src/panicking.rs", directory: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/std", checksumkind: CSK_MD5, checksum: "7f436085f50083b26797818a677d9a3b")
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&str) -> !", baseType: !20, size: 32, align: 32, dwarfAddressSpace: 0)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !23}
!22 = !DIBasicType(name: "!", encoding: DW_ATE_unsigned)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 64, align: 32, elements: !24, templateParams: !13, identifier: "9277eecd40495f85161460476aacc992")
!24 = !{!25, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !23, file: !2, baseType: !26, size: 32, align: 32)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 32, align: 32, dwarfAddressSpace: 0)
!27 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !23, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!29 = !{!"rustc version 1.92.0-nightly (6380899f3 2025-10-18)"}
!30 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !31, producer: "clang LLVM (rustc version 1.92.0-nightly (6380899f3 2025-10-18))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !32, splitDebugInlining: false, nameTableKind: None)
!31 = !DIFile(filename: "/Users/namse/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/addr2line-0.25.0/src/lib.rs/@/addr2line.34bd539b01166275-cgu.0", directory: "/Users/namse/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/addr2line-0.25.0")
!32 = !{!33}
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !34, file: !2, baseType: !36, size: 8, align: 8, flags: DIFlagEnumClass, elements: !37)
!34 = !DINamespace(name: "cmp", scope: !35)
!35 = !DINamespace(name: "core", scope: null)
!36 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!37 = !{!38, !39, !40}
!38 = !DIEnumerator(name: "Less", value: -1)
!39 = !DIEnumerator(name: "Equal", value: 0)
!40 = !DIEnumerator(name: "Greater", value: 1)
!41 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !42, producer: "clang LLVM (rustc version 1.92.0-nightly (6380899f3 2025-10-18))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!42 = !DIFile(filename: "/Users/namse/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/adler2-2.0.1/src/lib.rs/@/adler2.505ea615d7bd17fe-cgu.0", directory: "/Users/namse/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/adler2-2.0.1")
!43 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !44, producer: "clang LLVM (rustc version 1.92.0-nightly (6380899f3 2025-10-18))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !45, globals: !95, splitDebugInlining: false, nameTableKind: None)
!44 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/alloc/src/lib.rs/@/alloc.ffb8e4d6f182d685-cgu.0", directory: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/alloc")
!45 = !{!46, !83, !89}
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !47, file: !2, baseType: !49, size: 32, align: 32, flags: DIFlagEnumClass, elements: !50)
!47 = !DINamespace(name: "alignment", scope: !48)
!48 = !DINamespace(name: "ptr", scope: !35)
!49 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!50 = !{!51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82}
!51 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!53 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!54 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!55 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!56 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!57 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!58 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!59 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!60 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!61 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!62 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!63 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!64 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!65 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!66 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!67 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!68 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!69 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!70 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!71 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!72 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!73 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!74 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!75 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!76 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!77 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!78 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!79 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!80 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!81 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!82 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !84, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !85)
!84 = !DINamespace(name: "panicking", scope: !35)
!85 = !{!86, !87, !88}
!86 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!87 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!88 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AllocInit", scope: !90, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !92)
!90 = !DINamespace(name: "raw_vec", scope: !91)
!91 = !DINamespace(name: "alloc", scope: null)
!92 = !{!93, !94}
!93 = !DIEnumerator(name: "Uninitialized", value: 0, isUnsigned: true)
!94 = !DIEnumerator(name: "Zeroed", value: 1, isUnsigned: true)
!95 = !{!96, !119, !137, !139, !161, !169, !195, !257, !265, !274, !283, !304}
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "<&core::option::Option<u8> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !98, isLocal: true, isDefinition: true)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::option::Option<u8> as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !99, vtableHolder: !104, templateParams: !13, identifier: "9f0df09829d729154b3434e1eeabff66")
!99 = !{!100, !101, !102, !103}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !98, file: !2, baseType: !6, size: 32, align: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !98, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !98, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !98, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<u8>", baseType: !105, size: 32, align: 32, dwarfAddressSpace: 0)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u8>", scope: !106, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !107, templateParams: !13, identifier: "774a7bc235a763e0d0602fde53630227")
!106 = !DINamespace(name: "option", scope: !35)
!107 = !{!108}
!108 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !105, file: !2, size: 16, align: 8, elements: !109, templateParams: !13, identifier: "d47ebcdec53ff1e1fc7d394cf5e1672d", discriminator: !118)
!109 = !{!110, !114}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !108, file: !2, baseType: !111, size: 16, align: 8, extraData: i8 0)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !105, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !13, templateParams: !112, identifier: "84a45d26f79ed4caa31bc5af2c53fbf4")
!112 = !{!113}
!113 = !DITemplateTypeParameter(name: "T", type: !27)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !108, file: !2, baseType: !115, size: 16, align: 8, extraData: i8 1)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !105, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !116, templateParams: !112, identifier: "9d7bb1b003ae84b64da48c86aa454b4")
!116 = !{!117}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !115, file: !2, baseType: !27, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!118 = !DIDerivedType(tag: DW_TAG_member, scope: !105, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagArtificial)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "<&core::alloc::layout::Layout as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !121, isLocal: true, isDefinition: true)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::alloc::layout::Layout as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !122, vtableHolder: !127, templateParams: !13, identifier: "c9d5aa850a0849e1f28871f15dc8d2f0")
!122 = !{!123, !124, !125, !126}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !121, file: !2, baseType: !6, size: 32, align: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !121, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !121, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !121, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::alloc::layout::Layout", baseType: !128, size: 32, align: 32, dwarfAddressSpace: 0)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Layout", scope: !129, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !131, templateParams: !13, identifier: "f923cc1896f078e51d4a893c36e2e533")
!129 = !DINamespace(name: "layout", scope: !130)
!130 = !DINamespace(name: "alloc", scope: !35)
!131 = !{!132, !133}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !128, file: !2, baseType: !9, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !128, file: !2, baseType: !134, size: 32, align: 32, flags: DIFlagPrivate)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Alignment", scope: !47, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !135, templateParams: !13, identifier: "b8055a5301a867de82116acd8d685318")
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !134, file: !2, baseType: !46, size: 32, align: 32, flags: DIFlagPrivate)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "<&usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "<&core::option::Option<usize> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !141, isLocal: true, isDefinition: true)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::option::Option<usize> as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !142, vtableHolder: !147, templateParams: !13, identifier: "ee2f5a55dac8625b18fb01ac4e683133")
!142 = !{!143, !144, !145, !146}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !141, file: !2, baseType: !6, size: 32, align: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !141, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !141, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !141, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<usize>", baseType: !148, size: 32, align: 32, dwarfAddressSpace: 0)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !106, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !149, templateParams: !13, identifier: "23b42ad4918f48bbb0d7df30a3e65f21")
!149 = !{!150}
!150 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !148, file: !2, size: 64, align: 32, elements: !151, templateParams: !13, identifier: "fff0cc91bd07d4e2a6f41aa96659bb8", discriminator: !160)
!151 = !{!152, !156}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !150, file: !2, baseType: !153, size: 64, align: 32, extraData: i32 0)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !148, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !13, templateParams: !154, identifier: "16f3611ef7370fd7f09fc668dc1c16f8")
!154 = !{!155}
!155 = !DITemplateTypeParameter(name: "T", type: !9)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !150, file: !2, baseType: !157, size: 64, align: 32, extraData: i32 1)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !148, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !158, templateParams: !154, identifier: "9bb7e929a7e81f45f834925bbfee816")
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !157, file: !2, baseType: !9, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!160 = !DIDerivedType(tag: DW_TAG_member, scope: !148, file: !2, baseType: !49, size: 32, align: 32, flags: DIFlagArtificial)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "<&str as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !163, isLocal: true, isDefinition: true)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&str as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !164, vtableHolder: !23, templateParams: !13, identifier: "4c72bea2c43ff6a7f7303943d2ccbafe")
!164 = !{!165, !166, !167, !168}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !163, file: !2, baseType: !6, size: 32, align: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !163, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !163, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !163, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "STATIC_INNER_SLICE", linkageName: "_ZN5alloc4sync18STATIC_INNER_SLICE17h1413d7a909030fefE", scope: !171, file: !172, line: 3579, type: !173, isLocal: false, isDefinition: true, align: 128)
!171 = !DINamespace(name: "sync", scope: !91)
!172 = !DIFile(filename: "src/sync.rs", directory: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/alloc", checksumkind: CSK_MD5, checksum: "754ebdb7cfcdf26f53f7fd06952f3c03")
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SliceArcInnerForStatic", scope: !171, file: !2, size: 128, align: 128, flags: DIFlagPrivate, elements: !174, templateParams: !13, identifier: "5a6e992f2e833e8ac7169ce8b008c0e2")
!174 = !{!175}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !173, file: !2, baseType: !176, size: 96, align: 32, flags: DIFlagPrivate)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<[u8; 1]>", scope: !171, file: !2, size: 96, align: 32, flags: DIFlagPrivate, elements: !177, templateParams: !193, identifier: "981fa6caff1f80ef4f069993b5157a4b")
!177 = !{!178, !188, !189}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !176, file: !2, baseType: !179, size: 32, align: 32, flags: DIFlagPrivate)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !180, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !182, templateParams: !13, identifier: "210fde280431e7a7a2ebb6338b4a928")
!180 = !DINamespace(name: "atomic", scope: !181)
!181 = !DINamespace(name: "sync", scope: !35)
!182 = !{!183}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !179, file: !2, baseType: !184, size: 32, align: 32, flags: DIFlagPrivate)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !185, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !186, templateParams: !154, identifier: "a03bd62ffdb893cb75c512d3055b1e6a")
!185 = !DINamespace(name: "cell", scope: !35)
!186 = !{!187}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !184, file: !2, baseType: !9, size: 32, align: 32, flags: DIFlagPrivate)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !176, file: !2, baseType: !179, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !176, file: !2, baseType: !190, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 8, align: 8, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 1, lowerBound: 0)
!193 = !{!194}
!194 = !DITemplateTypeParameter(name: "T", type: !190)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "<alloc::boxed::convert::{impl#19}::from::StringError as core::error::Error>::{vtable}", scope: null, file: !2, type: !197, isLocal: true, isDefinition: true)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::boxed::convert::{impl#19}::from::StringError as core::error::Error>::{vtable_type}", file: !2, size: 352, align: 32, flags: DIFlagArtificial, elements: !198, vtableHolder: !210, templateParams: !13, identifier: "e82fc57872fb252f86caf66774e9ef75")
!198 = !{!199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !197, file: !2, baseType: !6, size: 32, align: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !197, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !197, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !197, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !197, file: !2, baseType: !6, size: 32, align: 32, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__super_trait_ptr5", scope: !197, file: !2, baseType: !6, size: 32, align: 32, offset: 160)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "__method6", scope: !197, file: !2, baseType: !6, size: 32, align: 32, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__method7", scope: !197, file: !2, baseType: !6, size: 32, align: 32, offset: 224)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__method8", scope: !197, file: !2, baseType: !6, size: 32, align: 32, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__method9", scope: !197, file: !2, baseType: !6, size: 32, align: 32, offset: 288)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__method10", scope: !197, file: !2, baseType: !6, size: 32, align: 32, offset: 320)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StringError", scope: !211, file: !2, size: 96, align: 32, flags: DIFlagProtected, elements: !215, templateParams: !13, identifier: "81e34cbfdf76d4004a86fdb96e59dd73")
!211 = !DINamespace(name: "from", scope: !212)
!212 = !DINamespace(name: "{impl#19}", scope: !213)
!213 = !DINamespace(name: "convert", scope: !214)
!214 = !DINamespace(name: "boxed", scope: !91)
!215 = !{!216}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !210, file: !2, baseType: !217, size: 96, align: 32, flags: DIFlagProtected)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !218, file: !2, size: 96, align: 32, flags: DIFlagPublic, elements: !219, templateParams: !13, identifier: "d25855d4e39c2f43d5832c8c00c297b8")
!218 = !DINamespace(name: "string", scope: !91)
!219 = !{!220}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !217, file: !2, baseType: !221, size: 96, align: 32, flags: DIFlagPrivate)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !222, file: !2, size: 96, align: 32, flags: DIFlagPublic, elements: !223, templateParams: !255, identifier: "690acf9b7a33488c5bae8462c5730502")
!222 = !DINamespace(name: "vec", scope: !91)
!223 = !{!224, !256}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !221, file: !2, baseType: !225, size: 64, align: 32, flags: DIFlagPrivate)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !90, file: !2, size: 64, align: 32, flags: DIFlagProtected, elements: !226, templateParams: !255, identifier: "5236adca4c8bab765515aeb39bd1ce36")
!226 = !{!227, !254}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !225, file: !2, baseType: !228, size: 64, align: 32, flags: DIFlagPrivate)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawVecInner<alloc::alloc::Global>", scope: !90, file: !2, size: 64, align: 32, flags: DIFlagPrivate, elements: !229, templateParams: !252, identifier: "3c40c2e41e15f04db5cfeefb4800bcc4")
!229 = !{!230, !243, !249}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !228, file: !2, baseType: !231, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !232, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !233, templateParams: !112, identifier: "15d8b1b660840b97c8698c417bf66080")
!232 = !DINamespace(name: "unique", scope: !48)
!233 = !{!234, !240}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !231, file: !2, baseType: !235, size: 32, align: 32, flags: DIFlagPrivate)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !236, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !237, templateParams: !112, identifier: "bfbed5a29c49721772982c8bebfc3819")
!236 = !DINamespace(name: "non_null", scope: !48)
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !235, file: !2, baseType: !239, size: 32, align: 32, flags: DIFlagPrivate)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !27, size: 32, align: 32, dwarfAddressSpace: 0)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !231, file: !2, baseType: !241, align: 8, offset: 32, flags: DIFlagPrivate)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !242, file: !2, align: 8, flags: DIFlagPublic, elements: !13, templateParams: !112, identifier: "86f180f8272fce39fed40a1ecf2dfbe2")
!242 = !DINamespace(name: "marker", scope: !35)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !228, file: !2, baseType: !244, size: 32, align: 32, flags: DIFlagPrivate)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UsizeNoHighBit", scope: !245, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !247, templateParams: !13, identifier: "f66b9037a7c573de372fce98f436079c")
!245 = !DINamespace(name: "niche_types", scope: !246)
!246 = !DINamespace(name: "num", scope: !35)
!247 = !{!248}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !244, file: !2, baseType: !9, size: 32, align: 32, flags: DIFlagPrivate)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !228, file: !2, baseType: !250, align: 8, offset: 64, flags: DIFlagPrivate)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !251, file: !2, align: 8, flags: DIFlagPublic, elements: !13, identifier: "8d3dc7eb6b91fe30566bfc073f6fd293")
!251 = !DINamespace(name: "alloc", scope: !91)
!252 = !{!253}
!253 = !DITemplateTypeParameter(name: "A", type: !250)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !225, file: !2, baseType: !241, align: 8, offset: 64, flags: DIFlagPrivate)
!255 = !{!113, !253}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !221, file: !2, baseType: !9, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "<usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !259, isLocal: true, isDefinition: true)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !260, vtableHolder: !9, templateParams: !13, identifier: "d039273444f7fc995c377e8d4c029a3")
!260 = !{!261, !262, !263, !264}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !259, file: !2, baseType: !6, size: 32, align: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !259, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !259, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !259, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "<&core::ptr::alignment::Alignment as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !267, isLocal: true, isDefinition: true)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::ptr::alignment::Alignment as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !268, vtableHolder: !273, templateParams: !13, identifier: "6b1d62126d18356bb460fcdcc638a95e")
!268 = !{!269, !270, !271, !272}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !267, file: !2, baseType: !6, size: 32, align: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !267, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !267, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !267, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::ptr::alignment::Alignment", baseType: !134, size: 32, align: 32, dwarfAddressSpace: 0)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "<&u8 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !276, isLocal: true, isDefinition: true)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&u8 as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !277, vtableHolder: !282, templateParams: !13, identifier: "8ebe3e780ae6181d77c3deff7c4cc1e2")
!277 = !{!278, !279, !280, !281}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !276, file: !2, baseType: !6, size: 32, align: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !276, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !276, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !276, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !27, size: 32, align: 32, dwarfAddressSpace: 0)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "<core::str::error::Utf8Error as core::error::Error>::{vtable}", scope: null, file: !2, type: !285, isLocal: true, isDefinition: true)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<core::str::error::Utf8Error as core::error::Error>::{vtable_type}", file: !2, size: 352, align: 32, flags: DIFlagArtificial, elements: !286, vtableHolder: !298, templateParams: !13, identifier: "487e6a02c2a3ba68d07c46318debb3b6")
!286 = !{!287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !285, file: !2, baseType: !6, size: 32, align: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !285, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !285, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !285, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !285, file: !2, baseType: !6, size: 32, align: 32, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__super_trait_ptr5", scope: !285, file: !2, baseType: !6, size: 32, align: 32, offset: 160)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "__method6", scope: !285, file: !2, baseType: !6, size: 32, align: 32, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__method7", scope: !285, file: !2, baseType: !6, size: 32, align: 32, offset: 224)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__method8", scope: !285, file: !2, baseType: !6, size: 32, align: 32, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "__method9", scope: !285, file: !2, baseType: !6, size: 32, align: 32, offset: 288)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "__method10", scope: !285, file: !2, baseType: !6, size: 32, align: 32, offset: 320)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Utf8Error", scope: !299, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !301, templateParams: !13, identifier: "4b4a5f597602ec9f4778ad8670e72da9")
!299 = !DINamespace(name: "error", scope: !300)
!300 = !DINamespace(name: "str", scope: !35)
!301 = !{!302, !303}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "valid_up_to", scope: !298, file: !2, baseType: !9, size: 32, align: 32, flags: DIFlagProtected)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "error_len", scope: !298, file: !2, baseType: !105, size: 16, align: 8, offset: 32, flags: DIFlagProtected)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "<alloc::string::String as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !306, isLocal: true, isDefinition: true)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::string::String as core::fmt::Write>::{vtable_type}", file: !2, size: 192, align: 32, flags: DIFlagArtificial, elements: !307, vtableHolder: !217, templateParams: !13, identifier: "84bfa180edf17aad9748f510d90e2149")
!307 = !{!308, !309, !310, !311, !312, !313}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !306, file: !2, baseType: !6, size: 32, align: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !306, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !306, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !306, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !306, file: !2, baseType: !6, size: 32, align: 32, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !306, file: !2, baseType: !6, size: 32, align: 32, offset: 160)
!314 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !315, producer: "clang LLVM (rustc version 1.92.0-nightly (6380899f3 2025-10-18))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!315 = !DIFile(filename: "/Users/namse/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/cfg-if-1.0.1/src/lib.rs/@/cfg_if.de3d5bac36d9caa2-cgu.0", directory: "/Users/namse/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/cfg-if-1.0.1")
!316 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !317, producer: "clang LLVM (rustc version 1.92.0-nightly (6380899f3 2025-10-18))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !318, globals: !338, splitDebugInlining: false, nameTableKind: None)
!317 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/compiler-builtins/compiler-builtins/src/lib.rs/@/compiler_builtins.408d4a0b0ac6353-cgu.0", directory: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/compiler-builtins/compiler-builtins")
!318 = !{!319, !330}
!319 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Round", scope: !320, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !325)
!320 = !DINamespace(name: "env", scope: !321)
!321 = !DINamespace(name: "support", scope: !322)
!322 = !DINamespace(name: "libm_math", scope: !323)
!323 = !DINamespace(name: "math", scope: !324)
!324 = !DINamespace(name: "compiler_builtins", scope: null)
!325 = !{!326, !327, !328, !329}
!326 = !DIEnumerator(name: "Nearest", value: 0, isUnsigned: true)
!327 = !DIEnumerator(name: "Negative", value: 1, isUnsigned: true)
!328 = !DIEnumerator(name: "Positive", value: 2, isUnsigned: true)
!329 = !DIEnumerator(name: "Zero", value: 3, isUnsigned: true)
!330 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !331, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !333)
!331 = !DINamespace(name: "cmp", scope: !332)
!332 = !DINamespace(name: "float", scope: !324)
!333 = !{!334, !335, !336, !337}
!334 = !DIEnumerator(name: "Less", value: 0, isUnsigned: true)
!335 = !DIEnumerator(name: "Equal", value: 1, isUnsigned: true)
!336 = !DIEnumerator(name: "Greater", value: 2, isUnsigned: true)
!337 = !DIEnumerator(name: "Unordered", value: 3, isUnsigned: true)
!338 = !{!339, !347, !354, !362}
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "TBL", linkageName: "_ZN17compiler_builtins4math9libm_math4exp23TBL17hbd64ae6fd146de1eE", scope: !341, file: !342, line: 32, type: !343, isLocal: true, isDefinition: true, align: 64)
!341 = !DINamespace(name: "exp2", scope: !322)
!342 = !DIFile(filename: "src/math/../../../libm/src/math/exp2.rs", directory: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/compiler-builtins/compiler-builtins", checksumkind: CSK_MD5, checksum: "074417b8a9712f5ed6909f05a3d43f45")
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 32768, align: 64, elements: !345)
!344 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!345 = !{!346}
!346 = !DISubrange(count: 512, lowerBound: 0)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "EXP2FT", linkageName: "_ZN17compiler_builtins4math9libm_math5exp2f6EXP2FT17h5db5019147ac732cE", scope: !349, file: !350, line: 29, type: !351, isLocal: true, isDefinition: true, align: 64)
!349 = !DINamespace(name: "exp2f", scope: !322)
!350 = !DIFile(filename: "src/math/../../../libm/src/math/exp2f.rs", directory: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/compiler-builtins/compiler-builtins", checksumkind: CSK_MD5, checksum: "aea3b7c98cd2feb5f7a6df1542d12f5a")
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 1024, align: 64, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 16, lowerBound: 0)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "T", linkageName: "_ZN17compiler_builtins4math9libm_math5k_tan1T17h1c95e46686480b93E", scope: !356, file: !357, line: 43, type: !358, isLocal: true, isDefinition: true, align: 64)
!356 = !DINamespace(name: "k_tan", scope: !322)
!357 = !DIFile(filename: "src/math/../../../libm/src/math/k_tan.rs", directory: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/compiler-builtins/compiler-builtins", checksumkind: CSK_MD5, checksum: "085c86acb336854c4790a2fe0590bd18")
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 832, align: 64, elements: !360)
!359 = !DIBasicType(name: "f64", size: 64, encoding: DW_ATE_float)
!360 = !{!361}
!361 = !DISubrange(count: 13, lowerBound: 0)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "RSQRT_TAB", linkageName: "_ZN17compiler_builtins4math9libm_math7generic4sqrt9RSQRT_TAB17h933da1fe11c0618bE", scope: !364, file: !366, line: 350, type: !367, isLocal: false, isDefinition: true, align: 16)
!364 = !DINamespace(name: "sqrt", scope: !365)
!365 = !DINamespace(name: "generic", scope: !322)
!366 = !DIFile(filename: "src/math/../../../libm/src/math/generic/sqrt.rs", directory: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/compiler-builtins/compiler-builtins", checksumkind: CSK_MD5, checksum: "f8744af547951d4fe962b595d4872968")
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 2048, align: 16, elements: !369)
!368 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!369 = !{!370}
!370 = !DISubrange(count: 128, lowerBound: 0)
!371 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !372, producer: "clang LLVM (rustc version 1.92.0-nightly (6380899f3 2025-10-18))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !373, globals: !582, splitDebugInlining: false, nameTableKind: None)
!372 = !DIFile(filename: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core/src/lib.rs/@/core.59ec04a6a071a35f-cgu.0", directory: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core")
!373 = !{!374, !33, !506, !514, !521, !526, !530, !535, !83, !540, !545, !555, !46, !559, !566, !571, !576}
!374 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AsciiChar", scope: !375, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !377)
!375 = !DINamespace(name: "ascii_char", scope: !376)
!376 = !DINamespace(name: "ascii", scope: !35)
!377 = !{!378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505}
!378 = !DIEnumerator(name: "Null", value: 0, isUnsigned: true)
!379 = !DIEnumerator(name: "StartOfHeading", value: 1, isUnsigned: true)
!380 = !DIEnumerator(name: "StartOfText", value: 2, isUnsigned: true)
!381 = !DIEnumerator(name: "EndOfText", value: 3, isUnsigned: true)
!382 = !DIEnumerator(name: "EndOfTransmission", value: 4, isUnsigned: true)
!383 = !DIEnumerator(name: "Enquiry", value: 5, isUnsigned: true)
!384 = !DIEnumerator(name: "Acknowledge", value: 6, isUnsigned: true)
!385 = !DIEnumerator(name: "Bell", value: 7, isUnsigned: true)
!386 = !DIEnumerator(name: "Backspace", value: 8, isUnsigned: true)
!387 = !DIEnumerator(name: "CharacterTabulation", value: 9, isUnsigned: true)
!388 = !DIEnumerator(name: "LineFeed", value: 10, isUnsigned: true)
!389 = !DIEnumerator(name: "LineTabulation", value: 11, isUnsigned: true)
!390 = !DIEnumerator(name: "FormFeed", value: 12, isUnsigned: true)
!391 = !DIEnumerator(name: "CarriageReturn", value: 13, isUnsigned: true)
!392 = !DIEnumerator(name: "ShiftOut", value: 14, isUnsigned: true)
!393 = !DIEnumerator(name: "ShiftIn", value: 15, isUnsigned: true)
!394 = !DIEnumerator(name: "DataLinkEscape", value: 16, isUnsigned: true)
!395 = !DIEnumerator(name: "DeviceControlOne", value: 17, isUnsigned: true)
!396 = !DIEnumerator(name: "DeviceControlTwo", value: 18, isUnsigned: true)
!397 = !DIEnumerator(name: "DeviceControlThree", value: 19, isUnsigned: true)
!398 = !DIEnumerator(name: "DeviceControlFour", value: 20, isUnsigned: true)
!399 = !DIEnumerator(name: "NegativeAcknowledge", value: 21, isUnsigned: true)
!400 = !DIEnumerator(name: "SynchronousIdle", value: 22, isUnsigned: true)
!401 = !DIEnumerator(name: "EndOfTransmissionBlock", value: 23, isUnsigned: true)
!402 = !DIEnumerator(name: "Cancel", value: 24, isUnsigned: true)
!403 = !DIEnumerator(name: "EndOfMedium", value: 25, isUnsigned: true)
!404 = !DIEnumerator(name: "Substitute", value: 26, isUnsigned: true)
!405 = !DIEnumerator(name: "Escape", value: 27, isUnsigned: true)
!406 = !DIEnumerator(name: "InformationSeparatorFour", value: 28, isUnsigned: true)
!407 = !DIEnumerator(name: "InformationSeparatorThree", value: 29, isUnsigned: true)
!408 = !DIEnumerator(name: "InformationSeparatorTwo", value: 30, isUnsigned: true)
!409 = !DIEnumerator(name: "InformationSeparatorOne", value: 31, isUnsigned: true)
!410 = !DIEnumerator(name: "Space", value: 32, isUnsigned: true)
!411 = !DIEnumerator(name: "ExclamationMark", value: 33, isUnsigned: true)
!412 = !DIEnumerator(name: "QuotationMark", value: 34, isUnsigned: true)
!413 = !DIEnumerator(name: "NumberSign", value: 35, isUnsigned: true)
!414 = !DIEnumerator(name: "DollarSign", value: 36, isUnsigned: true)
!415 = !DIEnumerator(name: "PercentSign", value: 37, isUnsigned: true)
!416 = !DIEnumerator(name: "Ampersand", value: 38, isUnsigned: true)
!417 = !DIEnumerator(name: "Apostrophe", value: 39, isUnsigned: true)
!418 = !DIEnumerator(name: "LeftParenthesis", value: 40, isUnsigned: true)
!419 = !DIEnumerator(name: "RightParenthesis", value: 41, isUnsigned: true)
!420 = !DIEnumerator(name: "Asterisk", value: 42, isUnsigned: true)
!421 = !DIEnumerator(name: "PlusSign", value: 43, isUnsigned: true)
!422 = !DIEnumerator(name: "Comma", value: 44, isUnsigned: true)
!423 = !DIEnumerator(name: "HyphenMinus", value: 45, isUnsigned: true)
!424 = !DIEnumerator(name: "FullStop", value: 46, isUnsigned: true)
!425 = !DIEnumerator(name: "Solidus", value: 47, isUnsigned: true)
!426 = !DIEnumerator(name: "Digit0", value: 48, isUnsigned: true)
!427 = !DIEnumerator(name: "Digit1", value: 49, isUnsigned: true)
!428 = !DIEnumerator(name: "Digit2", value: 50, isUnsigned: true)
!429 = !DIEnumerator(name: "Digit3", value: 51, isUnsigned: true)
!430 = !DIEnumerator(name: "Digit4", value: 52, isUnsigned: true)
!431 = !DIEnumerator(name: "Digit5", value: 53, isUnsigned: true)
!432 = !DIEnumerator(name: "Digit6", value: 54, isUnsigned: true)
!433 = !DIEnumerator(name: "Digit7", value: 55, isUnsigned: true)
!434 = !DIEnumerator(name: "Digit8", value: 56, isUnsigned: true)
!435 = !DIEnumerator(name: "Digit9", value: 57, isUnsigned: true)
!436 = !DIEnumerator(name: "Colon", value: 58, isUnsigned: true)
!437 = !DIEnumerator(name: "Semicolon", value: 59, isUnsigned: true)
!438 = !DIEnumerator(name: "LessThanSign", value: 60, isUnsigned: true)
!439 = !DIEnumerator(name: "EqualsSign", value: 61, isUnsigned: true)
!440 = !DIEnumerator(name: "GreaterThanSign", value: 62, isUnsigned: true)
!441 = !DIEnumerator(name: "QuestionMark", value: 63, isUnsigned: true)
!442 = !DIEnumerator(name: "CommercialAt", value: 64, isUnsigned: true)
!443 = !DIEnumerator(name: "CapitalA", value: 65, isUnsigned: true)
!444 = !DIEnumerator(name: "CapitalB", value: 66, isUnsigned: true)
!445 = !DIEnumerator(name: "CapitalC", value: 67, isUnsigned: true)
!446 = !DIEnumerator(name: "CapitalD", value: 68, isUnsigned: true)
!447 = !DIEnumerator(name: "CapitalE", value: 69, isUnsigned: true)
!448 = !DIEnumerator(name: "CapitalF", value: 70, isUnsigned: true)
!449 = !DIEnumerator(name: "CapitalG", value: 71, isUnsigned: true)
!450 = !DIEnumerator(name: "CapitalH", value: 72, isUnsigned: true)
!451 = !DIEnumerator(name: "CapitalI", value: 73, isUnsigned: true)
!452 = !DIEnumerator(name: "CapitalJ", value: 74, isUnsigned: true)
!453 = !DIEnumerator(name: "CapitalK", value: 75, isUnsigned: true)
!454 = !DIEnumerator(name: "CapitalL", value: 76, isUnsigned: true)
!455 = !DIEnumerator(name: "CapitalM", value: 77, isUnsigned: true)
!456 = !DIEnumerator(name: "CapitalN", value: 78, isUnsigned: true)
!457 = !DIEnumerator(name: "CapitalO", value: 79, isUnsigned: true)
!458 = !DIEnumerator(name: "CapitalP", value: 80, isUnsigned: true)
!459 = !DIEnumerator(name: "CapitalQ", value: 81, isUnsigned: true)
!460 = !DIEnumerator(name: "CapitalR", value: 82, isUnsigned: true)
!461 = !DIEnumerator(name: "CapitalS", value: 83, isUnsigned: true)
!462 = !DIEnumerator(name: "CapitalT", value: 84, isUnsigned: true)
!463 = !DIEnumerator(name: "CapitalU", value: 85, isUnsigned: true)
!464 = !DIEnumerator(name: "CapitalV", value: 86, isUnsigned: true)
!465 = !DIEnumerator(name: "CapitalW", value: 87, isUnsigned: true)
!466 = !DIEnumerator(name: "CapitalX", value: 88, isUnsigned: true)
!467 = !DIEnumerator(name: "CapitalY", value: 89, isUnsigned: true)
!468 = !DIEnumerator(name: "CapitalZ", value: 90, isUnsigned: true)
!469 = !DIEnumerator(name: "LeftSquareBracket", value: 91, isUnsigned: true)
!470 = !DIEnumerator(name: "ReverseSolidus", value: 92, isUnsigned: true)
!471 = !DIEnumerator(name: "RightSquareBracket", value: 93, isUnsigned: true)
!472 = !DIEnumerator(name: "CircumflexAccent", value: 94, isUnsigned: true)
!473 = !DIEnumerator(name: "LowLine", value: 95, isUnsigned: true)
!474 = !DIEnumerator(name: "GraveAccent", value: 96, isUnsigned: true)
!475 = !DIEnumerator(name: "SmallA", value: 97, isUnsigned: true)
!476 = !DIEnumerator(name: "SmallB", value: 98, isUnsigned: true)
!477 = !DIEnumerator(name: "SmallC", value: 99, isUnsigned: true)
!478 = !DIEnumerator(name: "SmallD", value: 100, isUnsigned: true)
!479 = !DIEnumerator(name: "SmallE", value: 101, isUnsigned: true)
!480 = !DIEnumerator(name: "SmallF", value: 102, isUnsigned: true)
!481 = !DIEnumerator(name: "SmallG", value: 103, isUnsigned: true)
!482 = !DIEnumerator(name: "SmallH", value: 104, isUnsigned: true)
!483 = !DIEnumerator(name: "SmallI", value: 105, isUnsigned: true)
!484 = !DIEnumerator(name: "SmallJ", value: 106, isUnsigned: true)
!485 = !DIEnumerator(name: "SmallK", value: 107, isUnsigned: true)
!486 = !DIEnumerator(name: "SmallL", value: 108, isUnsigned: true)
!487 = !DIEnumerator(name: "SmallM", value: 109, isUnsigned: true)
!488 = !DIEnumerator(name: "SmallN", value: 110, isUnsigned: true)
!489 = !DIEnumerator(name: "SmallO", value: 111, isUnsigned: true)
!490 = !DIEnumerator(name: "SmallP", value: 112, isUnsigned: true)
!491 = !DIEnumerator(name: "SmallQ", value: 113, isUnsigned: true)
!492 = !DIEnumerator(name: "SmallR", value: 114, isUnsigned: true)
!493 = !DIEnumerator(name: "SmallS", value: 115, isUnsigned: true)
!494 = !DIEnumerator(name: "SmallT", value: 116, isUnsigned: true)
!495 = !DIEnumerator(name: "SmallU", value: 117, isUnsigned: true)
!496 = !DIEnumerator(name: "SmallV", value: 118, isUnsigned: true)
!497 = !DIEnumerator(name: "SmallW", value: 119, isUnsigned: true)
!498 = !DIEnumerator(name: "SmallX", value: 120, isUnsigned: true)
!499 = !DIEnumerator(name: "SmallY", value: 121, isUnsigned: true)
!500 = !DIEnumerator(name: "SmallZ", value: 122, isUnsigned: true)
!501 = !DIEnumerator(name: "LeftCurlyBracket", value: 123, isUnsigned: true)
!502 = !DIEnumerator(name: "VerticalLine", value: 124, isUnsigned: true)
!503 = !DIEnumerator(name: "RightCurlyBracket", value: 125, isUnsigned: true)
!504 = !DIEnumerator(name: "Tilde", value: 126, isUnsigned: true)
!505 = !DIEnumerator(name: "Delete", value: 127, isUnsigned: true)
!506 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IntErrorKind", scope: !507, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !508)
!507 = !DINamespace(name: "error", scope: !246)
!508 = !{!509, !510, !511, !512, !513}
!509 = !DIEnumerator(name: "Empty", value: 0, isUnsigned: true)
!510 = !DIEnumerator(name: "InvalidDigit", value: 1, isUnsigned: true)
!511 = !DIEnumerator(name: "PosOverflow", value: 2, isUnsigned: true)
!512 = !DIEnumerator(name: "NegOverflow", value: 3, isUnsigned: true)
!513 = !DIEnumerator(name: "Zero", value: 4, isUnsigned: true)
!514 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FpCategory", scope: !246, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !515)
!515 = !{!516, !517, !518, !519, !520}
!516 = !DIEnumerator(name: "Nan", value: 0, isUnsigned: true)
!517 = !DIEnumerator(name: "Infinite", value: 1, isUnsigned: true)
!518 = !DIEnumerator(name: "Zero", value: 2, isUnsigned: true)
!519 = !DIEnumerator(name: "Subnormal", value: 3, isUnsigned: true)
!520 = !DIEnumerator(name: "Normal", value: 4, isUnsigned: true)
!521 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DebugAsHex", scope: !522, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !523)
!522 = !DINamespace(name: "fmt", scope: !35)
!523 = !{!524, !525}
!524 = !DIEnumerator(name: "Lower", value: 0, isUnsigned: true)
!525 = !DIEnumerator(name: "Upper", value: 1, isUnsigned: true)
!526 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sign", scope: !522, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !527)
!527 = !{!528, !529}
!528 = !DIEnumerator(name: "Plus", value: 0, isUnsigned: true)
!529 = !DIEnumerator(name: "Minus", value: 1, isUnsigned: true)
!530 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !522, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !531)
!531 = !{!532, !533, !534}
!532 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!533 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!534 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!535 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !536, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !537)
!536 = !DINamespace(name: "ffi", scope: !35)
!537 = !{!538, !539}
!538 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!539 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!540 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Sign", scope: !541, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !542)
!541 = !DINamespace(name: "flt2dec", scope: !246)
!542 = !{!543, !544}
!543 = !DIEnumerator(name: "Minus", value: 0, isUnsigned: true)
!544 = !DIEnumerator(name: "MinusPlus", value: 1, isUnsigned: true)
!545 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AddrKind", scope: !546, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !548)
!546 = !DINamespace(name: "parser", scope: !547)
!547 = !DINamespace(name: "net", scope: !35)
!548 = !{!549, !550, !551, !552, !553, !554}
!549 = !DIEnumerator(name: "Ip", value: 0, isUnsigned: true)
!550 = !DIEnumerator(name: "Ipv4", value: 1, isUnsigned: true)
!551 = !DIEnumerator(name: "Ipv6", value: 2, isUnsigned: true)
!552 = !DIEnumerator(name: "Socket", value: 3, isUnsigned: true)
!553 = !DIEnumerator(name: "SocketV4", value: 4, isUnsigned: true)
!554 = !DIEnumerator(name: "SocketV6", value: 5, isUnsigned: true)
!555 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FloatErrorKind", scope: !556, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !557)
!556 = !DINamespace(name: "dec2flt", scope: !246)
!557 = !{!509, !558}
!558 = !DIEnumerator(name: "Invalid", value: 1, isUnsigned: true)
!559 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !180, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !560)
!560 = !{!561, !562, !563, !564, !565}
!561 = !DIEnumerator(name: "Relaxed", value: 0, isUnsigned: true)
!562 = !DIEnumerator(name: "Release", value: 1, isUnsigned: true)
!563 = !DIEnumerator(name: "Acquire", value: 2, isUnsigned: true)
!564 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!565 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!566 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GetDisjointMutError", scope: !567, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !568)
!567 = !DINamespace(name: "slice", scope: !35)
!568 = !{!569, !570}
!569 = !DIEnumerator(name: "IndexOutOfBounds", value: 0, isUnsigned: true)
!570 = !DIEnumerator(name: "OverlappingIndices", value: 1, isUnsigned: true)
!571 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TryFromFloatSecsErrorKind", scope: !572, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !573)
!572 = !DINamespace(name: "time", scope: !35)
!573 = !{!574, !575}
!574 = !DIEnumerator(name: "Negative", value: 0, isUnsigned: true)
!575 = !DIEnumerator(name: "OverflowOrNan", value: 1, isUnsigned: true)
!576 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CharErrorKind", scope: !577, file: !2, baseType: !27, size: 8, align: 8, flags: DIFlagEnumClass, elements: !579)
!577 = !DINamespace(name: "convert", scope: !578)
!578 = !DINamespace(name: "char", scope: !35)
!579 = !{!580, !581}
!580 = !DIEnumerator(name: "EmptyString", value: 0, isUnsigned: true)
!581 = !DIEnumerator(name: "TooManyChars", value: 1, isUnsigned: true)
!582 = !{!583, !591, !621, !635, !644, !662, !673, !687, !694, !699, !704, !709, !711, !716, !729, !741, !746, !757, !763, !768, !774, !780, !786, !791, !797, !802, !808, !813, !819, !824, !832, !837, !842, !848, !854, !859, !864, !869, !879, !881, !890, !899, !0, !908, !916, !924, !952, !964, !980, !996, !998, !1006, !1008, !1036, !1053, !1070}
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "DECIMAL_PAIRS", linkageName: "_ZN4core3fmt3num13DECIMAL_PAIRS17h30bc2643b2a81b2eE", scope: !585, file: !586, line: 100, type: !587, isLocal: true, isDefinition: true, align: 32)
!585 = !DINamespace(name: "num", scope: !522)
!586 = !DIFile(filename: "src/fmt/num.rs", directory: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core", checksumkind: CSK_MD5, checksum: "14f1acdd980d957a36bf4243cc704071")
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[u8; 200]", baseType: !588, size: 32, align: 32, dwarfAddressSpace: 0)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1600, align: 8, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 200, lowerBound: 0)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "<core::fmt::builders::PadAdapter as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !593, isLocal: true, isDefinition: true)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<core::fmt::builders::PadAdapter as core::fmt::Write>::{vtable_type}", file: !2, size: 192, align: 32, flags: DIFlagArtificial, elements: !594, vtableHolder: !601, templateParams: !13, identifier: "a0dc26ee3f371b4d5c2e8d5b0296465e")
!594 = !{!595, !596, !597, !598, !599, !600}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !593, file: !2, baseType: !6, size: 32, align: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !593, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !593, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !593, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !593, file: !2, baseType: !6, size: 32, align: 32, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !593, file: !2, baseType: !6, size: 32, align: 32, offset: 160)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PadAdapter", scope: !602, file: !2, size: 96, align: 32, flags: DIFlagPrivate, elements: !603, templateParams: !13, identifier: "bc859c4669254e3a98c23c455549b145")
!602 = !DINamespace(name: "builders", scope: !522)
!603 = !{!604, !615}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !601, file: !2, baseType: !605, size: 64, align: 32, flags: DIFlagPrivate)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 64, align: 32, elements: !606, templateParams: !13, identifier: "ed1fc41b72305de4afb5dbb44887680d")
!606 = !{!607, !610}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !605, file: !2, baseType: !608, size: 32, align: 32)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 32, align: 32, dwarfAddressSpace: 0)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !13, identifier: "3bd7022d6bc7a1bba9386a42dfa7db9d")
!610 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !605, file: !2, baseType: !611, size: 32, align: 32, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 6]", baseType: !612, size: 32, align: 32, dwarfAddressSpace: 0)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 32, elements: !613)
!613 = !{!614}
!614 = !DISubrange(count: 6, lowerBound: 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !601, file: !2, baseType: !616, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::PadAdapterState", baseType: !617, size: 32, align: 32, dwarfAddressSpace: 0)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PadAdapterState", scope: !602, file: !2, size: 8, align: 8, flags: DIFlagPrivate, elements: !618, templateParams: !13, identifier: "c9290a98264a18011c015738ac4fc55f")
!618 = !{!619}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "on_newline", scope: !617, file: !2, baseType: !620, size: 8, align: 8, flags: DIFlagPrivate)
!620 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "<core::wtf8::{impl#15}::fmt::CodeUnit as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !623, isLocal: true, isDefinition: true)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<core::wtf8::{impl#15}::fmt::CodeUnit as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !624, vtableHolder: !629, templateParams: !13, identifier: "ca7f22914b52639b763b3a40a493194")
!624 = !{!625, !626, !627, !628}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !623, file: !2, baseType: !6, size: 32, align: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !623, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !623, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !623, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodeUnit", scope: !630, file: !2, size: 16, align: 16, flags: DIFlagProtected, elements: !633, templateParams: !13, identifier: "e80edcd0e64dd05de89cc229c6984894")
!630 = !DINamespace(name: "fmt", scope: !631)
!631 = !DINamespace(name: "{impl#15}", scope: !632)
!632 = !DINamespace(name: "wtf8", scope: !35)
!633 = !{!634}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !629, file: !2, baseType: !368, size: 16, align: 16, flags: DIFlagProtected)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "<char as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !637, isLocal: true, isDefinition: true)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<char as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !638, vtableHolder: !643, templateParams: !13, identifier: "f60f4d3e63602cb53179def32e300394")
!638 = !{!639, !640, !641, !642}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !637, file: !2, baseType: !6, size: 32, align: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !637, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !637, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !637, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!643 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "<&dyn core::fmt::Debug as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !646, isLocal: true, isDefinition: true)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&dyn core::fmt::Debug as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !647, vtableHolder: !652, templateParams: !13, identifier: "420b95861212e7fd73d42ce1e076e2d2")
!647 = !{!648, !649, !650, !651}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !646, file: !2, baseType: !6, size: 32, align: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !646, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !646, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !646, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "&dyn core::fmt::Debug", file: !2, size: 64, align: 32, elements: !653, templateParams: !13, identifier: "f621565895f83eb86021d7f82a9f11c7")
!653 = !{!654, !657}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !652, file: !2, baseType: !655, size: 32, align: 32)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 32, align: 32, dwarfAddressSpace: 0)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Debug", file: !2, align: 8, elements: !13, identifier: "c3b7a2a6681ed1de85d5a0424ad0bd95")
!657 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !652, file: !2, baseType: !658, size: 32, align: 32, offset: 32)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 4]", baseType: !659, size: 32, align: 32, dwarfAddressSpace: 0)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 128, align: 32, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 4, lowerBound: 0)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "POWER_OF_FIVE_128", linkageName: "_ZN4core3num7dec2flt5table17POWER_OF_FIVE_12817h5ef6f4ab9fabc876E", scope: !664, file: !665, line: 19, type: !666, isLocal: true, isDefinition: true, align: 64)
!664 = !DINamespace(name: "table", scope: !556)
!665 = !DIFile(filename: "src/num/dec2flt/table.rs", directory: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core", checksumkind: CSK_MD5, checksum: "e38eadfb13801d55efeca9f00b00d0d6")
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 83328, align: 64, elements: !671)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "(u64, u64)", file: !2, size: 128, align: 64, elements: !668, templateParams: !13, identifier: "f2337817de4d53af9da5828179fbac1e")
!668 = !{!669, !670}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !667, file: !2, baseType: !344, size: 64, align: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !667, file: !2, baseType: !344, size: 64, align: 64, offset: 64)
!671 = !{!672}
!672 = !DISubrange(count: 651, lowerBound: 0)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "CACHED_POW10", linkageName: "_ZN4core3num7flt2dec8strategy5grisu12CACHED_POW1017h7e29ead6ee58e6a5E", scope: !675, file: !677, line: 29, type: !678, isLocal: false, isDefinition: true, align: 64)
!675 = !DINamespace(name: "grisu", scope: !676)
!676 = !DINamespace(name: "strategy", scope: !541)
!677 = !DIFile(filename: "src/num/flt2dec/strategy/grisu.rs", directory: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core", checksumkind: CSK_MD5, checksum: "9f6d4a4bc3c2c5893d7e12826eecaa99")
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !679, size: 10368, align: 64, elements: !685)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "(u64, i16, i16)", file: !2, size: 128, align: 64, elements: !680, templateParams: !13, identifier: "66b38d0c96f73cb213ebd78919d7f681")
!680 = !{!681, !682, !684}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !679, file: !2, baseType: !344, size: 64, align: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !679, file: !2, baseType: !683, size: 16, align: 16, offset: 64)
!683 = !DIBasicType(name: "i16", size: 16, encoding: DW_ATE_signed)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !679, file: !2, baseType: !683, size: 16, align: 16, offset: 80)
!685 = !{!686}
!686 = !DISubrange(count: 81, lowerBound: 0)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "POW10", linkageName: "_ZN4core3num7flt2dec8strategy6dragon5POW1017hb54ba8d455804977E", scope: !689, file: !690, line: 13, type: !691, isLocal: true, isDefinition: true, align: 32)
!689 = !DINamespace(name: "dragon", scope: !676)
!690 = !DIFile(filename: "src/num/flt2dec/strategy/dragon.rs", directory: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core", checksumkind: CSK_MD5, checksum: "35e8756e0f71b7c521e05f066afd08cc")
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 320, align: 32, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 10, lowerBound: 0)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "POW5TO16", linkageName: "_ZN4core3num7flt2dec8strategy6dragon8POW5TO1617h17f6e2f80b01266fE", scope: !689, file: !690, line: 16, type: !696, isLocal: true, isDefinition: true, align: 32)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 64, align: 32, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 2, lowerBound: 0)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "POW5TO32", linkageName: "_ZN4core3num7flt2dec8strategy6dragon8POW5TO3217hdcf275d57290003fE", scope: !689, file: !690, line: 17, type: !701, isLocal: true, isDefinition: true, align: 32)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 96, align: 32, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 3, lowerBound: 0)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "POW5TO64", linkageName: "_ZN4core3num7flt2dec8strategy6dragon8POW5TO6417ha6b6e46ed77040e0E", scope: !689, file: !690, line: 18, type: !706, isLocal: true, isDefinition: true, align: 32)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 160, align: 32, elements: !707)
!707 = !{!708}
!708 = !DISubrange(count: 5, lowerBound: 0)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "POW5TO128", linkageName: "_ZN4core3num7flt2dec8strategy6dragon9POW5TO12817h37353c2150d886fdE", scope: !689, file: !690, line: 19, type: !691, isLocal: true, isDefinition: true, align: 32)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "POW5TO256", linkageName: "_ZN4core3num7flt2dec8strategy6dragon9POW5TO25617h2c098f5029007b08E", scope: !689, file: !690, line: 23, type: !713, isLocal: true, isDefinition: true, align: 32)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 608, align: 32, elements: !714)
!714 = !{!715}
!715 = !DISubrange(count: 19, lowerBound: 0)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "<core::panic::panic_info::{impl#0}::payload::NoPayload as core::any::Any>::{vtable}", scope: null, file: !2, type: !718, isLocal: true, isDefinition: true)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<core::panic::panic_info::{impl#0}::payload::NoPayload as core::any::Any>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !719, vtableHolder: !724, templateParams: !13, identifier: "d034e89599ab24223628212ef69f1495")
!719 = !{!720, !721, !722, !723}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !718, file: !2, baseType: !6, size: 32, align: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !718, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !718, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !718, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NoPayload", scope: !725, file: !2, align: 8, flags: DIFlagProtected, elements: !13, identifier: "a5fa5a45d9abcfe87aa6b5cecac39464")
!725 = !DINamespace(name: "payload", scope: !726)
!726 = !DINamespace(name: "{impl#0}", scope: !727)
!727 = !DINamespace(name: "panic_info", scope: !728)
!728 = !DINamespace(name: "panic", scope: !35)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "SHORT_OFFSET_RUNS", linkageName: "_ZN4core7unicode12unicode_data10alphabetic17SHORT_OFFSET_RUNS17hfb06312dbf3ea7efE", scope: !731, file: !734, line: 149, type: !735, isLocal: true, isDefinition: true, align: 32)
!731 = !DINamespace(name: "alphabetic", scope: !732)
!732 = !DINamespace(name: "unicode_data", scope: !733)
!733 = !DINamespace(name: "unicode", scope: !35)
!734 = !DIFile(filename: "src/unicode/unicode_data.rs", directory: "/Users/namse/.rustup/toolchains/nightly-aarch64-apple-darwin/lib/rustlib/src/rust/library/core", checksumkind: CSK_MD5, checksum: "f8471147458c614569650135e63cd79a")
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !736, size: 1632, align: 32, elements: !739)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ShortOffsetRunHeader", scope: !732, file: !2, size: 32, align: 32, flags: DIFlagPrivate, elements: !737, templateParams: !13, identifier: "e37c1bafdb7cf94c107e4094cfa35988")
!737 = !{!738}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !736, file: !2, baseType: !49, size: 32, align: 32, flags: DIFlagPrivate)
!739 = !{!740}
!740 = !DISubrange(count: 51, lowerBound: 0)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "OFFSETS", linkageName: "_ZN4core7unicode12unicode_data10alphabetic7OFFSETS17h9c3919bf3c2d66a4E", scope: !731, file: !734, line: 177, type: !743, isLocal: true, isDefinition: true, align: 8)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 12152, align: 8, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 1519, lowerBound: 0)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "LOWERCASE_TABLE", linkageName: "_ZN4core7unicode12unicode_data11conversions15LOWERCASE_TABLE17h85190c0d78758c41E", scope: !748, file: !734, line: 797, type: !749, isLocal: true, isDefinition: true, align: 32)
!748 = !DINamespace(name: "conversions", scope: !732)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[(char, u32); 1462]", baseType: !750, size: 32, align: 32, dwarfAddressSpace: 0)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !751, size: 93568, align: 32, elements: !755)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "(char, u32)", file: !2, size: 64, align: 32, elements: !752, templateParams: !13, identifier: "2683380cdfb72f94a85a20fa3edd3d17")
!752 = !{!753, !754}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !751, file: !2, baseType: !643, size: 32, align: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !751, file: !2, baseType: !49, size: 32, align: 32, offset: 32)
!755 = !{!756}
!756 = !DISubrange(count: 1462, lowerBound: 0)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "UPPERCASE_TABLE", linkageName: "_ZN4core7unicode12unicode_data11conversions15UPPERCASE_TABLE17hdb56c3a251793aefE", scope: !748, file: !734, line: 1158, type: !759, isLocal: true, isDefinition: true, align: 32)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[(char, u32); 1554]", baseType: !760, size: 32, align: 32, dwarfAddressSpace: 0)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !751, size: 99456, align: 32, elements: !761)
!761 = !{!762}
!762 = !DISubrange(count: 1554, lowerBound: 0)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "LOWERCASE_TABLE_MULTI", linkageName: "_ZN4core7unicode12unicode_data11conversions21LOWERCASE_TABLE_MULTI17h2add866ca8302897E", scope: !748, file: !734, line: 1154, type: !765, isLocal: true, isDefinition: true, align: 32)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[[char; 3]; 1]", baseType: !766, size: 32, align: 32, dwarfAddressSpace: 0)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 96, align: 32, elements: !191)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 96, align: 32, elements: !702)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "UPPERCASE_TABLE_MULTI", linkageName: "_ZN4core7unicode12unicode_data11conversions21UPPERCASE_TABLE_MULTI17hfbb81e2e1eabc057E", scope: !748, file: !734, line: 1538, type: !770, isLocal: true, isDefinition: true, align: 32)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[[char; 3]; 102]", baseType: !771, size: 32, align: 32, dwarfAddressSpace: 0)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 9792, align: 32, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 102, lowerBound: 0)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "WHITESPACE_MAP", linkageName: "_ZN4core7unicode12unicode_data11white_space14WHITESPACE_MAP17h203392796fcd6818E", scope: !776, file: !734, line: 735, type: !777, isLocal: false, isDefinition: true, align: 8)
!776 = !DINamespace(name: "white_space", scope: !732)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2048, align: 8, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 256, lowerBound: 0)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "SHORT_OFFSET_RUNS", linkageName: "_ZN4core7unicode12unicode_data14case_ignorable17SHORT_OFFSET_RUNS17he6fcf9dceafbb8daE", scope: !782, file: !734, line: 261, type: !783, isLocal: true, isDefinition: true, align: 32)
!782 = !DINamespace(name: "case_ignorable", scope: !732)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !736, size: 1152, align: 32, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 36, lowerBound: 0)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "OFFSETS", linkageName: "_ZN4core7unicode12unicode_data14case_ignorable7OFFSETS17h68fdd31ae8adb30aE", scope: !782, file: !734, line: 281, type: !788, isLocal: true, isDefinition: true, align: 8)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 7352, align: 8, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 919, lowerBound: 0)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "SHORT_OFFSET_RUNS", linkageName: "_ZN4core7unicode12unicode_data15grapheme_extend17SHORT_OFFSET_RUNS17h5585378810f1af05E", scope: !793, file: !734, line: 396, type: !794, isLocal: true, isDefinition: true, align: 32)
!793 = !DINamespace(name: "grapheme_extend", scope: !732)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !736, size: 1056, align: 32, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 33, lowerBound: 0)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "OFFSETS", linkageName: "_ZN4core7unicode12unicode_data15grapheme_extend7OFFSETS17hd521c9350acba5beE", scope: !793, file: !734, line: 415, type: !799, isLocal: true, isDefinition: true, align: 8)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 6136, align: 8, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 767, lowerBound: 0)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "SHORT_OFFSET_RUNS", linkageName: "_ZN4core7unicode12unicode_data1n17SHORT_OFFSET_RUNS17h5d432f4a6c3f2e09E", scope: !804, file: !734, line: 580, type: !805, isLocal: true, isDefinition: true, align: 32)
!804 = !DINamespace(name: "n", scope: !732)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !736, size: 1376, align: 32, elements: !806)
!806 = !{!807}
!807 = !DISubrange(count: 43, lowerBound: 0)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(name: "OFFSETS", linkageName: "_ZN4core7unicode12unicode_data1n7OFFSETS17h1038de5c2382dd1fE", scope: !804, file: !734, line: 604, type: !810, isLocal: true, isDefinition: true, align: 8)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2328, align: 8, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 291, lowerBound: 0)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "SHORT_OFFSET_RUNS", linkageName: "_ZN4core7unicode12unicode_data5cased17SHORT_OFFSET_RUNS17hed0dbe9bc7650023E", scope: !815, file: !734, line: 343, type: !816, isLocal: true, isDefinition: true, align: 32)
!815 = !DINamespace(name: "cased", scope: !732)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !736, size: 704, align: 32, elements: !817)
!817 = !{!818}
!818 = !DISubrange(count: 22, lowerBound: 0)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "OFFSETS", linkageName: "_ZN4core7unicode12unicode_data5cased7OFFSETS17h086de7709c8c92eaE", scope: !815, file: !734, line: 356, type: !821, isLocal: true, isDefinition: true, align: 8)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 2504, align: 8, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 313, lowerBound: 0)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(name: "BITSET_MAPPING", linkageName: "_ZN4core7unicode12unicode_data9lowercase14BITSET_MAPPING17h309de2dcf779c86eE", scope: !826, file: !734, line: 557, type: !827, isLocal: false, isDefinition: true, align: 8)
!826 = !DINamespace(name: "lowercase", scope: !732)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !828, size: 352, align: 8, elements: !817)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "(u8, u8)", file: !2, size: 16, align: 8, elements: !829, templateParams: !13, identifier: "f4b7e472880c1eed6202c94d47b8ebff")
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !828, file: !2, baseType: !27, size: 8, align: 8)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !828, file: !2, baseType: !27, size: 8, align: 8, offset: 8)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "BITSET_CANONICAL", linkageName: "_ZN4core7unicode12unicode_data9lowercase16BITSET_CANONICAL17h8eb31a10d1095013E", scope: !826, file: !734, line: 498, type: !834, isLocal: false, isDefinition: true, align: 64)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 3648, align: 64, elements: !835)
!835 = !{!836}
!836 = !DISubrange(count: 57, lowerBound: 0)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "BITSET_CHUNKS_MAP", linkageName: "_ZN4core7unicode12unicode_data9lowercase17BITSET_CHUNKS_MAP17h2a7e6f20c25b1a3aE", scope: !826, file: !734, line: 469, type: !839, isLocal: false, isDefinition: true, align: 8)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 984, align: 8, elements: !840)
!840 = !{!841}
!841 = !DISubrange(count: 123, lowerBound: 0)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "BITSET_INDEX_CHUNKS", linkageName: "_ZN4core7unicode12unicode_data9lowercase19BITSET_INDEX_CHUNKS17h4a9e2016eb2cec89E", scope: !826, file: !734, line: 476, type: !844, isLocal: false, isDefinition: true, align: 8)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 2560, align: 8, elements: !846)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 128, align: 8, elements: !352)
!846 = !{!847}
!847 = !DISubrange(count: 20, lowerBound: 0)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "BITSET_MAPPING", linkageName: "_ZN4core7unicode12unicode_data9uppercase14BITSET_MAPPING17hdbd24c8a2260c408E", scope: !850, file: !734, line: 714, type: !851, isLocal: false, isDefinition: true, align: 8)
!850 = !DINamespace(name: "uppercase", scope: !732)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !828, size: 400, align: 8, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 25, lowerBound: 0)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(name: "BITSET_CANONICAL", linkageName: "_ZN4core7unicode12unicode_data9uppercase16BITSET_CANONICAL17hee4b9dcd3f519599E", scope: !850, file: !734, line: 668, type: !856, isLocal: false, isDefinition: true, align: 64)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 2816, align: 64, elements: !857)
!857 = !{!858}
!858 = !DISubrange(count: 44, lowerBound: 0)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(name: "BITSET_CHUNKS_MAP", linkageName: "_ZN4core7unicode12unicode_data9uppercase17BITSET_CHUNKS_MAP17h65c884af4b31dd7dE", scope: !850, file: !734, line: 642, type: !861, isLocal: false, isDefinition: true, align: 8)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1000, align: 8, elements: !862)
!862 = !{!863}
!863 = !DISubrange(count: 125, lowerBound: 0)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "BITSET_INDEX_CHUNKS", linkageName: "_ZN4core7unicode12unicode_data9uppercase19BITSET_INDEX_CHUNKS17hbc9283b810dfdc52E", scope: !850, file: !734, line: 649, type: !866, isLocal: false, isDefinition: true, align: 8)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 2176, align: 8, elements: !867)
!867 = !{!868}
!868 = !DISubrange(count: 17, lowerBound: 0)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(name: "<&u128 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !871, isLocal: true, isDefinition: true)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&u128 as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !872, vtableHolder: !877, templateParams: !13, identifier: "ba4cb6bd3053b6fecabcd3505b2b85f5")
!872 = !{!873, !874, !875, !876}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !871, file: !2, baseType: !6, size: 32, align: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !871, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !871, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !871, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u128", baseType: !878, size: 32, align: 32, dwarfAddressSpace: 0)
!878 = !DIBasicType(name: "u128", size: 128, encoding: DW_ATE_unsigned)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(name: "<&core::option::Option<usize> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !141, isLocal: true, isDefinition: true)
!881 = !DIGlobalVariableExpression(var: !882, expr: !DIExpression())
!882 = distinct !DIGlobalVariable(name: "<&i16 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !883, isLocal: true, isDefinition: true)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&i16 as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !884, vtableHolder: !889, templateParams: !13, identifier: "afd466e382ebbfbabfa36524f0942548")
!884 = !{!885, !886, !887, !888}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !883, file: !2, baseType: !6, size: 32, align: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !883, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !883, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !883, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i16", baseType: !683, size: 32, align: 32, dwarfAddressSpace: 0)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "<&u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !892, isLocal: true, isDefinition: true)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !893, vtableHolder: !898, templateParams: !13, identifier: "a4d3bad45e8fd9eda0e0872006c43417")
!893 = !{!894, !895, !896, !897}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !892, file: !2, baseType: !6, size: 32, align: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !892, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !892, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !892, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u32", baseType: !49, size: 32, align: 32, dwarfAddressSpace: 0)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(name: "<&u64 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !901, isLocal: true, isDefinition: true)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&u64 as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !902, vtableHolder: !907, templateParams: !13, identifier: "bba5bb76842d7be037c14b6e2771f2f3")
!902 = !{!903, !904, !905, !906}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !901, file: !2, baseType: !6, size: 32, align: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !901, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !901, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !901, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u64", baseType: !344, size: 32, align: 32, dwarfAddressSpace: 0)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(name: "<() as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !910, isLocal: true, isDefinition: true)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<() as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !911, vtableHolder: !7, templateParams: !13, identifier: "6f7e92bcc51a584f66218b7630fad62d")
!911 = !{!912, !913, !914, !915}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !910, file: !2, baseType: !6, size: 32, align: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !910, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !910, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !910, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(name: "<*const () as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !918, isLocal: true, isDefinition: true)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<*const () as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !919, vtableHolder: !6, templateParams: !13, identifier: "532bd1c1450cbce032397f5df067b3eb")
!919 = !{!920, !921, !922, !923}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !918, file: !2, baseType: !6, size: 32, align: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !918, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !918, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !918, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(name: "<*const core::task::wake::RawWakerVTable as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !926, isLocal: true, isDefinition: true)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<*const core::task::wake::RawWakerVTable as core::fmt::Debug>::{vtable_type}", file: !2, size: 128, align: 32, flags: DIFlagArtificial, elements: !927, vtableHolder: !932, templateParams: !13, identifier: "a735eebaae359cb7c61468b8997ec62e")
!927 = !{!928, !929, !930, !931}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !926, file: !2, baseType: !6, size: 32, align: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !926, file: !2, baseType: !9, size: 32, align: 32, offset: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !926, file: !2, baseType: !9, size: 32, align: 32, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !926, file: !2, baseType: !6, size: 32, align: 32, offset: 96)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::task::wake::RawWakerVTable", baseType: !933, size: 32, align: 32, dwarfAddressSpace: 0)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawWakerVTable", scope: !934, file: !2, size: 128, align: 32, flags: DIFlagPublic, elements: !936, templateParams: !13, identifier: "c2ca00364f82c12038dea59548d11555")
!934 = !DINamespace(name: "wake", scope: !935)
!935 = !DINamespace(name: "task", scope: !35)
!936 = !{!937, !946, !950, !951}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !933, file: !2, baseType: !938, size: 32, align: 32, flags: DIFlagPrivate)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(*const ()) -> core::task::wake::RawWaker", baseType: !939, size: 32, align: 32, dwarfAddressSpace: 0)
!939 = !DISubroutineType(types: !940)
!940 = !{!941, !6}
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawWaker", scope: !934, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !942, templateParams: !13, identifier: "5c83518f028c708afc3c85398f2f0d87")
!942 = !{!943, !944}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !941, file: !2, baseType: !6, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !941, file: !2, baseType: !945, size: 32, align: 32, flags: DIFlagPrivate)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::task::wake::RawWakerVTable", baseType: !933, size: 32, align: 32, dwarfAddressSpace: 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "wake", scope: !933, file: !2, baseType: !947, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(*const ())", baseType: !948, size: 32, align: 32, dwarfAddressSpace: 0)
!948 = !DISubroutineType(types: !949)
!949 = !{null, !6}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "wake_by_ref", scope: !933, file: !2, baseType: !947, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "drop", scope: !933, file: !2, baseType: !947, size: 32, align: 32, offset: 96, flags: DIFlagPrivate)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(name: "<&core::task::wake::Waker as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !954, isLocal: true, isDefinition: true)
